[
    {
        "content": "<p>Should were name \"Move topic\" to \"Move or rename topic\"? We generally conceptualize changing the topic name without changing the stream as \"renaming\" (<a href=\"https://zulip.com/help/rename-a-topic\">https://zulip.com/help/rename-a-topic</a>) rather than \"moving\".</p>",
        "id": 1443346,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1664568177
    },
    {
        "content": "<p>I'm not sure; I think \"Move topic\" alone is more consistently usable in contexts like only partially moving a topic. And I would worry that \"move or rename topic\" might sound too some users like those are two distinct things you can do, not different terms for the same action.</p>",
        "id": 1444611,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1664914799
    },
    {
        "content": "<p>The \"rename\" term is there in the help center because that is a thing folks might search for.</p>",
        "id": 1444612,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1664914824
    },
    {
        "content": "<blockquote>\n<p>\"Move topic\" alone is more consistently usable in contexts like only partially moving a topic</p>\n</blockquote>\n<p>Do you mean after moving messages by time is implemented? Otherwise, that's not currently possible.</p>\n<p>Given that upcoming change, maybe \"Move messages or rename topic\" is better. Or just \"Move messages\"?</p>",
        "id": 1444621,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1664915496
    },
    {
        "content": "<p>We currently plan to use \"Move messages\" for the modal title when it's opened from the message three-dot menu.</p>",
        "id": 1444622,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1664915540
    },
    {
        "content": "<p>I think \"Move topic\" or \"Move messages\" is clear enough; in my mind, renaming is just a special case of moving, that doesn't need to appear in the UI (but we might want to have appear in the /help/ site for search reasons).</p>",
        "id": 1444677,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1664924881
    },
    {
        "content": "<p>I think that renaming being the same as moving for a user is really confusing, and this is part of why I still think we should <a href=\"https://paper.dropbox.com/doc/Topic-IDs-9iSYEXlik9BMMK9uqmTh2\">store topics with IDs</a> and have renaming a topic not actually move any of the messages.</p>",
        "id": 1446176,
        "sender_full_name": "Evy",
        "timestamp": 1665163645
    },
    {
        "content": "<p>I understand you want to push that particular technical architecture change, but I'm not sure I see how it's relevant to the product question here. We don't intend to allow two __different__ topics with the same name; that would be incredibly confusing to say, display in the left sidebar. </p>\n<p>Just about any feature one can build with a \"topic IDs\" data model can also be built with the existing \"topics are strings\" data model. A possible exception is generating a link to a topic that (1) isn't itself an object in the database and (2) still works if the topic is renamed. (Even with topic IDs, it's still tricky to handle corner cases like splitting a topic into two topics, so they're not a panacea).</p>",
        "id": 1446377,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1665180431
    },
    {
        "content": "<p>From a user/product perspective, \"renaming a topic\" and \"moving a topic within a stream\" are just different ways of expressing the same desire -- to have the topic's name be different from what it was before. The reason we prefer the term \"move topic\" is that if you want to merge a topic into another topic, for example, that's a better term than \"rename\".</p>",
        "id": 1446378,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1665180479
    },
    {
        "content": "<p>I think \"Move or rename topic\" is a reasonable name if we want to hint both use cases; but I think having separate menu items for \"move\" vs \"rename\" seems like it'd just add clutter.</p>",
        "id": 1446381,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1665180674
    },
    {
        "content": "<p>\"Edit topic\" would also be a reasonable option, BTW -- you can change it's name or what stream it's in.</p>",
        "id": 1446382,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1665180711
    },
    {
        "content": "<p>Yeah, I was proposing elaborating the name of the menu option, not splitting this one.</p>",
        "id": 1446383,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1665180716
    },
    {
        "content": "<p>It's possible since right now we don't really have other \"topic settings\" to edit other than its stream/name, and I'm not sure we will add any, but \"edit topic\" is probably the label we'd give if this modal grew a few other administrative settings for a topic. I think I presently prefer the move naming given that's the thing you can do.</p>",
        "id": 1446385,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1665180868
    },
    {
        "content": "<p>/poll What should we call the three-dot topic menu \"Move topic\" option?<br>\nMove topic (current)<br>\nEdit topic<br>\nMove or edit topic<br>\nMove or rename topic<br>\nMove messages</p>",
        "id": 1446389,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1665180953
    },
    {
        "content": "<p>(please post reasoning, too :))</p>",
        "id": 1446390,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1665180967
    },
    {
        "content": "<p>I'm currently voting for \"Move or edit topic\", because I think it's helpful to hint at both the \"<strong>move</strong> to a different stream\" action and \"<strong>edit</strong> topic name\" action. \"Edit topic\" is what we have on the tooltip for the pencil button in the message header bar.</p>",
        "id": 1446392,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1665181060
    },
    {
        "content": "<p>(But I'm happy to have my mind changed on this one. ;))</p>",
        "id": 1446393,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1665181080
    },
    {
        "content": "<p>My reasoning, \"Editing\" a topic from my perspective means to move it or rename it, might as well expand it. Else \"Move topic\" also sounds just fine, as I would most probably edit the topic name from the topic header in the main section.</p>",
        "id": 1446418,
        "sender_full_name": "Sayam Samal",
        "timestamp": 1665182772
    },
    {
        "content": "<p>The other string to compare with is \"Move message\" in the message <code>\\vdots</code> menu, which is another common way to access this functionality.</p>",
        "id": 1446432,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1665183465
    }
]