[
    {
        "content": "<p>I noticed that in the topic menu in the left sidebar, we show the \"Mark all messages as read\" option even when the topic has no unreads. Should we hide it then, like we do with the \"Unstar all messages in topic\" option when the topic has no starred messages?</p>\n<p>As a sort of related point, we could consider adding a \"Mark all messages as unread\" option to that menu. We could show both options when some messages are read and some unread, and only one when all are read or all are unread.</p>",
        "id": 1544511,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1681157417
    },
    {
        "content": "<p>I don't like showing both options at the same time for two reasons:</p>\n<ul>\n<li>The data model doesn't know if there are any read messages; just whether there are any unread messages. So we don't have a way to know whether the \"mark all as unread\" option would be vacuous because the entire topic is already unread.</li>\n<li>It feels like clutter. If you want everything unread, you can mark all as read and then mark all as unread, but that's probably not going to be a common desire if there's already something unread and you're looking at the topic in the main message pane already.</li>\n</ul>",
        "id": 1544801,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1681174645
    },
    {
        "content": "<p>Hm, so we could potentially add a \"Mark all as unread\" option just when there are no unreads? Or perhaps it's not worth doing at all?</p>",
        "id": 1545094,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1681209509
    },
    {
        "content": "<p>This seems like a good option to add. Having a <code>Mark all messages as read</code> button in case of unread messages, and a <code>Mark all messages as unread</code> button in case there are no unread messages, can enhance the flexibility of the topic menu and make it more robust.</p>",
        "id": 1545097,
        "sender_full_name": "Palash Baderia",
        "timestamp": 1681209722
    },
    {
        "content": "<p>Mark all as unread seems valid on its own, though another option would be to add a \"...from &lt;date/all&gt;\" element to that?</p>\n<p>That would also cover the case of accidentally marking read, or wanting to mark all read except from when returning from holiday or extended absence, or similar?</p>",
        "id": 1545506,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1681239336
    },
    {
        "content": "<p>Our current mechanism for the \"from date\" option is to do that via the message menu, which seems good enough?</p>",
        "id": 1545551,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1681242090
    },
    {
        "content": "<p>I filed <strong>Add \"Mark as unread\" option to three-dot topic menu</strong> <a href=\"https://github.com/zulip/zulip/pull/25085\">#25085</a> based on the discussion so far.</p>",
        "id": 1545557,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1681242326
    },
    {
        "content": "<p>Re the general principle, I agree for a topic the message menu may be sufficient. The 'topic' aspect was briefly lost in my reading and I was thinking of the all-messages menu - in which case viewing all-messages and marking unread from a given date sounds problematic, though with the go-to-date option there may be a workaround.</p>\n<p>That said, what about other similar menus? Streams? DMs don't appear to have any menu?</p>",
        "id": 1545668,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1681246260
    },
    {
        "content": "<p>Hm, \"Mark all messages as unread\" doesn't seem super likely to be useful for a stream or All messages. Maybe not for a even for a DM thread.</p>",
        "id": 1545724,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1681249612
    },
    {
        "content": "<p>I could see it if it's a real recently created stream, but yeah, not often</p>",
        "id": 1545742,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1681250719
    },
    {
        "content": "<p>Yeah I think a version for stream could be useful but it probably needs a confirmation dialog to make sure you really want to do that since it does destroy information (what you've already read); we can come back to thinking about that after doing the topics menu version, which seems much more natural.</p>",
        "id": 1546536,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1681344713
    },
    {
        "content": "<p>I was coming at this from the issue with <code>U</code> marking too many messages unread for me recently, balanced against the use case Alya had for marking unread back from a certain point in time.<br>\n(<a class=\"stream-topic\" data-stream-id=\"9\" href=\"/#narrow/stream/9-issues/topic/Marking.20unread.20in.20interleaved.20narrows\">#issues &gt; Marking unread in interleaved narrows</a>)</p>",
        "id": 1546600,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1681347694
    }
]