[
    {
        "content": "<p>When I was looking for a topic using the \"participated\" filter on Recent Topics, I didn't find it because I participated in it a while ago. Having only recent participants in the \"Participants\" column seems alright, but I think users would expect that the filter would cover the full history of the topic.</p>",
        "id": 1242428,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1627943267
    },
    {
        "content": "<p>I too sometimes get frustrated by that. should the filter essentially give you a history of every topic you've been in?</p>",
        "id": 1242430,
        "sender_full_name": "Ken Clary",
        "timestamp": 1627943898
    },
    {
        "content": "<p>I think this is another symptom of the fact that Recent Topics is driven by the message history the client has loaded. If you're caught up (so that you have no unread, unmuted messages that aren't quite recent), then the client will typically have only a small amount of history loaded (like 1200 messages), so Recent Topics won't have any data older than that.</p>\n<p>Previous discussion in this thread, with some other symptoms:<br>\n<a href=\"#narrow/stream/9-issues/topic/.22my.20topics.22.20.3F/near/1230111\">https://chat.zulip.org/#narrow/stream/9-issues/topic/.22my.20topics.22.20.3F/near/1230111</a></p>",
        "id": 1244018,
        "sender_full_name": "Greg Price",
        "timestamp": 1628125003
    },
    {
        "content": "<p>A mitigation we should probably do is to have the client load a lot more than 1200 messages even if you're caught up, at least in a high-traffic context like this org.</p>\n<p>That way the Recent Topics experience of people who are caught up on all their messages would be a lot more like the experience of people who have any old unmuted unreads. For example I typically have at least a few of those that are months old, and one result is that I basically never see the kinds of odd Recent Topics symptoms discussed here and in that previous thread.</p>",
        "id": 1244019,
        "sender_full_name": "Greg Price",
        "timestamp": 1628125195
    },
    {
        "content": "<p>That wouldn't totally accomplish this:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"19444\">Ken Clary</span> <a href=\"#narrow/stream/101-design/topic/.22participated.22.20filter.20on.20Recent.20Topics/near/1242430\">said</a>:</p>\n<blockquote>\n<p>I too sometimes get frustrated by that. should the filter essentially give you a history of every topic you've been in?</p>\n</blockquote>\n<p>though it would get a lot closer -- like giving you a history of every such topic from the last 6 months, say.</p>\n<p>I agree that showing truly every such topic would be the ideal behavior. Doing something really like that would probably require some thinking about the infrastructure for it, and probably some server support.</p>",
        "id": 1244020,
        "sender_full_name": "Greg Price",
        "timestamp": 1628125322
    },
    {
        "content": "<blockquote>\n<p>I agree that showing truly every such topic would be the ideal behavior. Doing something really like that would probably require some thinking about the infrastructure for it, and probably some server support.</p>\n</blockquote>\n<p>I would also guess that such a feature would make more sense as separate from \"recent topics\"</p>",
        "id": 1246213,
        "sender_full_name": "Ken Clary",
        "timestamp": 1628689910
    }
]