[
    {
        "content": "<p>Creating this thread for discussing about the issue mentioned <a href=\"https://github.com/zulip/zulip/issues/23921\">here</a>. <br>\nMost of the time the user only needs to know the shortcut for a single thing so a search functionality would be a great help. Especially because it is already divided into 3 panes.<br>\nShould there be a search bar within the shortcut window or popup toggled by a hotkey (like it does already with ctrl+k)?</p>",
        "id": 1484508,
        "sender_full_name": "Om Srivastava❄",
        "timestamp": 1672773581
    },
    {
        "content": "<p>Simple substring filter would be nice there</p>",
        "id": 1484672,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1672779824
    },
    {
        "content": "<p>In general I’m rooting for having general search be able to search throught any zulip action. But it is challenging to balance search input and jump/toggle functionality</p>",
        "id": 1484675,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1672779912
    },
    {
        "content": "<p>It seems simples to have a search box always open inside the menu, perhaps a small one on the right like we do in org settings. We could put the cursor there by default.</p>\n<p><a href=\"/user_uploads/2/c9/kU5fxa5ZUpU4qgRiRxw6Ss5U/Screen-Shot-2023-01-03-at-3.26.38-PM.png\">Screen-Shot-2023-01-03-at-3.26.38-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/c9/kU5fxa5ZUpU4qgRiRxw6Ss5U/Screen-Shot-2023-01-03-at-3.26.38-PM.png\" title=\"Screen-Shot-2023-01-03-at-3.26.38-PM.png\"><img src=\"/user_uploads/2/c9/kU5fxa5ZUpU4qgRiRxw6Ss5U/Screen-Shot-2023-01-03-at-3.26.38-PM.png\"></a></div>",
        "id": 1484806,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1672788453
    },
    {
        "content": "<p>A search is good, and an extension perhaps could include results from the help center, particularly if there are no/few results.</p>",
        "id": 1484812,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1672789666
    },
    {
        "content": "<p>One interacting aspect - or alternative - to searching the keyboard shortcuts would be to improve access to the sections generally, so visually searching down the scrolling area is less necessary. This was an idea for ZT, having the sections in something like different tabs, and where appropriate auto-focusing to one tab given a particular context - eg. in the web app the stream settings popup has a dedicated section.</p>\n<p>That does connect with another conversation recently: how to name the <code>?</code> popup, since something like multiple tabs could suggest explicitly separating it?</p>",
        "id": 1484813,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1672789804
    },
    {
        "content": "<p>By the way, how should we handle the searching? From the first glance, the whole table seems to be hardcoded in<code> keyboard_shortcuts.hbs</code>. Should it be made dynamic before implementing the search?</p>",
        "id": 1485631,
        "sender_full_name": "Om Srivastava❄",
        "timestamp": 1672903852
    }
]