[
    {
        "content": "<p>Hello designers at Zulip,</p>\n<p>I am Chetan Manda, a final year undergraduate student from IIT Guwahati, India.<br>\nI came across Zulip on the Gsoc website and I went through your open source work and found it really interesting. <br>\nI am a designer and I specialize in User Interface and User Experience design(UI/UX).<br>\nI have interned at various companies during the last four years and have executed end to end projects while interacting with key stakeholders, product managers, and developers.Here's a list of things that I do:<br>\n• Conduct User Research, develop low - high-fidelity wireframes, storyboards, user flows, screen flows, sitemaps, UI artefacts, prototyping, and Usability testing.<br>\n• Create exceptional user experiences for end-users and design internal/external user-facing products ensuring they are useful and usable by end-users.  <br>\n• Translate the concepts and agreed ideas into artwork and designs that bring simplicity and user-friendliness to complex design roadblocks.   <br>\n• Basic CSS, HTML<br>\nHere are a few of my works : <a href=\"https://www.behance.net/ChetanManda\" target=\"_blank\" title=\"https://www.behance.net/ChetanManda\">https://www.behance.net/ChetanManda</a></p>\n<p>I would love to work for your organization on any projects/tickets that I could help out on based on my abilities. I can put in 35-40 hours per work with proper dedication throughout the Summer and I am capable of learning new languages at a pretty fast pace. I would be really grateful if you could recommend any relevant project &amp; mentor for me. Thanks in advance!</p>\n<p>Cheers,<br>\nChetan<br>\nPFA my resume<br>\n<a href=\"/user_uploads/2/e2/xQjkoE7744iAYOvnZD_edcN9/Resume.pdf\" target=\"_blank\" title=\"Resume.pdf\">Resume.pdf</a></p>",
        "id": 831672,
        "sender_full_name": "Chetan Manda",
        "timestamp": 1584224370
    },
    {
        "content": "<p>Welcome to Zulip! I'd really interesting to hear what kind of insights you have for us with reference to Zulip's design.<br>\nI think the best direction of action would be to just start conversations (topics in <a class=\"stream\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design\">#design</a> ) about where you think we could have changes/improvements... We also have some existing frontend issues that could use help with code, if you're interested in that.</p>",
        "id": 831693,
        "sender_full_name": "Yash RE",
        "timestamp": 1584248524
    },
    {
        "content": "<p>*it'd be</p>",
        "id": 832154,
        "sender_full_name": "Yash RE",
        "timestamp": 1584387504
    }
]