[
    {
        "content": "<p>My friend Teresa just started using Zulip today. She self-registered, and when she saw \"You look familiar\" she assumed that meant she already had an account -- and then when she used \"Forgot password\" and it did not explicitly say anything about whether she had a pre-existing account or not, she didn't notice that. I had to help her out and say \"try creating a new account\" - otherwise she would have waited a long time.</p>\n<p>But overall she likes the UI.</p>",
        "id": 183237,
        "sender_full_name": "Sumana Harihareswara",
        "timestamp": 1491075227
    },
    {
        "content": "<p>Yeah I just checked it with a random email and it didn't say anything about having not having pre-existing account. So the \"Forgot password\" page must throw an error if the email submitted doesn't have an account already!</p>",
        "id": 183257,
        "sender_full_name": "Sriram",
        "timestamp": 1491076305
    },
    {
        "content": "<p>It doesn't give you an error because (I assume this is the reason) we want to protect people's privacy. If I put in the address of someone I'm stalking, I shouldn't be able to find out whether or not they have an account.</p>",
        "id": 183258,
        "sender_full_name": "Sumana Harihareswara",
        "timestamp": 1491076392
    },
    {
        "content": "<p>I agree on that. But it may also leave people in a clueless state right?</p>",
        "id": 183262,
        "sender_full_name": "Sriram",
        "timestamp": 1491076534
    },
    {
        "content": "<p>Yeah, so I think it might be a good idea to be more explicit and less humorous about what we're doing.</p>",
        "id": 183264,
        "sender_full_name": "Sumana Harihareswara",
        "timestamp": 1491076595
    },
    {
        "content": "<p>But I figured I'd hear from one or two other people in this stream before filing a bug....</p>",
        "id": 183265,
        "sender_full_name": "Sumana Harihareswara",
        "timestamp": 1491076645
    },
    {
        "content": "<p>Thanks for the report Teresa and Sumana! I agree we should change it; opening an issue sounds good to me.</p>",
        "id": 183293,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1491078074
    },
    {
        "content": "<p>Thanks, Rishi! \"Make login/forgot password pages more explicit to help new users\" <a href=\"https://github.com/zulip/zulip/pull/4381\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/4381\">#4381</a></p>",
        "id": 183299,
        "sender_full_name": "Sumana Harihareswara",
        "timestamp": 1491080675
    },
    {
        "content": "<p>Any GSoC applicants around - this would be a reasonable bug to consider fixing.</p>",
        "id": 183300,
        "sender_full_name": "Sumana Harihareswara",
        "timestamp": 1491080765
    }
]