[
    {
        "content": "<p>with time user will forget which topics the user has muted, and if due to some reason the user needs to see some muted topics, it's a long process of going to settings and viewing muted topics there, which I think user will forget.<br>\ncurrently there's only one place i.e user settings where one can view all of their muted topics,<br>\nbut I don't think a new user of <strong>Zulip</strong> will know this. Even I didn't knew where to see all my muted topics till I opened settings for changing my profile pic.</p>\n<p>We can increase the accessibility of muted topics by adding a button below or above <strong>+ Add streams</strong> saying <strong>Muted topics</strong> which may either open the muted topics tab in settings or list all muted topics in the central area (message area) whichever is feasible.<br>\nWhat say?</p>",
        "id": 1030973,
        "sender_full_name": "RDT",
        "timestamp": 1601805920
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"17415\">@RISHABH D TIWARI</span> u can see your muted topics in recent topics by checking include muted.</p>",
        "id": 1031005,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1601811479
    },
    {
        "content": "<p>I do agree that it would be nicer to have a more discoverable way to manage your muted topics.  OTOH I am a bit reluctant to take up too much main-screen real estate for muted topics.  In my experience I have almost never regretted forgetting about a muted topic, because if somebody really needs my attention, they can still get it.</p>",
        "id": 1031006,
        "sender_full_name": "Steve Howell",
        "timestamp": 1601811577
    },
    {
        "content": "<p>If we had to add it anywhere on the main screen, though, I think putting a handy link at the bottom of your stream list, as <span class=\"user-mention\" data-user-id=\"17415\">@RISHABH D TIWARI</span> suggests, would be as good a place as any.</p>",
        "id": 1031007,
        "sender_full_name": "Steve Howell",
        "timestamp": 1601811645
    },
    {
        "content": "<p>I agree with your point <span class=\"user-mention\" data-user-id=\"5140\">@Aman Agrawal</span> , but in recent topics there are unmuted topics too, which gives a clustered look.<br>\nA nice place to manage muted topics will be better.</p>",
        "id": 1031021,
        "sender_full_name": "RDT",
        "timestamp": 1601814180
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 1031022,
        "sender_full_name": "RDT",
        "timestamp": 1601814417
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell</span> <a href=\"#narrow/stream/101-design/topic/accessing.20muted.20topics/near/1031006\">said</a>:</p>\n<blockquote>\n<p>I do agree that it would be nicer to have a more discoverable way to manage your muted topics.  OTOH I am a bit reluctant to take up too much main-screen real estate for muted topics.  In my experience I have almost never regretted forgetting about a muted topic, because if somebody really needs my attention, they can still get it.</p>\n</blockquote>\n<p>I agree <span class=\"user-mention\" data-user-id=\"58\">@Steve Howell</span>  that generally we wouldn't regret forgetting about muted topic, but this will be when we mute topic intentionally.<br>\nBut if one mutes the topic by mistake, it would be better to give the user a place to manage it easily.<br>\nThis idea itself clicked me when to test muting of topics, I muted some topics in <a class=\"stream\" data-stream-id=\"1\" href=\"/#narrow/stream/1-announce\">#announce</a>  and some other streams but then couldn't find where to unmute them</p>",
        "id": 1031025,
        "sender_full_name": "RDT",
        "timestamp": 1601814808
    },
    {
        "content": "<p>should I create an issue and start working on this? Please confirm.</p>",
        "id": 1031357,
        "sender_full_name": "RDT",
        "timestamp": 1601881782
    }
]