[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"58\">@Steve Howell</span> how about floating or sticky buttons.</p>",
        "id": 835329,
        "sender_full_name": "Vaibhav Raj Singh",
        "timestamp": 1584747556
    },
    {
        "content": "<p>Ah. I should've given the background. The issue is <a href=\"https://github.com/zulip/zulip/pull/14274\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/14274\">#14274</a>. In the organization permissions section, some of the option are way down, due to which the save setting button isn't visible. A probable solution might be making the button sticky, so that it's always visible. Even while scrolling.</p>",
        "id": 835469,
        "sender_full_name": "Vaibhav Raj Singh",
        "timestamp": 1584798488
    },
    {
        "content": "<p>We probably just need <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> to weigh in on this when we're less busy.  There are many possible approaches here:</p>\n<ul>\n<li>smaller subsections with their own save button</li>\n<li>floating save buttons</li>\n<li>don't require save...just do action as soon as you choose new option in dropdown (which moves the problem to making sure we don't put the your-change-has-taken-effect messaging above the fold)</li>\n<li>put save button below widgets (having it above, like now, feels strange to me)</li>\n</ul>",
        "id": 835472,
        "sender_full_name": "Steve Howell",
        "timestamp": 1584799113
    },
    {
        "content": "<p>To be clear, I think it's still worth discussing options here, but I'm not going to make the decision here.</p>",
        "id": 835473,
        "sender_full_name": "Steve Howell",
        "timestamp": 1584799161
    },
    {
        "content": "<p>I think we do want to require save in \"organization settings\"; they're sufficiently sensitive settings that we want it to be hard to accidentally change them.  I think probably doing additional subsections might make the most sense.</p>",
        "id": 836045,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1584900429
    },
    {
        "content": "<p>Is there a reason we don't have the Save button below all these options?  Having to scroll up for a Save button feels counterintuitive.</p>",
        "id": 836119,
        "sender_full_name": "Steve Howell",
        "timestamp": 1584903123
    },
    {
        "content": "<p>Well, the design structure before we recently added like 5 new things to that bottom section was that the buttons would live on the subsection titles.  It works quite well in the other parts of the \"organization settings\" area.</p>",
        "id": 836126,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1584903324
    },
    {
        "content": "<p>The design intent was that you should never have so much distance from the \"Save\" button for this type of problem to come up.</p>",
        "id": 836127,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1584903344
    },
    {
        "content": "<p>We just need to split \"Other permissions\".  I can write out a proposed split in the issue.</p>",
        "id": 836132,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1584903410
    },
    {
        "content": "<p>yeah the same I was thinking about, the split can get the job done</p>",
        "id": 836138,
        "sender_full_name": "Siddharth",
        "timestamp": 1584903600
    },
    {
        "content": "<p>OK just posted a reordering I feel good about.</p>",
        "id": 836139,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1584903674
    },
    {
        "content": "<p>should I go ahead and make those proposed changes?</p>",
        "id": 836143,
        "sender_full_name": "Siddharth",
        "timestamp": 1584903793
    },
    {
        "content": "<p>Sure!  Be sure to test carefully with reloading to make sure settings changes are actually saved properly for each and every moved element.</p>",
        "id": 836157,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1584904496
    }
]