[
    {
        "content": "<p>Actually now thinking about it I am unsure if calling it \"subscribe\" even makes sense. Subscribing implies that you want to be kept up to date, but our model lets you mute a subscribed stream ... which doesn't make much sense ... because then you aren't really keeping up to date anymore so the subscribe metaphor breaks down. I think we might want to change the terminology from subscribe and unsubscribe to join and quit.</p>",
        "id": 930913,
        "sender_full_name": "Gittenburg",
        "timestamp": 1594409099
    },
    {
        "content": "<p>I don't see any benefit to join/quit over subscribe/unsubscribe; one could make the same argument about join/quit.</p>",
        "id": 930917,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594409248
    },
    {
        "content": "<p>Well for a start it would be consistent with Slack, Mattermost, RocketChat and IRC.</p>",
        "id": 930918,
        "sender_full_name": "Gittenburg",
        "timestamp": 1594409347
    },
    {
        "content": "<p>I think some of those use \"Join\"; I don't think \"quit\" is used by all of those.</p>",
        "id": 930924,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594409984
    },
    {
        "content": "<p>I think they all use \"join\". Some use \"leave\" instead of \"quit\".</p>",
        "id": 930927,
        "sender_full_name": "Gittenburg",
        "timestamp": 1594410024
    },
    {
        "content": "<p>Yeah, I think \"leave\" is more common.</p>",
        "id": 930930,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594410072
    },
    {
        "content": "<p>I opened the issue <a href=\"https://github.com/zulip/zulip/pull/15753\">#15753</a> for aligning our terminology with the mainstream chat apps.</p>",
        "id": 930938,
        "sender_full_name": "Gittenburg",
        "timestamp": 1594410337
    },
    {
        "content": "<p>I am swayed by <span class=\"user-mention\" data-user-id=\"16219\">@Gittenburg</span> here--if Slack, Mattermost, and RocketChat all say join/leave, I'm inclined to just go with the flow here.  And it always kills me to have to say \"stream\"--I wish we had just gone with channel.</p>",
        "id": 930943,
        "sender_full_name": "Steve Howell",
        "timestamp": 1594410565
    },
    {
        "content": "<p>Well, we picked \"stream\" at a time when IRC was the only thing using \"channel\", and most other products (e.g. everything based on XMPP) used terms like \"room\" or \"conference\".</p>",
        "id": 930947,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594410685
    },
    {
        "content": "<p>And unfortunately renaming s/stream/channel/ in things like URLs, the API, etc., is likely to be a huge project.  We could potentially change in the the copy and then defer the <code>stream =&gt; channel</code> name work in the codebase, but we'd certainly be signing up to do it.</p>\n<div class=\"codehilite\"><pre><span></span><code>(zulip-py3-venv) tabbott@coset:~/zulip$ git grep -i stream | grep -v locale | wc\n  18103   93986 1691980\n</code></pre></div>",
        "id": 930952,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594410870
    },
    {
        "content": "<p>naive question: couldn't we for the API just do an HTTP redirect from <code>/stream/(.+)</code> to <code>/channel/$1</code>? wouldn't this guarantee backwards compatibility?</p>",
        "id": 930958,
        "sender_full_name": "Gittenburg",
        "timestamp": 1594410986
    },
    {
        "content": "<p>I want to be 100% clear that I don't want to rename streams to channels.  It was just a I-wish-we-had-a-time-machine kinda comment.  (And I think the decision made sense at the time we made it, when Slack wasn't even really a thing yet.)</p>",
        "id": 930965,
        "sender_full_name": "Steve Howell",
        "timestamp": 1594411187
    },
    {
        "content": "<p>It's more complicated than that, because things get referenced in parameters and objects we return, and the mobile apps need to work with old and new servers.</p>",
        "id": 930966,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594411245
    },
    {
        "content": "<p>But yes, some of the dozens of places will be easy things like that; others we'd need to send both values for a transitional period, etc.</p>",
        "id": 930967,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594411278
    },
    {
        "content": "<p>We still haven't completely renamed subject to topic.</p>",
        "id": 930968,
        "sender_full_name": "Steve Howell",
        "timestamp": 1594411289
    },
    {
        "content": "<p>That one's basically done, but yeah there's still a few relics of the decision to s/subject/topic/ back in 2013 in backwards-compatible API interfaces.</p>",
        "id": 930971,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594411346
    },
    {
        "content": "<p>how about only changing it in the UI?</p>",
        "id": 930972,
        "sender_full_name": "Gittenburg",
        "timestamp": 1594411362
    },
    {
        "content": "<p>As I said, that's certainly an option -- but we are signing up to do the API rename work eventually if we do that (otherwise, people using our API will constantly be asking \"why aren't channels called channels?\")</p>",
        "id": 930973,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594411406
    },
    {
        "content": "<p>So, we should only do that change if we're very confident we think it's worth a big long-term investment, even if we get the terminology benefit for most users sooner.</p>",
        "id": 930974,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594411428
    },
    {
        "content": "<p>I think it's better having developers ask that question than users (because there are more of the latter).</p>",
        "id": 930975,
        "sender_full_name": "Gittenburg",
        "timestamp": 1594411442
    },
    {
        "content": "<p>I'm largely of the perspective that \"stream\" =&gt; \"channel\" will be worth doing, but I also don't have time to focus on this conversation today and I think there's a range of perspectives on the topic.</p>",
        "id": 930977,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594411497
    },
    {
        "content": "<p>Mine is to some extent that our streams aren't actually a different concept, and future users greatly outnumber ones, so we will want to go through a lot of pain to end up in a place where our terminology aligns with what seems to have become a standard in the space.  </p>\n<p>Certainly I've found it annoying when talking at conference booths or with the press or whoever that's familiar with Slack/IRC/Discord (aka almost everyone in our target audience) that I need to either say \"channel\" or say something like \"A zulip stream is like a channel\" so they know what I'm talking about.</p>\n<p>Also of note is that our translators largely translate \"stream\" to the same thing \"channel\" translates to in other tools.</p>",
        "id": 930978,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594411708
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16219\">@Gittenburg</span> I think it's too late to get that terminology changed for 3.0.  I hope we can think about it for the next release.  cc <span class=\"user-mention\" data-user-id=\"15517\">@Trent Lapinski</span>, since this mostly a marketing thing.  I estimate that streams to channels has approximately this scope:</p>\n<ul>\n<li>hours - fix most glaring cosmetic things in the UI</li>\n<li>days - sweep most of the doc stuff</li>\n<li>weeks - figure out how to deprecate streams in the API</li>\n<li>months - convert most of codebase to use channels</li>\n<li>years - finally kill off all deprecated references to streams</li>\n</ul>\n<p>I feel pretty confident about these estimates, having gone through the subject -&gt; topic migration.  Did changing \"subject\" to \"topic\" actually help us over the years?  I have no idea.</p>",
        "id": 930985,
        "sender_full_name": "Steve Howell",
        "timestamp": 1594412227
    },
    {
        "content": "<p>(In my estimates I am purposely vague about whether I'm talking about person-hours of effort vs. calendar time, because sometimes it's not clear which one matters more.)</p>",
        "id": 930987,
        "sender_full_name": "Steve Howell",
        "timestamp": 1594412366
    },
    {
        "content": "<p>Definitely too late from the translator standpoint.</p>",
        "id": 930989,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594412396
    },
    {
        "content": "<p>I do think the potential benefit here is bigger than the subject/topic change (which I recall being opposed to making at the time).</p>",
        "id": 930990,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594412487
    },
    {
        "content": "<p>I wonder how much the \"channel\" terminology was influenced (if only subconsciously) by how people used to watch television?  i.e. \"Turn the channel\".  And of course now we \"stream\" stuff that used to be on ordinary TV.</p>",
        "id": 930998,
        "sender_full_name": "Steve Howell",
        "timestamp": 1594412984
    },
    {
        "content": "<p>We can defer this to 3.1 potentially or later, but the pro of switching is every other team chat app uses Channels instead of \"Streams\" and in the broader tech industry \"Stream\" is most associated with the \"News Stream\" feature of Facebook, which Zulip definitely isn't anything like Facebook (thank goodness).</p>\n<p>It is also a learning curve thing. It will be a lot easier for Slack \"switchers\" to come to Zulip and even migrate without having to learn new terminology for something that is essentially the same thing.</p>\n<p>Had Streams been branded and marketed effectively it definitely had potential, but too much time has passed and Channels is definitely the default in basically every chat app. There's not a lot of use in fighting it now. It would likely help soften the learning curve for switchers.</p>\n<p>On the flip-side, our channels are NOT channels like channels exist in Slack and other chat apps, so there is an argument to be made for keeping Streams as the name. If we do not switch, we need to double down on marketing efforts to explain what a stream is and need to put some serious time and effort into defining, branding, and explaining the concept that doesn't exist currently. Switching to channels eliminates most of the need to do this on the marketing side.</p>",
        "id": 931002,
        "sender_full_name": "Trent Lapinski",
        "timestamp": 1594413203
    },
    {
        "content": "<p>I think Streams in Zulip do match the concept of a Channel in other chat apps -- fundamentally they're the basic unit of subscriptions / what determines who are the recipients for a message.  Topics are the thing that's unique and different -- a subdivision within that analogous construct.</p>",
        "id": 931007,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1594413353
    },
    {
        "content": "<p>This topic was moved by <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> to <a class=\"stream-topic\" data-stream-id=\"97\" href=\"/#narrow/stream/97-off-topic/topic/channeling\">#off topic &gt; channeling</a></p>",
        "id": 931052,
        "sender_full_name": "Notification Bot",
        "timestamp": 1594414643
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"15517\">Trent Lapinski</span> <a href=\"#narrow/stream/101-design/topic/align.20our.20terminology/near/931002\">said</a>:</p>\n<blockquote>\n<p>in the broader tech industry \"Stream\" is most associated with the \"News Stream\" feature of Facebook, which Zulip definitely isn't anything like Facebook (thank goodness).</p>\n</blockquote>\n<p>This is a side point relative to the main discussion, but FWIW I don't think I've ever heard \"News Stream\" as the name of a Facebook thing before.</p>\n<p>The \"News Feed\" is what Facebook calls the thing you get when you open up Facebook (and that's also what I generally hear people in the industry talking about Facebook call it.)</p>\n<p>Googling [facebook stream] finds results about streaming video on Facebook.</p>",
        "id": 935666,
        "sender_full_name": "Greg Price",
        "timestamp": 1594764583
    },
    {
        "content": "<p>FWIW, Flowdock has \"flows\" (and \"threads\"). Which we localised to like we danes do, and you could hear \"skriv det i flowet\" around the office. Channel has the danish translation \"kanal\", so that's pretty used at large. I haven't heard anyone talking about \"skriv det i strømmen\" yet, but I'm just waiting for it...</p>",
        "id": 972664,
        "sender_full_name": "Thomas Fini Hansen",
        "timestamp": 1596576661
    }
]