[
    {
        "content": "<p>This was brought up in <a class=\"stream\" data-stream-id=\"9\" href=\"/#narrow/stream/issues\">#issues</a>, but reposting here. <br>\nWhat would folks think of renaming \"Home\" to \"All messages\"? That would be less confusing to beginners, and set expectations a bit better. </p>\n<p>One downside is that it's not quite all messages, in that it doesn't include muted streams and topics. So we would have to make sure that isn't confusing.</p>",
        "id": 256622,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1500945270
    },
    {
        "content": "<p>It's not all messages, but \"Home\" doesn't really encapsulate that it doesn't include muted streams or topics either.</p>",
        "id": 256623,
        "sender_full_name": "Joshua Pan",
        "timestamp": 1500945383
    },
    {
        "content": "<p>I think \"All messages\" is better (and probably more accurate than something like \"overview\").  I don't think the fact that streams/topics that got muted don't show up is likely to be confusing--when you mute a stream or topic you're asking not to see those messages any more and don't really expect to see them in \"all the messages you've received\" anyway.</p>",
        "id": 256624,
        "sender_full_name": "James Rowan",
        "timestamp": 1500945427
    },
    {
        "content": "<p>There's a search term called <code>is:all</code> that truly brings in \"all\" messages (which is in quotes because it's only another sort-of-false definition of \"all\" that doesn't include messages you can't see but that were sent in the realm), but we've already started to deprecate that, I believe, in search suggestions.  So I agree with everybody here.  I agree with Rishi on the basic proposal, I agree with Joshua that \"Home\" is already an imperfect name, and I agree with James that the likelihood of confusion is small.   I also like \"overview\" as a possible alternative name, since I think that gets to the heart of why some people like the view.</p>",
        "id": 256625,
        "sender_full_name": "Steve Howell",
        "timestamp": 1500945664
    },
    {
        "content": "<p>My one worry with \"overview\" is that people would expect it to do some sort of summarizing/only showing you the \"important stuff\" when really it's everything that got sent.  It feels a bit information dense for an \"overview\" in the usual sense of the word--the thing I like about it/feel is missing from Slack is that it's a \"global view\" moreso than an \"overview\"</p>",
        "id": 256627,
        "sender_full_name": "James Rowan",
        "timestamp": 1500945890
    },
    {
        "content": "<p>I call it the \"interleaved view.\"  But I don't propose that as the user-facing name, necessarily.  You're right--it's not an overview.  (We actually could use a nice \"overview\" type of view that is a little more than the left sidebar provides but not as busy as the home view).   The benefit of the interleaved view, as I perceive it, is that it's totally real time.  You don't have anything happen asynchronously, but it's still somewhat organized.</p>",
        "id": 256630,
        "sender_full_name": "Steve Howell",
        "timestamp": 1500946139
    },
    {
        "content": "<p>\"All messages\" seems worth trying out, I think.</p>",
        "id": 256725,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1500960746
    },
    {
        "content": "<p>I am in favor of the email concept 'Inbox'</p>",
        "id": 257091,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1501013940
    },
    {
        "content": "<p>At least for the 'all unread', but maybe for all</p>",
        "id": 257092,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1501013960
    },
    {
        "content": "<p>And using an inbox icon like Inbox</p>",
        "id": 257093,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1501013986
    },
    {
        "content": "<p>Interesting.  I would prefer \"Inbox\" to \"Home,\" I think.  For me \"All messages\" is probably still my favorite suggestion for the web app.</p>",
        "id": 257094,
        "sender_full_name": "Steve Howell",
        "timestamp": 1501014153
    },
    {
        "content": "<p>hm, inbox to me suggests something where you can archive/delete (i.e. have a fair amount of control over what's in there)</p>",
        "id": 257105,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1501015059
    },
    {
        "content": "<p>We don't have an \"all unreads\" in the webapp, at least, though I could see Inbox making sense there (though I think I'd still prefer \"All unreads\", at least in the webapp).</p>",
        "id": 257106,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1501015148
    },
    {
        "content": "<p>Once it is proven in the mobile app, the 'unread' screen can be introduced in the web app tough.</p>",
        "id": 257107,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1501015206
    },
    {
        "content": "<p>I also  associate email inboxes as being \"all the unsorted stuff,\" i.e. stuff you haven't either manually dealt with or had rules/triggers automatically move to folders. Whereas our interleaved view is mostly sorted.</p>",
        "id": 257108,
        "sender_full_name": "Steve Howell",
        "timestamp": 1501015214
    },
    {
        "content": "<p>Another option I was considering is 'Inbox' being the name, but 'Unread/All' be the two view options</p>",
        "id": 257109,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1501015231
    },
    {
        "content": "<p>(using the term \"sorted\" loosely, like organized)</p>",
        "id": 257110,
        "sender_full_name": "Steve Howell",
        "timestamp": 1501015233
    },
    {
        "content": "<p>I would have a pretty negative reaction when trying out a new app if it presented me with an \"inbox\". For me an \"inbox\" means a place where things accumulate that I need to go and take action on -- I don't generally want more of those.</p>",
        "id": 257119,
        "sender_full_name": "Greg Price",
        "timestamp": 1501015663
    },
    {
        "content": "<p>Yeah, I think \"Inbox\" is probably the wrong word for something that's not email :).</p>",
        "id": 257123,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1501015878
    },
    {
        "content": "<p><a href=\"https://martinfowler.com/bliki/TwoHardThings.html\" target=\"_blank\" title=\"https://martinfowler.com/bliki/TwoHardThings.html\">https://martinfowler.com/bliki/TwoHardThings.html</a></p>",
        "id": 257147,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1501016418
    },
    {
        "content": "<p>haha, very relevant link <img alt=\":smile_cat:\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/unicode/1f638.png\" title=\":smile_cat:\"></p>",
        "id": 257154,
        "sender_full_name": "Steve Howell",
        "timestamp": 1501016782
    }
]