[
    {
        "content": "<p>Hi ! I'm testing zulip. I love the desktop application and the web app. But I don't understand why the android app is so different from them and from the others messenger app ?!?<br>\nThe design is cool, but ux is very strange .... <br>\nI can tell you more specifically what I mean by strange ux ^^ </p>\n<p>Thank's</p>",
        "id": 770241,
        "sender_full_name": "lascapi",
        "timestamp": 1563553872
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"12953\">@lascapi</span>, could you elaborate on what is strange about the UX?</p>",
        "id": 774000,
        "sender_full_name": "Cyphase",
        "timestamp": 1564367533
    },
    {
        "content": "<p>Yes, sure ! (I'm going to try to do that in english ^^ )</p>\n<p>First, I love the design fresh and clean :) </p>\n<p>But it's very different from web version. It's also very different from others application like RocketChat or Slack. Because people are want something simple to use it's not good to have something very different ! </p>\n<p>If I read all messages, the default screen is empty. Not very friendly. </p>\n<p>Unlike all the others applications I know, the organization is from right to left and from the bottom to top ! With the choice of account, or 'set a status' that are very accessible but it's not the main action on the app. </p>\n<p>There are to much things on the same level. Inbox/Streams I follow and All streams /Peoples and search/Settings/Account. </p>\n<p>It's difficult to find the messages to me for example! I don't the your response, it's because I received an email ..... an email to tell me I've a notification ( lol ) </p>\n<p>Bur the first issue is the organization of the screen. </p>\n<p>On the web app it's from left to right, it's clear and usual (Organization &gt; Streams and topics &gt; messages&gt;users)  . Why not with the Android app? </p>\n<p>Thank's for your question ;)</p>\n<p>(oh, I've two accounts for testing, so I'm <span class=\"user-mention\" data-user-id=\"12781\">@pascal</span> and <span class=\"user-mention\" data-user-id=\"12953\">@lascapi</span>  ;) )</p>",
        "id": 774096,
        "sender_full_name": "pascal",
        "timestamp": 1564416871
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 774267,
        "sender_full_name": "Vipul Sharma",
        "timestamp": 1564433529
    }
]