[
    {
        "content": "<p>Hey! We have a release goal of making it possible to control when/whether emoji are animated. The backend work is almost done (<a href=\"https://github.com/zulip/zulip/pull/20464\">#20464</a>), so I'm kicking off this thread to discuss exactly what the user setting for this should be. Here's a proposal:</p>\n<ol>\n<li>Have the setting control emoji in the message feed (message body, reactions, (soon) status emoji), but not in the sidebars.</li>\n<li>Setting: Personal settings &gt; Display settings &gt; Theme (bottom): \"Play animated emoji in messages\" -&gt; Always, On hover (default), Never. (As a reminder, org admins can control default display settings for their organization as well.)</li>\n<li>Animated emoji in sidebars (e.g. emoji statuses) always play on hover -- no setting.</li>\n</ol>\n<p>Note that having animated emoji on-screen taxes your CPU, so even aside from the distraction, it's a bad idea to have animated emoji playing continuously in a location like the right sidebar, which will be displayed all the time.</p>\n<p>Thoughts?</p>",
        "id": 1320326,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1643734157
    },
    {
        "content": "<p>The way the WIP PR to do this is currently structured, all animated status emoji would have the same behavior... So:</p>\n<ul>\n<li>status emoji next to the name in the pm list,</li>\n<li>status emoji next to the name in the message feed,</li>\n<li>status emoji next to the name in the buddy list,</li>\n<li>status emoji next to the name in the pm compose pill</li>\n</ul>\n<p>and any other place we add the status emoji, will behave the same.</p>\n<p>I could change that and have it so that different places behave differently, I just think that would be slightly more messy.<br>\nAlso, IMO, I think that if you've set \"play animated emoji\" as never, we might as well apply that rule everywhere, rather than having the right sidebar not follow that setting. (so I'm sorta opposed to this proposal.) I think its reasonable for us to just ignore \"always\" but obey \"never\".</p>",
        "id": 1321857,
        "sender_full_name": "Yash RE",
        "timestamp": 1643902691
    },
    {
        "content": "<p>I think it's important to have the message feed behavior separate from sidebar behavior so that we can offer an \"always on\" setting without causing problems for the user.</p>",
        "id": 1322053,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1643916857
    },
    {
        "content": "<p>The reason I proposed to ignore both the \"always\" and the \"never\" rule for the sidebars is that I think it makes it easier to correctly communicate what the setting does to users: \"Play animated emoji <strong>in messages</strong>\"</p>",
        "id": 1322054,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1643916915
    },
    {
        "content": "<p>The proposal above doesn't specifically address the PM compose pill -- since it's not part of the message feed, I would treat it the same as the sidebars (always on hover).</p>",
        "id": 1322056,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1643916961
    },
    {
        "content": "<p>In this proposal, we are not giving users control over emoji animation outside of the message feed, which seems fine. We could potentially add a setting  for emoji outside of the message feed later if we get feedback that it's important (probably just with \"on hover\" and \"never\" options).</p>",
        "id": 1322058,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1643917131
    },
    {
        "content": "<p>Okay. I'll realign the PR with this proposal.</p>",
        "id": 1322207,
        "sender_full_name": "Yash RE",
        "timestamp": 1643930257
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"9808\">@Yash RE</span> let me know when the PR is updated with this new proposed model.</p>",
        "id": 1322264,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643934462
    },
    {
        "content": "<p>Adding the handlers to the typeahead seems to be complicated... There's no real callback that can be used to bind the handlers once the elements have been inserted... of course, we could modify <code>./static/third/bootstrap-typeahead/typeahead.js</code> and create such a callback... but I'm not certain we want to.</p>",
        "id": 1323683,
        "sender_full_name": "Yash RE",
        "timestamp": 1644244825
    },
    {
        "content": "<p>So I'm not sure what I should do here. Currently we're just showing the still near the username in both the pm recipient typeahead and the @mention typeahead and it won't animate on hover.</p>",
        "id": 1323685,
        "sender_full_name": "Yash RE",
        "timestamp": 1644245045
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"9808\">@Yash RE</span> I think a fine option is to punt on the typeahead piece and just cover the other display places; it sounds kinda hard and can be a follow-up issue, since it's a relatively minor detail. I think the right way to punt is to just have them never animate in typeahead if a still image is available?.</p>",
        "id": 1323929,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1644262077
    },
    {
        "content": "<p>That sounds fine to me from a product perspective.</p>",
        "id": 1324166,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1644274644
    },
    {
        "content": "<p>This has gotten much further since last discussed but Alya mentioned that we should discuss whether we want in message gif emoji to animate when you move the mouse over the message that contains them or some smaller target (eg the emoji itself). One factor to consider would be that it would be more discoverable over the entire message but also easier to trigger unintentionally.</p>\n<p>I think the only two real options we could have here are the entire message or the individual emoji, there's no other target to bind to.<br>\nWe'd also have to make the same change for status emoji next to user's name and for reaction emoji.</p>\n<p>You could test how the handlers currently are by pulling <a href=\"https://github.com/zulip/zulip/pull/20464\">#20464</a>.</p>",
        "id": 1342275,
        "sender_full_name": "Yash RE",
        "timestamp": 1646930442
    },
    {
        "content": "<blockquote>\n<p>We'd also have to make the same change for status emoji next to user's name and for reaction emoji.</p>\n</blockquote>\n<p>Just to clarify, this refers to emoji next to the user's name in the message header bar (not the sidebars), right?</p>",
        "id": 1342311,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1646936161
    },
    {
        "content": "<p>yes, this is only related to the message feed and no where else.<br>\nAlso, I might be being misleading when I say \"we'd have to\". It should be possible to have those be as they are and only change the target for the in-message emoji.</p>",
        "id": 1342832,
        "sender_full_name": "Yash RE",
        "timestamp": 1646985168
    }
]