[
    {
        "content": "<p>Hi. Feedback from one of our users:</p>\n<blockquote>\n<p>I am new to using Zulip and I am overwhelmed by it. I'm wondering how to use this tool effectively. Before I asked a question, I wanted to check if there was a thread about it already, but I could not figure out how to search effectively</p>\n</blockquote>",
        "id": 597025,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528492467
    },
    {
        "content": "<p>some context: the <a href=\"http://fhir.org\" target=\"_blank\" title=\"http://fhir.org\">fhir.org</a> Zulip chat has slightly less volume than this chat (maybe 50%?), but is much more diverse in subject matter, representing our much broader scope. In particular we have a fall back channel that is all over the place.</p>",
        "id": 597026,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528492540
    },
    {
        "content": "<p>we have all sorts of wonderful content in there in the past, but it isn't easy to find, as the commenter says. if you know the right keywords... great.</p>",
        "id": 597028,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528492580
    },
    {
        "content": "<p>partly, this sort of needs us s a community to have a process to filter FAQs out of the topics and into some wiki somewhere, but finding people who want to do that is really tough. (or raising money to pay for someone to do that)</p>",
        "id": 597029,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528492641
    },
    {
        "content": "<p>it seems to me that it would be useful if there was some way to mark a topic as an FAQ topic, and then there could be a ....stream? ... where you could see a list of discussion related to a particular FAQ.. this would be a very light way to build an FAQ</p>",
        "id": 597031,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528492705
    },
    {
        "content": "<p>thoughts?</p>",
        "id": 597032,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528492707
    },
    {
        "content": "<p>maybe a bot? The UX could be you reply to a topic with <code>@faq-bot Where do birds go when it rains?</code>, and it posts the question + a link to the thread out onto a separate page</p>",
        "id": 597044,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1528495329
    },
    {
        "content": "<p>that's a pretty cool idea.</p>",
        "id": 597052,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528496515
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"111\">@Josh Mandel</span> - thoughts?</p>",
        "id": 597053,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528496534
    },
    {
        "content": "<p>though I think I want to reserve the right to long-termers who have the context to maintain a sensible FAQ...</p>",
        "id": 597056,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528496676
    },
    {
        "content": "<p>maybe it would insert the q and link into a PR on a json file in GH? then we'd get to curate at that level, and could infrastructure off that...?</p>",
        "id": 597057,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528496760
    },
    {
        "content": "<p>you could just have a whitelist of people that are allowed to add FAQs, unless I'm misunderstanding. That's how droplet-bot works on this server.</p>",
        "id": 597058,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1528496794
    },
    {
        "content": "<p>y we could do that.</p>",
        "id": 597059,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528496809
    },
    {
        "content": "<p>I'm just wondering if this could be a generic bot that everyone could use, or whether it would be <a href=\"http://fhir.org\" target=\"_blank\" title=\"http://fhir.org\">fhir.org</a> specific? (that's why the GH idea...)</p>",
        "id": 597060,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528496868
    },
    {
        "content": "<p>My suggestion would be to develop the bot for your own use, but pull out fhir.org-specific details into a config file in cases where it's easy / obvious how to do that. And on the other hand where the generalization isn't easy or obvious, just ruthlessly hard-code the details with no regrets. (Perhaps mark those spots with a comment.)</p>",
        "id": 597136,
        "sender_full_name": "Greg Price",
        "timestamp": 1528507793
    },
    {
        "content": "<p>I think the hard parts for a bot like this will be product/UI questions, not technical; so you'll want to optimize for easily making tweaks to it as you iterate and have ideas about how it could work better for you.</p>",
        "id": 597137,
        "sender_full_name": "Greg Price",
        "timestamp": 1528507913
    },
    {
        "content": "<p>If by doing that you succeed at working out a solution that people in the <a href=\"http://fhir.org\" target=\"_blank\" title=\"http://fhir.org\">fhir.org</a> chat find really works well for you and keep coming back to, I think a lot of communities may be interested in getting something like that for themselves! At that point someone who's excited about running it for another community can try adapting it for there, and that'll be the best time to work out exactly how best to make it generic.</p>",
        "id": 597138,
        "sender_full_name": "Greg Price",
        "timestamp": 1528508150
    },
    {
        "content": "<p>I'm interested, but don't have the technical skills, and I'm already spread way to thin... will socialise it in the FHIR community</p>",
        "id": 597144,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528516102
    },
    {
        "content": "<p>Makes sense! Let us know how it goes.</p>",
        "id": 597147,
        "sender_full_name": "Greg Price",
        "timestamp": 1528519625
    }
]