[
    {
        "content": "<p>Hey folks, exciting news!  We now have a version of the replacement for /api that should be possible for several people to collaborate on.  It's based on the /help/ site infrastructure and is available at /api-new/: <a href=\"https://chat.zulip.org/api-new/\" target=\"_blank\" title=\"https://chat.zulip.org/api-new/\">https://chat.zulip.org/api-new/</a></p>\n<p>Obviously a lot more work is needed to make this good: </p>\n<ul>\n<li>Adding a lot more endpoints to the \"usage\" section</li>\n<li>Adding links to the repositories for the binding projects.</li>\n<li>Maybe adding Swagger links</li>\n<li>Moving the guides for writing bots and integrations to the new /api-new site (right now most of the links take you to ReadTheDocs)</li>\n<li>Moving it to take over the /api URL.</li>\n<li>Etc.</li>\n</ul>\n<p>The hope is that once we swap this in for the old /api, it'll be possible for several folks to collaboratively iterate on this.  I'd absolutely love it if a few folks played with the docs and tried to find anything that's worse in the new version than the old <code>/api</code>; hopefully we can fix those rapidly and then swap it in.</p>\n<p><span class=\"user-mention\" data-user-email=\"jerryguitarist@gmail.com\" data-user-id=\"1833\">@Eeshan Garg</span> <span class=\"user-mention\" data-user-email=\"robhoenig@gmail.com\" data-user-id=\"801\">@Robert Hönig</span> FYI.</p>",
        "id": 315801,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1510176139
    },
    {
        "content": "<p>I guess one note is that probably for moving the guides, we should do it in 2 steps:</p>\n<ul>\n<li>First, move the content with minimal changes to make sure the framework works.</li>\n<li>Second, consider splitting it up for the new context where we have tons of left-sidebar space.</li>\n</ul>",
        "id": 315827,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1510177396
    },
    {
        "content": "<p>One thing I didn't like about it was that when I point my mouse at the right edge of the screen, it is not on the scrollbar. (Browser scrollbars can always be grabbed at the edge of the screen on Windows.)</p>",
        "id": 315900,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1510181428
    }
]