[
    {
        "content": "<p>Not sure if this is the right place for this but ZT is trying to add render actual emojis instead of text emojis.</p>\n<p>We are using Unicode 13.1's database right now which means ZT has access to more emojis in the EmojiPicker than the webapp.<br>\n(and we need all the emoji codepoints that are possible to see whether any emoji breaks ZT's rendering unlike the webapp which can handle and display any codepoint).</p>\n<p>The problem is that the new emojis are rejected by the server because it is not in its database (for reactions that is). Is there a possibility where the server could relax the rules so that a random unicode can be sent to the server. The webapp wouldn't have a problem because it can display it.</p>\n<p>Else we would have to hardcode which is compatible with the server and which is not.</p>",
        "id": 1247600,
        "sender_full_name": "Sai Rohitth Chiluka",
        "timestamp": 1629218774
    },
    {
        "content": "<p>(I split this off from <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/simplify.20rules.20for.20emoji.20names\">#design &gt; simplify rules for emoji names</a> into a more appropriate topic <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> )</p>",
        "id": 1247667,
        "sender_full_name": "Greg Price",
        "timestamp": 1629228687
    },
    {
        "content": "<p>I think the right solution to this is that we should become more prompt at adding new emoji from Unicode to the list that Zulip is aware of. That's <a href=\"https://github.com/zulip/zulip/pull/19371\">#19371</a> to catch up from the last 7 years (!).</p>\n<p>If we drop our practice of spending a lot of effort trying to come up with our own names for the emoji (which has a pretty mixed record of being any better than the names one can find elsewhere, rather than worse), then it should become quite doable to promptly do this every year when a new Unicode version comes out.</p>",
        "id": 1247672,
        "sender_full_name": "Greg Price",
        "timestamp": 1629228990
    },
    {
        "content": "<p>I wouldn't love the idea of the server accepting arbitrary Unicode emoji as reactions when they aren't in its list. One reason is that it'd mean people would start seeing reactions that they couldn't themselves add on other messages.</p>\n<p>This is already true of emoji inside messages -- you can always copy-paste an emoji into the input box where you're typing a message, or if you're on a mobile device (either the Zulip mobile app, or mobile web) then your keyboard lets you type emoji. But it'd feel a lot more salient in reactions, I think.</p>",
        "id": 1247674,
        "sender_full_name": "Greg Price",
        "timestamp": 1629229307
    },
    {
        "content": "<p>Yeah, I think the right answer is as Greg suggests, to (1) fix the server and (2) to still only allow reactions supported by the server.</p>\n<p><span class=\"user-mention\" data-user-id=\"19275\">@Sai Rohitth Chiluka</span> in practice this probably means that the terminal client is already correct.</p>",
        "id": 1256421,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1631835680
    }
]