[
    {
        "content": "<p>So I posted a comment on the <a href=\"https://github.com/zulip/zulip/issues/12207\">issue for adding audio calls</a>, which I think should unblock this being a relatively straightforward feature to add.  I think it's worth doing in that 20 people have taken the time to <a href=\"https://github.com/zulip/zulip/issues?q=is%3Aissue+is%3Aopen+sort%3Areactions-%2B1-desc\">upvote the issue on GitHub</a>, making it the 8th ranked issue by that metric, and it's probably a pretty small project (especially compared to essentially everything else near the top of that list).  </p>\n<p>The proposed design, to avoid requiring 2 clicks to create a call, is to just add a <code>fa-phone</code> icon next to the video call icon that causes Zulip to create the audio call with those options.</p>\n<p>For v1 we'd only support it with Jitsi (and not have the phone icon appear if the configured video call provider or its integration with Zulip doesn't support requesting an audio-by-default call), but it should be easy to add others (I just think it'll be easier to organize the work if those are separate PRs).</p>\n<p><span class=\"user-mention\" data-user-id=\"15808\">@Felix (strifel)</span> FYI, since you did the work to add Big Blue Button support to Zulip.</p>",
        "id": 1240281,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1627498073
    },
    {
        "content": "<p>For Big Blue Button we could set lockSettingsDisableCam in our API call to not allow cameras.<br>\nI can implement that after the PR for the issue is merged and the current Big Blue Button changes are finished and merged</p>",
        "id": 1240291,
        "sender_full_name": "Felix (strifel)",
        "timestamp": 1627499167
    },
    {
        "content": "<p>Sounds good!  For Jitsi I think it'd just make a flexible call with video disabled by default, which is probably slightly better than making it impossible to change during a call if you really want.</p>",
        "id": 1240323,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1627501314
    },
    {
        "content": "<p>The difference is that (if there are not special server settings set) every Big Blue Button call has the camera only optional.</p>",
        "id": 1240339,
        "sender_full_name": "Felix (strifel)",
        "timestamp": 1627502252
    },
    {
        "content": "<p>It's optional in Jitsi too; this is mainly I think a convenience for when the cultural expectation for a given call is for nobody to turn on the camera (so you have to disable your camera at the start of every call).</p>",
        "id": 1240436,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1627510575
    },
    {
        "content": "<p>So in <a href=\"https://github.com/zulip/zulip/pull/25922\">#25922</a>, we add support for an audio call button (currently only available with Jitsi as the call provider, but that's likely not a ton of work to change). <span class=\"user-mention\" data-user-id=\"15808\">@Felix (strifel)</span> FYI BTW in case you're interested in working on <a href=\"https://github.com/zulip/zulip/issues/26550\">https://github.com/zulip/zulip/issues/26550</a>.</p>",
        "id": 1630585,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692837642
    },
    {
        "content": "<p>One detail worth mentioning about how Jitsi works is that every call supports video, so the thing we control is \"is video enabled by default\" in the call.</p>",
        "id": 1630587,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692837673
    },
    {
        "content": "<p>Jitsi's configuration model for this is:</p>\n<ul>\n<li>If the call link explicitly contains a directive to start with video on (<code>#config.startWithVideoMuted=false</code>), everyone clicking that link will get that configuration as the default. (Note that Jitsi has a lobby, so you get the opportunity to change this before being dropped into the meeting).</li>\n<li>If the call link explicitly contains a directive to start with video off (<code>#config.startWithVideoMuted=true</code>), everyone clicking that link will get that configuration.</li>\n<li>If the call link doesn't specify, you get the default of \"whatever the state was the last time you were in a call\".</li>\n</ul>",
        "id": 1630589,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692837802
    },
    {
        "content": "<p>So if we just made the \"audio call\" links set <code>config.startWithVideoMuted=true</code>, then after you clicked such a link, all of our \"video call\" links would also start as audio-only calls, which seems confusing.</p>",
        "id": 1630590,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692837841
    },
    {
        "content": "<p>As a result, <a href=\"https://github.com/zulip/zulip/pull/26550\">#26550</a> now sets <code>config.startWithVideoMuted</code> in the URLs for both types of calls. This is nice in that if you click a link that says \"Join video call\" you're gonna get a call with video enabled by default, and similarly for audio calls, but it has the downside that we're effectively disabling/overriding the Jitsi feature of remembering what happened last time for this parameter, so someone who likes to turn off video for all calls might find this change to be a slight regression, in that they'd need to do that explicitly in the lobby panel each time they join a call that was advertised as a \"video call\".</p>\n<p>I think that's OK but wanted to flag it as an interesting detail. (If we don't like it, it's easy to change our mind for future call links).</p>",
        "id": 1630595,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692837993
    },
    {
        "content": "<p>What do folks think about calling these \"audio calls\" vs. \"voice calls\" in user-facing contexts (e.g., tooltip, help center)? There seems to be some variation between different apps.</p>",
        "id": 1648308,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695839530
    },
    {
        "content": "<p>I think \"voice\" is less ambiguous. Video calls contain audio too. But \"let's chat over voice\" is a pretty common expression, when people mean a videoless call.</p>",
        "id": 1648320,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1695840072
    }
]