[
    {
        "content": "<p>Hey folks, so <a href=\"https://github.com/zulip/zulip/pull/14997/files\">https://github.com/zulip/zulip/pull/14997/files</a> is looking close to being mergeable.  First, I'd love for a few folks to test this out locally and make sure it works with their OS's system.</p>\n<p>Second, there's a question about how to do the database migration.  Do we want users who currently have the night theme to be reverted to the new \"automatic\" default, or should we keep them on the night theme?  There's a LOT of users in this category, so it's worth thinking about how to do it right.</p>",
        "id": 894033,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1591229795
    },
    {
        "content": "<p>Is there a way to get stats on night theme users and what current browser status is for them, ie. to calculate what proportion would/wouldn't change?</p>",
        "id": 894036,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1591230005
    },
    {
        "content": "<p>Not without adding logging specifically on that question.</p>",
        "id": 894041,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1591230395
    },
    {
        "content": "<p>I think both options are reasonable:</p>\n<ul>\n<li>For switching everyone to automatic, all the folks who've switched to the night theme manually know they can do it, so it won't be much trouble.</li>\n<li>For keeping everyone on the night theme as-is, everyone who's happy with the night theme stays happy without any disruption.</li>\n</ul>",
        "id": 894044,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1591230509
    },
    {
        "content": "<p>After thinking about this more, I think probably users will be happiest with preserving the <code>night</code> setting and turning day into automatic.  Updated the issue.</p>",
        "id": 896229,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1591386915
    }
]