[
    {
        "content": "<p>This is a summary of thoughts from considering <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/Renaming.20.28no.20topic.29\">#design &gt; Renaming (no topic)</a> and <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/translating.20blank.20topic.20name\">#design &gt; translating blank topic name</a>.</p>\n<p>While the <code>(no topic)</code> feature is a good solution to avoid users needing to enter a meaningful name, while fitting within the topic model, my sense is it can be challenging to manage. If there is quick/careful moderation of messages then these can be curated using our existing great message-movement features, particularly when there is only one slow/recent conversation in <code>(no topic)</code>. However, even with improved message-movement tools such as selecting multiple messages to extract/move, this seems like it wouldn't scale for busy servers/streams. This is compounded since while misposting can occur across streams/topics, those are easier to curate, and this is a default and so focuses messages.</p>\n<p>The result are <code>(no topic)</code> topics that can get long and messy. I understand the motivation for allowing users to rename this topic even if they can't rename topics generally, to help curate, but they also can't undo/adjust that if they do it inaccurately. While a more privileged user could put it back, you may well grow another big <code>(no topic)</code> - so why not keep them there in the first place? Maybe translating won't make this behavior much worse (see above linked topic), but it perhaps gives a lower threshold for a user to want to adjust the topic, even if it was a minor adjustment from eg. the equivalent of <code>general chat</code> (as <code>(no topic)</code>) to <code>watercooler</code> (a general topic), though UI changes could certainly help.</p>\n<p>The above is not a general issue on this server - there's a high number of active curating users. However, while it's not an important stream here, <a class=\"stream\" data-stream-id=\"7\" href=\"/#narrow/stream/7-test-here\">#test here</a> can illustrate an aspect of this behavior, since it's the extreme example of having no curation for content.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/translating.20blank.20topic.20name/near/1489733\">said</a>:</p>\n<blockquote>\n<p>Mm, good point, we may want to change some aspects of the UI there. Maybe we should remove the pencil icon, and perhaps some of the topic menu options as well. While you may want to move messages out of the topic, conceptually, you can't really rename or move the topic itself.</p>\n</blockquote>\n<p>Removing the pencil icon would essentially be to limit the renaming/moving of the entire topic? That seems to connect with the second bullet point that I posted in the <a href=\"#narrow/stream/101-design/topic/Renaming.20.28no.20topic.29/near/1490995\">connected topic</a>. There are other ways to move messages though, and while the UI can direct/constrain users to some extent, a very busy topic could fit within typical topic-rename windows - so this seems like a limited fix.</p>\n<p>My first bullet point in that message is a far stricter approach, namely to limit renaming/moving messages at all from that topic, which I think would be controversial. However, that addresses the inability to rename/move the topic, and you'd use a <code>/digress</code> to transition to a topic, or perhaps a quote-and-reply could post a back-ref to <code>(no topic)</code>? That maybe leads to a design which is closer to the threads concept used in other products.</p>\n<p>Both approaches could map to variations of the current ability to rename <code>(no topic)</code> (or translated equivalent). Was that feature discussed in the recent tidying of the logic for message topic editing?</p>",
        "id": 1491032,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1673832454
    },
    {
        "content": "<blockquote>\n<p>the equivalent of general chat (as (no topic)) to watercooler (a general topic), though UI changes could certainly help.</p>\n</blockquote>\n<p>When we were chatting about <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/translating.20blank.20topic.20name\">#design &gt; translating blank topic name</a> , <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> noted that we could let orgs customize what they call the blank topic as a follow-up feature, which would be very reasonable to build on top of the design described in that thread. (Orgs that do so would lose on translations for that topic name, but some may be OK with that.)</p>",
        "id": 1491298,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673928306
    },
    {
        "content": "<p>That would of course have a different effect than moving messages currently in <em>general chat</em> to <em>watercooler</em>, as moving messages wouldn't affect what happens next time someone send a message with a blank topic.</p>",
        "id": 1491299,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673928447
    },
    {
        "content": "<p>So maybe the way I'm thinking about this is that \"renaming\" a topic would in this case be confusing, because it's might be unclear whether it (a) changes what the blank topic is called, affecting the future, or (b) moves messages and that's it. So that would be the reason to disable renaming topics in the regular way.</p>",
        "id": 1491300,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673928551
    },
    {
        "content": "<p>But the moving messages out of the topic, including all messages starting with the first one (normally equivalent to renaming the topic) doesn't have that confusion problem -- I think it's pretty clear what it means.</p>",
        "id": 1491302,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673928605
    },
    {
        "content": "<p>So the same argument for disabling it wouldn't apply.</p>",
        "id": 1491303,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673928620
    },
    {
        "content": "<p>See <a href=\"#narrow/stream/101-design/topic/Renaming.20.28no.20topic.29/near/1491658\">my response in rename topic</a>, though happy to follow up here.</p>",
        "id": 1491671,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1673994607
    }
]