[
    {
        "content": "<p>We got a suggestion from a user for a feature  that to me personally sounds super useful - being able to bind certain streams to numbers, so that each such stream can be navigated to with a keyboard shortcut with the number - for example Ctr+1, Ctr+2 etc. </p>\n<p>Any thoughts on whether others agree with this being something we want, and if so, what the keyboard shortcut should be?</p>",
        "id": 1204109,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1623178079
    },
    {
        "content": "<p>Does this conflict with org switching in the desktop app? (I don't use the desktop app, so I don't remember)</p>\n<p>Seems like something useful overall :)</p>",
        "id": 1204110,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1623178164
    },
    {
        "content": "<p>I can get to most streams pretty quickly with <code>q</code>, and I wouldn't want a binding to interleaved views.</p>",
        "id": 1204124,
        "sender_full_name": "Steve Howell",
        "timestamp": 1623178312
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell (showell)</span> <a href=\"#narrow/stream/101-design/topic/Binding.20streams.20Ctr.2B.3C0-9.3E/near/1204124\">said</a>:</p>\n<blockquote>\n<p>I can get to most streams pretty quickly with <code>q</code>, and I wouldn't want a binding to interleaved views.</p>\n</blockquote>\n<p>Hmm true, but I imagine that if someone has only a couple of streams that they use very intensively, it would be an overkill to go through stream filtering every time to move between them - compared to just hitting Ctr+1, Ctr+2 to super-quickly switch between them</p>",
        "id": 1204163,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1623178964
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"17945\">Wesley Aptekar-Cassels</span> <a href=\"#narrow/stream/101-design/topic/Binding.20streams.20Ctr.2B.3C0-9.3E/near/1204110\">said</a>:</p>\n<blockquote>\n<p>Does this conflict with org switching in the desktop app? (I don't use the desktop app, so I don't remember)</p>\n</blockquote>\n<p>On macOS, those are bound to ⌘1, ⌘2, etc.</p>",
        "id": 1204177,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1623179486
    },
    {
        "content": "<p>I don't have a Linux or Windows machine to check those.</p>",
        "id": 1204178,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1623179506
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"10349\">Mateusz Mandera</span> <a href=\"#narrow/stream/101-design/topic/Binding.20streams.20Ctr.2B.3C0-9.3E/near/1204163\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell (showell)</span> <a href=\"#narrow/stream/101-design/topic/Binding.20streams.20Ctr.2B.3C0-9.3E/near/1204124\">said</a>:</p>\n<blockquote>\n<p>I can get to most streams pretty quickly with <code>q</code>, and I wouldn't want a binding to interleaved views.</p>\n</blockquote>\n<p>Hmm true, but I imagine that if someone has only a couple of streams that they use very intensively, it would be an overkill to go through stream filtering every time to move between them - compared to just hitting Ctr+1, Ctr+2 to super-quickly switch between them</p>\n</blockquote>\n<p>The <code>q</code> navigation respects pinning.</p>",
        "id": 1204202,
        "sender_full_name": "Steve Howell",
        "timestamp": 1623180190
    },
    {
        "content": "<p>I don't see this as being a feature that would add much, in addition to having the conflict with the desktop app, so I'd thank the user for their feedback and move on.</p>",
        "id": 1204509,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1623195962
    },
    {
        "content": "<p>Hey guys, just wanted to chime in with my 2 cents. </p>\n<p>I heavily use one or two streams at a time, and most of the time I'm bouncing between topics. Ideally, when  I use apps a lot, I like to use shortcut keys as much as possible, so that I'm basically just using my lizard brain to use the tools, (in this case navigating to the right stream/topic) and reserving my exec center for the tasks that need it (composing messages). Often when I am using Zulip, I have a thought in my head, or a response, and I'd like to get it written out in the right location without using the executive center in my brain.</p>\n<p>For my case, ideally there would be a global keybinding  that quickly places me somewhere I could type a few letters of the topic, hit enter and start typing my message.  I'm aware there is a path to doing this using key commands only, but they are conditional (you cant be in edit mode) and they require a specific order.  This means that in practice, I have to engage my executive center in order to find the right topic to sent the message in. And it's not for lack of trying.  This may sound a bit dramatic, but as someone who works with ADD, I'm particularly sensitive to this while working,</p>",
        "id": 1223837,
        "sender_full_name": "Alexx Henry",
        "timestamp": 1625178099
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"20781\">@Alexx Henry</span> thanks for the feedback!  Can you talk a bit more about the situation you're in when you want such a keybinding?  I can imagine <code>c</code> doing what you want, but I don't think I have enough context on the situation to be sure. </p>\n<p>(That opens the compose box with the current stream and focus in the topic input box).</p>",
        "id": 1223872,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1625181503
    },
    {
        "content": "<p>Is the idea that you want Zulip's autocomplete in the topic box to consider potential existing topics in other streams that you're subscribed to?</p>",
        "id": 1223874,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1625181526
    },
    {
        "content": "<p>I think this is one reason that <span class=\"user-mention silent\" data-user-id=\"20781\">Alexx Henry</span> doesn't find <code>c</code> alone to be a solution:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"20781\">Alexx Henry</span> <a href=\"#narrow/stream/101-design/topic/Binding.20streams.20Ctr.2B.3C0-9.3E/near/1223837\">said</a>:</p>\n<blockquote>\n<p>I'm aware there is a path to doing this using key commands only, but they are conditional (you cant be in edit mode) and they require a specific order.</p>\n</blockquote>\n<p>It won't work when you're inside the compose box, because it'll type a literal \"c\" instead.</p>",
        "id": 1223878,
        "sender_full_name": "Greg Price",
        "timestamp": 1625181812
    },
    {
        "content": "<p>I think one habit I have in using Zulip (and <span class=\"user-mention\" data-user-id=\"20781\">@Alexx Henry</span>, you might or might not find this helpful) is that before typing a navigation command like <code>c</code> or <code>n</code> or <code>t</code>, I'll hit the Up or Down arrow key a couple of times.</p>\n<p>This has the effect of closing the compose box, if it's open but empty. And if it's already closed, it's basically harmless, just moves the blue-box cursor a couple of messages.</p>\n<p>For me, I think it isn't common that I'll have the compose box open and have text in it, unless I'm actively thinking about an in-progress message. But it is common to have the compose box open and empty. So this is a way of resetting the state to \"compose box is closed\", without first looking to see if it is.</p>",
        "id": 1223881,
        "sender_full_name": "Greg Price",
        "timestamp": 1625182051
    },
    {
        "content": "<p>Hmm, and perhaps relatedly: just after sending that message, I noticed that I hit the arrow keys to move the cursor up and down a few messages.</p>\n<p>I think that's probably also a habit -- probably I often do that after sending a message, if I don't intend to immediately send another. That's also a way of resetting the state to \"compose box empty\", so that navigation commands are available.</p>",
        "id": 1223884,
        "sender_full_name": "Greg Price",
        "timestamp": 1625182197
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> </p>\n<p>I'll speak first to what I want to acomplish: Often I have a thought in my head, and I want to quickly get it out and into a message in the appropriate topic. What I would like is for a method to quickly access the target topic, even if I only have a fuzzy idea of what it's called. </p>\n<p><span class=\"user-mention\" data-user-id=\"2187\">@Greg Price</span> 's comment is correct. Because c is modal, it often requires <code>c</code> <code>escape</code> <code>c</code>, which takes me out of the zone. I do use vim, so i'm ok with modal programs, but the bigger issue i have with <code>c</code> is that it requres me to be in a specific stream.</p>\n<p>Getting to the stream is also modal, and I think the combination of <code>q</code> <code>text</code> <code>t</code> <code>t</code> <code>text</code>, etc... in practial use winds up being too high friction for me to use consistantly.</p>",
        "id": 1223887,
        "sender_full_name": "Alexx Henry",
        "timestamp": 1625182320
    },
    {
        "content": "<p>a non-modal keybinding that was like <code>c</code> but that would seach across all topics would acutally solve my problem, but I'm sure there are many ways to acheive this.</p>",
        "id": 1223893,
        "sender_full_name": "Alexx Henry",
        "timestamp": 1625182572
    },
    {
        "content": "<p>Thanks for the helpful feedback!</p>\n<p><span class=\"user-mention silent\" data-user-id=\"20781\">Alexx Henry</span> <a href=\"#narrow/stream/101-design/topic/Binding.20streams.20Ctr.2B.3C0-9.3E/near/1223887\">said</a>:</p>\n<blockquote>\n<p>I do use vim, so i'm ok with modal programs, but the bigger issue i have with <code>c</code> is that it requres me to be in a specific stream.</p>\n</blockquote>\n<p>One thing you can do is hit <code>c</code> -- or if you're already in the compose box, then skip that step -- and then go and edit the field that says what stream you're sending to.</p>\n<p>The stream and topic fields are both editable, just like the message content is.</p>\n<p>You can get to that field with the mouse, or with normal keyboard UI navigation by hitting Shift+Tab a couple of times.</p>",
        "id": 1223894,
        "sender_full_name": "Greg Price",
        "timestamp": 1625182628
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> <a href=\"#narrow/stream/101-design/topic/Binding.20streams.20Ctr.2B.3C0-9.3E/near/1223894\">said</a>:</p>\n<blockquote>\n<p>You can get to that field with the mouse, or with normal keyboard UI navigation by hitting Shift+Tab a couple of times.</p>\n</blockquote>\n<p>What kind of monster uses a mouse? ;)</p>",
        "id": 1223896,
        "sender_full_name": "Alexx Henry",
        "timestamp": 1625182680
    },
    {
        "content": "<p>(To be clear: I don't think this is obvious!)</p>",
        "id": 1223899,
        "sender_full_name": "Greg Price",
        "timestamp": 1625182735
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"2187\">@Greg Price</span> the shift-tab thing is not bad.</p>",
        "id": 1223902,
        "sender_full_name": "Alexx Henry",
        "timestamp": 1625182846
    },
    {
        "content": "<p>Honestly if there were a non-modal method to quickly nav to a stream, then I think hitting <code>c</code> once I'm there is totally reasonable, and b/c I would be getting there the same way, the modality of <code>c</code> wouldnt matter. </p>\n<p>I know it seems like I'm being nit picky, but I promise I'm putting in the effort to try to make it work for me, and for some reason hitting <code>q</code>, then somethimes realizing I need to hit escape then <code>q</code>, then the rest.. it almost always winds up taking me out of the zone.</p>",
        "id": 1223914,
        "sender_full_name": "Alexx Henry",
        "timestamp": 1625183163
    },
    {
        "content": "<p>also, I often find myself not being able to do an escape sequence that gets me to be able to use <code>q</code>. I'm sure i'm in some other mode, but I havent been able to identify the pattern yet.</p>",
        "id": 1223918,
        "sender_full_name": "Alexx Henry",
        "timestamp": 1625183265
    },
    {
        "content": "<p>Do you ever try using Ctrl+K for this purpose? I wonder if that one works for you.</p>",
        "id": 1223940,
        "sender_full_name": "Greg Price",
        "timestamp": 1625184515
    },
    {
        "content": "<p>That one deliberately works even if you have the compose box open. It opens the search bar, and one of the things you can do there is go to a stream or a topic.</p>",
        "id": 1223941,
        "sender_full_name": "Greg Price",
        "timestamp": 1625184578
    },
    {
        "content": "<p>I think the original idea when we picked that binding for that functionality was that it'd be a form of global quick navigation -- basically exactly what you're looking for here, I think.</p>\n<p>I'm not sure we've entirely realized that vision as things stand, but if not then perhaps that's a direction to work in.</p>",
        "id": 1223942,
        "sender_full_name": "Greg Price",
        "timestamp": 1625184644
    },
    {
        "content": "<p>I find Ctrl+K to be too <em>everthing but the kitchen sink</em> for it to be usefull for a rapid navigation. I like the idea... It's what I used to use in Slack, and what works well in Monday, but I haven't had luck here.</p>",
        "id": 1223961,
        "sender_full_name": "Alexx Henry",
        "timestamp": 1625192347
    }
]