[
    {
        "content": "<p>I've added a hover features to the features listed on the /features page. Instead of thinking of hover as the trigger, we should think of it as a progressive enhancement. Currently, when a user hovers over a feature there's a box-shadow transition. Not showing sections (Fine solid lines for sectioning) beforehand lowers the cognitive load and provide white space which creates breathing space and helps in maintaining the individuality of each element (i.e INTEGRATIONS, API, etc) and helps users navigate in a more confident and efficient way. When the user wants to focus on some feature, a smooth transition with the white card is creating concentration. Also added learn more with an arrow that we've used above in the Keyboard Shortcuts section to make it seamless.</p>\n<p>I've also provided an anchor tag to link to the respective /help page. There are a few things I need clarification on, firstly I wanted to ask if there's supposed to be a hover for all the features (there are a lot of them as we scroll down) and Need discussion on applying the same transition to all of them or categorizing elements of 'And everything else you need...' section first then deciding hovers and other interactions because we must ensure users can always discover content and relevant options in an easy way.</p>\n<p><a href=\"/user_uploads/2/9d/CBcwjUsEy8uVLVF5GEYTZ8VN/Hover.mov\" target=\"_blank\" title=\"Hover.mov\">Hover.mov</a></p>",
        "id": 733853,
        "sender_full_name": "Hitesh Khairwal",
        "timestamp": 1555478211
    },
    {
        "content": "<p><a href=\"/user_uploads/2/64/uftKP6o0cwQjMksmW4MV4ydE/Screenshot-2019-04-16-at-4.50.53-PM.png\" target=\"_blank\" title=\"Screenshot-2019-04-16-at-4.50.53-PM.png\">Screenshot-2019-04-16-at-4.50.53-PM.png</a> <a href=\"/user_uploads/2/db/UdoqH__CBYKn-A1XjPsPdgYD/Screenshot-2019-04-16-at-4.51.01-PM.png\" target=\"_blank\" title=\"Screenshot-2019-04-16-at-4.51.01-PM.png\">Screenshot-2019-04-16-at-4.51.01-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/64/uftKP6o0cwQjMksmW4MV4ydE/Screenshot-2019-04-16-at-4.50.53-PM.png\" target=\"_blank\" title=\"Screenshot-2019-04-16-at-4.50.53-PM.png\"><img src=\"/user_uploads/2/64/uftKP6o0cwQjMksmW4MV4ydE/Screenshot-2019-04-16-at-4.50.53-PM.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/db/UdoqH__CBYKn-A1XjPsPdgYD/Screenshot-2019-04-16-at-4.51.01-PM.png\" target=\"_blank\" title=\"Screenshot-2019-04-16-at-4.51.01-PM.png\"><img src=\"/user_uploads/2/db/UdoqH__CBYKn-A1XjPsPdgYD/Screenshot-2019-04-16-at-4.51.01-PM.png\"></a></div>",
        "id": 733854,
        "sender_full_name": "Hitesh Khairwal",
        "timestamp": 1555478234
    },
    {
        "content": "<p>I've also attached a video file named 'Hover.mov' above ^</p>",
        "id": 733855,
        "sender_full_name": "Hitesh Khairwal",
        "timestamp": 1555478258
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"12110\">@Hitesh Khairwal</span> do you have a PR for this? Attaching a link for the PR would help :). Further, using a <code>.gif</code> for the demo would benefit as it gets auto rendered in the web-app</p>",
        "id": 733860,
        "sender_full_name": "Sumanth Rao",
        "timestamp": 1555481269
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"12110\">@Hitesh Khairwal</span> I'd recommend <a href=\"https://github.com/phw/peek\" target=\"_blank\" title=\"https://github.com/phw/peek\">https://github.com/phw/peek</a> for capturing GIFs.</p>",
        "id": 733866,
        "sender_full_name": "Shubham Padia",
        "timestamp": 1555481544
    },
    {
        "content": "<p>Thank you for suggesting <span class=\"user-mention\" data-user-id=\"5263\">@Shubham Padia</span> and <span class=\"user-mention\" data-user-id=\"10457\">@Sumanth Rao</span>. Currently, I've started using chrome capture. :) </p>\n<p>And here is the link the PR: <a href=\"https://github.com/zulip/zulip/pull/12155\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/12155\">https://github.com/zulip/zulip/pull/12155</a><br>\nYour feedback is highly appreciated and will help us to improve our ability to serve our user.</p>",
        "id": 734239,
        "sender_full_name": "Hitesh Khairwal",
        "timestamp": 1555561536
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"12110\">@Hitesh Khairwal</span>! A few thoughts:</p>\n<ul>\n<li>I wonder if the \"Learn more\" likns can be made less prominent -- the /help pages explain stuff, but aren't really where we want to direct folks. It's more like we want them to feel more confident that we really have implemented the thing they are looking for. </li>\n<li>I'm curious how others feel about collapsing things in the bottom section, or if there are other ways we can present a list of 20-30 features. </li>\n</ul>\n<p>If it helps, the user to have in mind is a corporate buyer with a big checklist in their mind, and they are going through a bunch of products and seeing if it's plausible that Zulip will have all the features they need.</p>",
        "id": 734324,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1555604600
    },
    {
        "content": "<p>Thank you so much for your feedback, sir!<br>\nYes, made the \"learn more\" links less prominent just to avoid the distraction when the user is reading that card while hovering state. Lowering the learn more size will not increase the confidence significantly but help the user from redirecting to pages.</p>\n<p>Increment in confidence is gradual on this page from top to bottom also need to create the trust and some more product value addition is required (Need to work on the hero area of this page)</p>\n<p>If a user is on our website, also came to /features page and scrolling down to the end of the page.<br>\nHypothesis: He has a strong intent and really exploring/comparing Zulip features and services.</p>\n<p>Self-explanatory headings in the last section will easily help him to go through his checklist, a user might not read every single sub-headings/copy<br>\nBut if a user wants to, that collapsible elements might work.<br>\nAre we using any Analysis and Feedback tool to study online behavior and performance/conversion rates, like Hotjar or something else?</p>\n<p>I believe when I started working on this project, I really needed to know more about our users to create a hypothesis for further process. We really need a discussion on primary users and potential user. I'm starting user research with some basic methods ASAP.</p>",
        "id": 735063,
        "sender_full_name": "Hitesh Khairwal",
        "timestamp": 1555745071
    }
]