[
    {
        "content": "<p>I was looking through our most-upvoted issues, and came across <strong>Add option for disabling webcam by default when using jitsi</strong> <a href=\"https://github.com/zulip/zulip/pull/12207\">#12207</a>. It seems like one of the easiest highly-requested features to implement, at least for Jitsi:</p>\n<blockquote>\n<p>It looks like the Jitsi API supports creating such a meeting by putting extra content in the video call URL:<br>\n<a href=\"http://community.jitsi.org/t/disable-particpants-video-by-default/74177/2\">community.jitsi.org/t/disable-particpants-video-by-default/74177/2</a></p>\n</blockquote>\n<p>However, we should figure out the specific design for this feature. So that we understand the design space, can someone explain how exactly <a href=\"https://github.com/jitsi/jitsi-meet/blob/master/config.js#LL273C1-L278C35\">these two options</a> would work? (I got there from <a href=\"https://community.jitsi.org/t/url-parameters-to-join-jitsi-meet-with-camera-and-or-mic-disabled/32341\">here</a>.)  </p>\n<div class=\"codehilite\"><pre><span></span><code>    // Every participant after the Nth will start video muted.\n    // startVideoMuted: 10,\n\n    // Start calls with video muted. Unlike the option above, this one is only\n    // applied locally. FIXME: having these 2 options is confusing.\n    // startWithVideoMuted: false,\n</code></pre></div>\n<p>More generally, my understanding is that it would be easy to have a call-specific setting where users after the Nth (where N could equal zero) would join with their video off. Is it also possible to have a personal configuration where I could join all calls with my video off, or no?</p>",
        "id": 1573232,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1684535910
    },
    {
        "content": "<p>I agree this should in theory be easy. I'm not totally sure and probably it'd be good for someone to just try testing with Jitsi's API what those do.</p>",
        "id": 1573317,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1684542698
    },
    {
        "content": "<p>I just gave a look at this one and as <span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> mentioned in the above message -- to start a call with the camera being off by default, we need to append <code>#config.startWithVideoMuted=true</code> to the current URL of the meet (for Jitsi Meet).</p>\n<p>This is how an audio link would look like:<br>\n<a href=\"https://meet.jit.si/795277944280151#config.startWithVideoMuted=true\">Join audio call.</a></p>",
        "id": 1584711,
        "sender_full_name": "Satyam Bansal",
        "timestamp": 1685792332
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"https://github.com/zulip/zulip/issues/12207#issuecomment-888536639\">said</a>:</p>\n<blockquote>\n<p>So the main challenge here is figuring out a UI for making these. Probably the cleanest option is to just provide a phone call button next to the video call button that uses this: <a href=\"https://fontawesome.com/v4.7/icon/phone\">https://fontawesome.com/v4.7/icon/phone</a></p>\n<p>For v1 we can just only have the phone-call button appear if the Zulip integration with the call provider supports the feature, and then we can open follow-up issues for doing the work to support this in all of our video call providers, which seems likely not hard, but is going to be independent work potentially requiring specialized expertise with the video call providers.</p>\n</blockquote>\n<p>I agree with this approach, so we can simply show the phone icon when the video call provider is set to <code>Jitsi Meet</code> and hide it otherwise (at least for now).</p>",
        "id": 1584712,
        "sender_full_name": "Satyam Bansal",
        "timestamp": 1685792547
    },
    {
        "content": "<p>Yeah, that seems like a pretty reasonable plan.</p>",
        "id": 1586948,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1686103539
    },
    {
        "content": "<p>Opened <a href=\"https://github.com/zulip/zulip/pull/25922\">#25922</a>.</p>",
        "id": 1587370,
        "sender_full_name": "Satyam Bansal",
        "timestamp": 1686145770
    }
]