[
    {
        "content": "<p>Today I got an interesting prompt from Gmail: <a href=\"/user_uploads/2/f7/n7JrH2M5tyCivTUJ4qUc5cAS/image.png\">image.png</a>.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/f7/n7JrH2M5tyCivTUJ4qUc5cAS/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/f7/n7JrH2M5tyCivTUJ4qUc5cAS/image.png\"></a></div><p>For background, by default, a web app can only tell if you're interacting with its browser tab, not whether you're at your computer; this means that our online/idle/offline display is fundamentally not very accurate for web app users. The desktop app is able to hook into OS APIs for whether the user is actually idle; this is one of the main functional advantages of the desktop app over the web app. (Though it mostly helps other users see your presence more accurately).</p>\n<p>I believe the background here is a new Chrome feature (not supported in other major browsers). It comes with a permissions prompt, like \"Can this site send you desktop notifications?\". Here's an article describing the (fairly new) Chrome feature:</p>\n<p><a href=\"https://www.makeuseof.com/what-is-idle-detection-chrome/\">https://www.makeuseof.com/what-is-idle-detection-chrome/</a></p>\n<p>We should figure out how we want to use this in Zulip.</p>",
        "id": 1537514,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1680196666
    },
    {
        "content": "<p>Interesting! That does sound useful.</p>",
        "id": 1541407,
        "sender_full_name": "Greg Price",
        "timestamp": 1680644221
    },
    {
        "content": "<p>We've long had issues like <a href=\"https://github.com/zulip/zulip/pull/18072\">#18072</a> that can be pretty severe in their impact, and basically stem from us not knowing whether the user is active.</p>",
        "id": 1541408,
        "sender_full_name": "Greg Price",
        "timestamp": 1680644286
    },
    {
        "content": "<p>I've also learned the hard way to absolutely never leave my Zulip browser tab without switching it to the Recent Topics view, because otherwise when messages arrive in whatever conversation I was looking at, they'll get marked as read and I'll never see them.</p>",
        "id": 1541411,
        "sender_full_name": "Greg Price",
        "timestamp": 1680644387
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> <a href=\"#narrow/stream/101-design/topic/chrome.20idle.20detection/near/1541411\">said</a>:</p>\n<blockquote>\n<p>I've also learned the hard way to absolutely never leave my Zulip browser tab without switching it to the Recent Topics view, because otherwise when messages arrive in whatever conversation I was looking at, they'll get marked as read and I'll never see them.</p>\n</blockquote>\n<p>Are you seeing that when the tab isn't focused? That certainly is not expected and would be a regression we should investigate.</p>",
        "id": 1541480,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1680653714
    },
    {
        "content": "<p>I'm seeing it when the whole machine isn't focused — when I've locked the screen and gotten up and left.</p>\n<p>Not sure if the browser window was the last one focused when I got up, or if the tab was the one focused within the window.</p>",
        "id": 1541507,
        "sender_full_name": "Greg Price",
        "timestamp": 1680662005
    },
    {
        "content": "<p>I'm not sure what solution we will arrive at, but I think it's worth including the reference links to the Idle Detection API on <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Idle_Detection_API#browser_compatibility\">MDN</a> and the <a href=\"https://developer.chrome.com/articles/idle-detection/\">article</a> on the Chrome blog.</p>",
        "id": 1543024,
        "sender_full_name": "Daniil Fadeev",
        "timestamp": 1680855573
    },
    {
        "content": "<p>This API is included in Chromium version 94. I attempted a quick search in Sentry to determine how many users are currently using this or a higher version, but I was unsuccessful. It's possible that I don't have the required permissions, or I simply may not be a Sentry power user ;)</p>",
        "id": 1543025,
        "sender_full_name": "Daniil Fadeev",
        "timestamp": 1680855799
    },
    {
        "content": "<p>I filed <a href=\"https://github.com/zulip/zulip/pull/25056\">#25056</a> as a placeholder issue to keep track of this idea (not marked as \"help wanted\" for now).</p>",
        "id": 1544323,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1681144390
    },
    {
        "content": "<p>I've implemented the POC for chrome idle detection: <a href=\"https://github.com/akshatdalton/chrome-idle-detection\">https://github.com/akshatdalton/chrome-idle-detection</a> - you can try it out on a live server (I used VS Code Live Server extension). Here I'm attaching the recorded video for the same which updates the user state and screen state:<br>\n<a href=\"/user_uploads/2/eb/7MXglz7bI5JecaIcnom1Acd-/chrome-idle-detection.mov\">chrome-idle-detection.mov</a></p>",
        "id": 1606473,
        "sender_full_name": "Akshat",
        "timestamp": 1688844723
    },
    {
        "content": "<p>I would like to understand what presence management tasks we would like to integrate using this feature, given that we can track <code>user state</code> and <code>screen state</code> when user permission is given.</p>",
        "id": 1606474,
        "sender_full_name": "Akshat",
        "timestamp": 1688845102
    },
    {
        "content": "<p>That's an interesting POC, Akshat. I wonder if the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Page_Visibility_API\">Page Visibility API</a> doesn't have some role to play here? It's widely supported, and doesn't require user permissions the way the IdleDetector API does. It also handles the simpler case of a user having another browser window or tab focused, without having to wait for idle thresholds, etc.</p>",
        "id": 1606919,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1688994260
    },
    {
        "content": "<p>True. I checked that out but I think do we really want to change the user's status to <code>Idle</code> if they have just changed their tab (i.e. when the document is <code>hidden</code>)?<br>\nI may be working and have opened new tabs but that doesn't mean I'm not active at that moment.<br>\nThoughts on this?</p>",
        "id": 1607184,
        "sender_full_name": "Akshat",
        "timestamp": 1689017023
    },
    {
        "content": "<p>Good points. It would/should still be possible to have a <code>setTimeout</code> set to a certain threshold with page visibility's events that would provide some kind of a hook (a global variable?) for tapping into user state like this.</p>",
        "id": 1608986,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1689255778
    },
    {
        "content": "<p>So to provide some context, the reason we're interested in this is that currently, the Zulip desktop app is able to answer the question \"is this user at the computer\", whereas the web app can only answer the question \"has this user interacted with the Zulip window\".</p>\n<p>As a result, users who are working at their computer but not interacting with Zulip at the moment can be shown as online with the desktop app (e.g. if you send them a DM, they'll likely see that desktop notification immediately), whereas users who are doing that in the web app are shown as an idle state where Zulip can't distinguish the user being at their computer and not having tabbed to the Zulip window in the last 4 hours from they left Zulip open on their desktop at work 4 hours ago are at home asleep.</p>",
        "id": 1609062,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1689261546
    },
    {
        "content": "<p>The page visibility API (or our existing on-focus handler) can't help with solving that problem.</p>",
        "id": 1609064,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1689261580
    }
]