[
    {
        "content": "<p>Currently, when you click on a stream in the left sidebar, we drop you into an interleaved view and mark a message as read. What do you think of the following?</p>\n<ul>\n<li>If the stream has no unreads, do the current behavior</li>\n<li>If the stream has unreads, clicking on it<br>\n    * Just opens the topic list, without changing the narrow<br>\n    * Changes <code>#design</code> to something like <code>#design (all)</code>, so that you can click on it again to get the stream interleaved view</li>\n</ul>",
        "id": 698572,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1549992057
    },
    {
        "content": "<p>I think that’s great. I just made the same case on mobile a few hours ago 🙂</p>",
        "id": 698575,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549993207
    },
    {
        "content": "<p>That feels confusing to me.</p>",
        "id": 698581,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549994347
    },
    {
        "content": "<p>One of our constraints is that we need to preserve the current behavior for people who really want to go directly into interleaved views, and give them a nice click area.  And then we have people like me/Armaan who prefer to get a topics list.</p>\n<p>I'd rather just have a smaller icon for \"topics\" that I can click to pull up some kind of topics modal.</p>",
        "id": 698582,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549994493
    },
    {
        "content": "<p>To elaborate on the confusion point, the current sidebar has a nice invariant now that it always shows where you're narrowed.  I kind of don't want to mess with that.</p>",
        "id": 698583,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549994553
    },
    {
        "content": "<p>I think what should happen is when you click on a stream, instead of an abbreviated list of topics below the stream name ( which I’ve always found kind of useless ) the entire sidebar could become the topic list with unread counts ( similar to what you love been working on ) along with a back button. </p>\n<p>Either that or using the space where the buddy list is now for a topic sidebar ( which I’ve been pushing for for a while. Great thing is it can be constant across, streams, messages, searches and you’re not clicking any back buttons. )</p>",
        "id": 698590,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549995325
    },
    {
        "content": "<blockquote>\n<p>I think what should happen is when you click on a stream, instead of an abbreviated list of topics below the stream name ( which I’ve always found kind of useless ) the entire sidebar could become the topic list with unread counts ( similar to what you love been working on ) along with a back button. </p>\n<p>Either that or using the space where the buddy list is now for a topic sidebar ( which I’ve been pushing for for a while. Great thing is it can be constant across, streams, messages, searches and you’re not clicking any back buttons. )</p>\n</blockquote>\n<p>I would support some variation of that approach (including just a modal with topics and unread counts).  And then for folks who want to go directly to the interleaved view, maybe make the \"#\" go there directly.  Or add a new icon to do that.</p>",
        "id": 698591,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549995491
    },
    {
        "content": "<p>The other way to solve my problem (need to find topics without changing my narrow) is to have an advanced search widget.  Our current search is too noisy if you just want to get a list of streams, pick one, then get a list of topics, and pick that.</p>",
        "id": 698592,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549995577
    },
    {
        "content": "<p>I agree that cleaning up search is a good idea but IMO that doesn't typically cause too much frustration. I do think however having a topic list more accessible in general ( not just for streams but for all user stories ) would be a lot of UX win.</p>",
        "id": 698595,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549996062
    },
    {
        "content": "<p>And not to bang this point home too hard but think about how much easier everything would be if you always had a summarlized list of topics / messages on the right no matter where you are <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 698596,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549996114
    },
    {
        "content": "<p>I'm not proposing to clean up search, per se.  I'm just saying you could have a way to just surf streams and topics that doesn't impact the sidebar.</p>",
        "id": 698597,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549996121
    },
    {
        "content": "<p>I guess I'm not understanding the user flow there. Could you write it down step by step?</p>",
        "id": 698599,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549996153
    },
    {
        "content": "<blockquote>\n<p>And not to bang this point home too hard but think about how much easier everything would be if you always had a summarlized list of topics / messages on the right no matter where you are :)</p>\n</blockquote>\n<p>I know that Rishi and I are personally warming up to the idea of using the right sidebar more creatively.</p>",
        "id": 698601,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549996159
    },
    {
        "content": "<blockquote>\n<p>I guess I'm not understanding the user flow there. Could you write it down step by step?</p>\n</blockquote>\n<p>So the idea is there would be a little icon next to search that would mean \"go to narrow\".  It would pop a modal (or take up a pane).  It would have tabs for Streams and PMs (with the tab based on your current narrow).  If you're on the streams pane, there would be a list of streams.  When you clicked on a stream, you'd get a <strong>full</strong> list of topics for that streams.  There'd be bells and whistles for sorting/searching.  When you clicked on a topic, you'd go to the narrow.</p>",
        "id": 698606,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549996424
    },
    {
        "content": "<p>I think that sounds wonderful as well as wonderfully complicated <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>\n<p>I had suggested similar features for the search results page itself. Why would this not just replace current search?</p>",
        "id": 698607,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549996525
    },
    {
        "content": "<p>It's not that complicated.</p>",
        "id": 698608,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549996541
    },
    {
        "content": "<p>It's hard to explain, hard to visualize, but very simple.</p>",
        "id": 698609,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549996581
    },
    {
        "content": "<p>Yeah you're probably right. Maybe a quick mockup would help <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 698610,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549996597
    },
    {
        "content": "<p>But fundamentally I feel like that sounds like a secondary or more complex user flow than what I'm suggesting.</p>",
        "id": 698612,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549996655
    },
    {
        "content": "<p>We started out talking about seeing a list of topics in a stream. You mentioned you had a pain point with regard to search. I feel like they're different discussions kinda.</p>",
        "id": 698613,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549996714
    },
    {
        "content": "<p>Yeah, to be clear, solving this with search is a digression.  I like the directions you and I are thinking for the sidebar better.</p>",
        "id": 698616,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549996757
    }
]