[
    {
        "content": "<p>Why would we close compose box if a user click on another view? Every time I click on another stream compose box is closing on me... that is painful. What if I didn't send my message? What If I want to check something, like topic name in another stream or just some information to select and copy from semitransparent view?</p>",
        "id": 1439916,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1663911833
    },
    {
        "content": "<p>The behaviour of the compose box has been a constant cause of confusion and frustration for some of our users too, a lot of people come from other chat tools where the compose box is always open. I think perhaps the idea in zulip is that there is a \"read mode\" and \"write mode\" - which I think can be valuable for a lot of people. But it would be nice to be able to pin the compose box or something for users that want that.</p>",
        "id": 1440015,
        "sender_full_name": "Daniel Bradburn",
        "timestamp": 1663947545
    },
    {
        "content": "<p>To be clear, this only seems to happen if the message body is empty, or all whitespace. Which doesn't totally invalidate the points above.</p>",
        "id": 1440028,
        "sender_full_name": "Cyphase",
        "timestamp": 1663950874
    },
    {
        "content": "<p>No it is not. I type things, click on another stream and boom my stuff is gone</p>",
        "id": 1440060,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1663954252
    },
    {
        "content": "<p>I think that automatically restoring drafts when you go back could make a huge difference for this (<a href=\"https://github.com/zulip/zulip/pull/22104\">#22104</a>) but I agree it's confusing, and is one of the biggest UX challenges I have when using Zulip (which is why I worked on <a href=\"https://github.com/zulip/zulip/pull/22104\">#22104</a>)</p>",
        "id": 1440073,
        "sender_full_name": "Evy",
        "timestamp": 1663954738
    },
    {
        "content": "<p>If you click on another stream, the compose box will stay open, but if you click on a <em>message</em> in another stream, the compose box will clear and turn into a reply to the topic the message is in. <span class=\"user-mention\" data-user-id=\"22433\">@Vlad Korobov</span> can you confirm that this is what you're experiencing?</p>",
        "id": 1440077,
        "sender_full_name": "Evy",
        "timestamp": 1663954836
    },
    {
        "content": "<p>Oh also if you click anywhere that's not a message, the compose box closes.</p>",
        "id": 1440078,
        "sender_full_name": "Evy",
        "timestamp": 1663954866
    },
    {
        "content": "<p>I would be pretty in favour of having a speedbump (\"are you sure?\") anytime you leave a composebox that has text in it by clicking elsewhere. We could maybe make this optional if it would be too annoying to power-users, but it would make the onboarding experience so much less confusing imo</p>",
        "id": 1440082,
        "sender_full_name": "Evy",
        "timestamp": 1663954932
    },
    {
        "content": "<p>Though the long-term solution likely involves some combination of <a href=\"https://github.com/zulip/zulip/pull/22104\">#22104</a> and keeping the composebox open in some situations where you click away (like, I see no reason to close the compsebox if I click the whitespace right above it)</p>",
        "id": 1440088,
        "sender_full_name": "Evy",
        "timestamp": 1663954997
    },
    {
        "content": "<p>I'd be extremely excited to work on anything that improves this category of experience :)</p>",
        "id": 1440090,
        "sender_full_name": "Evy",
        "timestamp": 1663955039
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"21453\">Evy</span> <a href=\"#narrow/stream/101-design/topic/Closing.20compose.20box/near/1440077\">said</a>:</p>\n<blockquote>\n<p>If you click on another stream, the compose box will stay open, but if you click on a <em>message</em> in another stream, the compose box will clear and turn into a reply to the topic the message is in. <span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> can you confirm that this is what you're experiencing?</p>\n</blockquote>\n<p>Definitely wondering about this. Because..</p>\n<p><span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> <a href=\"#narrow/stream/101-design/topic/Closing.20compose.20box/near/1439916\">said</a>:</p>\n<blockquote>\n<p>What If I want to check something, like topic name in another stream or just some information to select and copy from semitransparent view?</p>\n</blockquote>\n<p>This makes it sound like it's happening when it shouldn't. I can check topic names in other streams and even <em>select</em> and copy text in a semitransparent view, as well as click the buttons on a message (EDITED, reaction, actions, star). It's only when clicking on a message or on empty space that the compose box closes for me. Clicking on a stream or topic (or other narrow) in the left sidebar, click-dragging to select message text, clicking on a user in the right sidebar; none of these close the compose box for me.</p>",
        "id": 1440285,
        "sender_full_name": "Cyphase",
        "timestamp": 1663969017
    },
    {
        "content": "<p>Yeah, I regularly navigate to other streams/topics without the compose box closing. My guess is that there's some element that is not properly tagged for the purpose of this logic, that <span class=\"user-mention\" data-user-id=\"22433\">@Vlad Korobov</span> clicks on and that <span class=\"user-mention silent\" data-user-id=\"4976\">Cyphase</span> and I don't <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 1440414,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1663980477
    },
    {
        "content": "<p>This is an area that has a lot of subtlety, and has been tweaked in a number of ways over time. I don't have time at the moment to a complete writeup summarizing all of the cases clearly for discussion, but at a high level, there's three options we have for what to do with the compose box when the user clicks on something in the UI (that potentially navigates somewhere else):</p>\n<ul>\n<li>Leaving the compose box open, without changing it's recipient. This is what we intend to do when the user navigates to another stream/topic or clicking on most elements in the UI, such as the gear menu, any message elements, etc.</li>\n<li>Leaving the compose box open, but changing its recipient to match the place you're sending to. This is what we try to do when the compose box is empty. Doing anything else would likely be bad, because we leave the compose box open after you send a message, and your intent is likely not that sending a message and then switching views (with an empty compose box) leads to </li>\n<li>Closing the compose box, saving any content as a draft. One situation in which we might want to do this is the user clicking on blank space on the screen, such as the sidebars or blank space above the compose box, which can indicate intent to clear clutter (basically the mouse user equivalent of hitting \"escape\").</li>\n</ul>\n<p>(Again, the above is not intended to be a precise summary of the rules in the code)</p>",
        "id": 1440418,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1663981142
    },
    {
        "content": "<p>Any rule we pick for exactly how we pick one of those options will have cases where the user would have preferred one of the other ones. Many possible ideas for \"simple\" feeling changes to this behavior that might improve a particular workflow someone has would cause another workflow, which could potentially be 10x as common, to be worse. So, we need to be careful.</p>",
        "id": 1440419,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1663981148
    },
    {
        "content": "<p>My experience in working on the details of this has been that it's important to be extremely specific about the workflow one is doing where one experiences something annoying around this. </p>\n<p>Then we can look at what's happening when something feels annoying -- is it just a bug (where say, a selector didn't get migrated in some design change, which definitely happens), an intentional choice we made in the past that involves a tradeoff, an intended side effect of such a decision, or something else.</p>",
        "id": 1440420,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1663981184
    },
    {
        "content": "<p>I see now the situation I was in...<br>\nI didn't input any text in the message input, but I did wrote a new topic name. So in my mind I already invested in the composing a message. Now if I click on any topic or  stream compose box is closing.</p>\n<p>Another case is when I have my message input filled with something and I click on an empty space and compose box is closing.</p>\n<p>I suggest to not close compose box automatically unless user did it</p>",
        "id": 1440943,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1664150715
    },
    {
        "content": "<p>Here is the video showing confusing cases <a href=\"https://www.loom.com/share/09acdcc65f784a4ebe9b980e260736bf\">https://www.loom.com/share/09acdcc65f784a4ebe9b980e260736bf</a></p>",
        "id": 1440944,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1664151134
    },
    {
        "content": "<p>Mm, yeah, I definitely have had the experience of the compose box closing on me unexpectedly as well, and I'd love to dig into the questions brought up by <span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> above.</p>",
        "id": 1441200,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1664217730
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> One specific observation is that if you have an <em>empty</em> compose box, clicking on a topic in the left sidebar keeps it open, but clicking on a stream closes it. Is that intentional? I think that one has bitten me before, when I'm trying to look up some bit of information before writing my message.</p>",
        "id": 1441206,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1664217835
    },
    {
        "content": "<blockquote>\n<p>Closing the compose box, saving any content as a draft. One situation in which we might want to do this is the user clicking on blank space on the screen, such as the sidebars or blank space above the compose box, which can indicate intent to clear clutter (basically the mouse user equivalent of hitting \"escape\").</p>\n</blockquote>\n<p>More generally, what evidence do we have that users want to use this way of exiting the compose box? Would it be difficult to try test-deploying a PR here that turns off this behavior?</p>",
        "id": 1441208,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1664217927
    },
    {
        "content": "<p>Removing that behavior without other changes would feel pretty broken, because of the interaction with how we fade messages that aren't where you're composing to when the compose target doesn't match the current view. It'd feel pretty bad to have to go click the small X in the compose box in order to clear that state.</p>",
        "id": 1441215,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1664218325
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/Closing.20compose.20box/near/1441206\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> One specific observation is that if you have an <em>empty</em> compose box, clicking on a topic in the left sidebar keeps it open, but clicking on a stream closes it. Is that intentional? I think that one has bitten me before, when I'm trying to look up some bit of information before writing my message.</p>\n</blockquote>\n<p>It's tricky to get to because of the above behavior, but I think clicking on a <em>topic</em> within a <em>different stream</em> from the one you're composing to also closes the compose box.</p>",
        "id": 1441216,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1664218352
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/Closing.20compose.20box/near/1441206\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> One specific observation is that if you have an <em>empty</em> compose box, clicking on a topic in the left sidebar keeps it open, but clicking on a stream closes it. Is that intentional? I think that one has bitten me before, when I'm trying to look up some bit of information before writing my message.</p>\n</blockquote>\n<p>I'm pretty sure this is intentional; a lot of discussion went into discussion around this detail ~3 years ago when we last made major changes to it. A user aware of this behavior can type a couple characters the compose box to avoid it closing; this is a habit I certainly have.</p>\n<p>Note that when clicking on a different topic in the current stream with an empty compose box, we keep the compose box open but change the topic field to match the new topic you've visited. That interaction is designed to make the much more common workflow sequence of \"Send a message (which leaves the compose box open to the current topic), click to another topic, compose a message in the new topic\" feel nice. </p>\n<p>When moving to a stream narrow, it would feel buggy to leave the compose box open to the last topic you visited in the previous stream, and we also can't readily change the compose box to point to a topic in the new stream, because you're now in an interleaved view anyway.</p>",
        "id": 1441218,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1664218708
    },
    {
        "content": "<p>There's certainly potential to enhance the experience of looking up something with the compose box open by adding an explicit control -- say, there's a \"Lock recipient\" toggle button that you can click that will leave the compose box open and pointing to a given recipient until you send your next message.</p>",
        "id": 1441219,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1664218812
    },
    {
        "content": "<p>Or we could try to document/advertise the existing control mechanism of typing some content in pages like <a href=\"https://chat.zulip.org/help/mastering-the-compose-box\">/help/mastering-the-compose-box</a> ... it'd certainly be easier to explain a \"lock recipient\" control, but idunno if it's worth the space it'd require in the compose box UI, and interaction design issues of how that control relates to the automatic \"is the compose box empty or not\" logic we might still want.</p>",
        "id": 1441221,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1664218859
    },
    {
        "content": "<p>I have the same habit of typing a non-whitespace character into the compose box – only one is required – in order to keep it open where I want it.</p>",
        "id": 1441246,
        "sender_full_name": "Cyphase",
        "timestamp": 1664219870
    },
    {
        "content": "<p>As an aside, while poking at it just now, I found that switching to another topic while the compose box contains only whitespace will change the topic, but keep the whitespace, and also select it all. See <a class=\"stream-topic\" data-stream-id=\"9\" href=\"/#narrow/stream/9-issues/topic/compose.20box.20topic.20change.20handling\">#issues &gt; compose box topic change handling</a>.</p>",
        "id": 1441252,
        "sender_full_name": "Cyphase",
        "timestamp": 1664220311
    },
    {
        "content": "<p>Just an update, we've now merged the tweak inspired by this conversation that was further discussed in <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/auto-setting.20compose.20box.20topic\">#design &gt; auto-setting compose box topic</a>; hopefully this makes a material difference on the pain points discussed above.</p>",
        "id": 1493767,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1674248289
    }
]