[
    {
        "content": "<p>The current message retention policy (<a href=\"https://zulip.com/help/message-retention-policy\">https://zulip.com/help/message-retention-policy</a>) UX has the flaw that changing it  is like changing any other org/stream setting - rather \"quiet\". Which is not great, because the effects of accidentally activating retention policy and not noticing can be... well, very bad <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> So as <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span>  mentioned elsewhere we have a couple of options for improving this, such as:</p>\n<blockquote>\n<ul>\n<li>Having an additional, aggressive confirmation dialog before changing the global message retention policy.</li>\n<li>Sending a notification of some sort (e.g. an email or a Zulip message to the notifications stream?) to all administrators when message retention policies are changed for an organization.  Or possibly a Zulip messages to the \"stream events\" topic for a stream when it's changed for an individuals stream.</li>\n</ul>\n</blockquote>\n<p>Thoughts on this? Arguably we should do both - a popup for the person changing the setting and then getting it communicated to other users. Not sure if there's a reason to limit this to administrators, perhaps we should do it in a way that gets all users notified? (sending a <code>Notification bot</code> message to the affected stream/streams would accomplish this)</p>",
        "id": 1278082,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1636399575
    },
    {
        "content": "<p>I think both a confirmation dialog box to the person changing it, and a notification for others, would be good.</p>",
        "id": 1279233,
        "sender_full_name": "Greg Price",
        "timestamp": 1636575887
    },
    {
        "content": "<p>Perhaps a message to stream events when it's changed for an individual stream, and to announcements (the same place a new stream would go) when it's changed globally?</p>",
        "id": 1279235,
        "sender_full_name": "Greg Price",
        "timestamp": 1636575974
    },
    {
        "content": "<p>Yeah, I think such stream events notices makes sense for changes to an individual stream's settings.</p>",
        "id": 1279256,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1636577475
    },
    {
        "content": "<p>For the global settings, I think we can post to the \"new streams\" notification stream, if configured; if not, we don't have a way to post to an announcement stream from code.  That seems OK.</p>",
        "id": 1279257,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1636577518
    },
    {
        "content": "<p>So I think we open two issues:</p>\n<ul>\n<li>One for adding those two automated notifications from Notification Bot.</li>\n<li>One for making changing the global message retention policy have a confirmation modal similar to what we have for deactivating your organization.</li>\n</ul>",
        "id": 1279258,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1636577564
    },
    {
        "content": "<p>Does that sound good?</p>",
        "id": 1279259,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1636577569
    }
]