[
    {
        "content": "<p>Hey! As discussed in <a class=\"stream-topic\" data-stream-id=\"9\" href=\"/#narrow/stream/9-issues/topic/Link.20previews.20off.2C.20but.20Twitter.20still.20on.3F\">#issues &gt; Link previews off, but Twitter still on?</a> , it would be helpful to expand the \"Show previews of linked websites\" setting to allow users to control previews for specific websites. I'm kicking off this thread to figure out how we should implement that.</p>",
        "id": 1485114,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1672844809
    },
    {
        "content": "<p>I think the closest analog we currently have in the settings is the email domain restriction setting:</p>\n<p><a href=\"/user_uploads/2/87/jjv3-tDVs0JNvlEXf3g9yM4G/Screen-Shot-2023-01-04-at-7.02.26-AM.png\">Screen-Shot-2023-01-04-at-7.02.26-AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/87/jjv3-tDVs0JNvlEXf3g9yM4G/Screen-Shot-2023-01-04-at-7.02.26-AM.png\" title=\"Screen-Shot-2023-01-04-at-7.02.26-AM.png\"><img src=\"/user_uploads/2/87/jjv3-tDVs0JNvlEXf3g9yM4G/Screen-Shot-2023-01-04-at-7.02.26-AM.png\"></a></div>",
        "id": 1485115,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1672844824
    },
    {
        "content": "<p>One option would be to keep the checkbox, but have an exceptions list (however exactly it's labeled) that is configured via a similar widget. We could have exceptions for both options (show and don't show), if folks think it's useful.</p>\n<p>We could also change the checkbox to a dropdown, but it might make things somewhat complex for the user, as I think we'd need 4 options if we wanted to give full flexibility:</p>\n<p>[without trying to get the language just right]</p>\n<ul>\n<li>Show all</li>\n<li>Show none</li>\n<li>Show by default, with exceptions</li>\n<li>Don't show by default, with exceptions</li>\n</ul>",
        "id": 1485117,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1672845143
    },
    {
        "content": "<p>I think broadly that's a reasonable direction. That said, I feel like you probably will want more control than just the domain part -- like maybe you want GitHub issues but not PRs to be previewed -- and that depends on a more complex matching pattern on the URL.</p>",
        "id": 1506559,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675988241
    },
    {
        "content": "<p>I don't know how other products let one configure/control previews and whether that's a useful source of inspiration, but the most intuitive model for me would be for the exceptions to have some sort of pattern-matching, perhaps separately for the hostname and path parts of the URL.</p>",
        "id": 1506560,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675988312
    },
    {
        "content": "<p>I dunno, I'm not convinced that would be worth the complexity. I don't even see domain-level controls in Slack or Discord, for example.</p>",
        "id": 1510955,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1677017777
    },
    {
        "content": "<p>Yeah, I often find the previews they generate to be distracting especially for a site like GitHub, but I guess their model is just that the user can click the the dismiss button a decent amount of the time.</p>",
        "id": 1525735,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1678923881
    }
]