[
    {
        "content": "<p>Hi! Here's my unsolicited 2¢. </p>\n<p>1. The \"everything is a thread\" element makes it somewhat akin to email; however, I don't get the list view which makes it easier for me to see the different conversations. </p>\n<p>2. Why use Zulip instead of the GitHub for discussion on a ticket? As a user, it (1) waters down the context in GitHub and (2) forces a decision on \"what goes here v there\"</p>",
        "id": 278191,
        "sender_full_name": "Ariel",
        "timestamp": 1504893021
    },
    {
        "content": "<p><a href=\"/user_uploads/2/f/3EWQqPrTYXXxbhRsvMcH8wfV/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<p>not enough signal on \"here is a <code>list(ish) view</code> / control\"</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/f/3EWQqPrTYXXxbhRsvMcH8wfV/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/2/f/3EWQqPrTYXXxbhRsvMcH8wfV/pasted_image.png\"></a></div>",
        "id": 278192,
        "sender_full_name": "Ariel",
        "timestamp": 1504893147
    },
    {
        "content": "<p>I can answer #2 first.  We don't use Zulip <strong>instead</strong> of GitHub; we use it <strong>in addition</strong> to Github.   For rapid-fire discussion, where maybe you're just polling people for ideas on how to fix something, people prefer the Zulip UI to GH.  Once we reach consensus, we usually cross-post something to GH.</p>",
        "id": 278197,
        "sender_full_name": "Steve Howell",
        "timestamp": 1504893759
    },
    {
        "content": "<p>For #1, I am wondering how we can make the sidebar UI a little more obvious in showing topics.</p>",
        "id": 278198,
        "sender_full_name": "Steve Howell",
        "timestamp": 1504893787
    },
    {
        "content": "<p>re: #2: In addition to what Steve said, GitHub comments produce a lot of unnecessary emails that bother some contributors, so we prefer long, real-time discussion here :)</p>",
        "id": 278199,
        "sender_full_name": "Cynthia Lin",
        "timestamp": 1504893855
    },
    {
        "content": "<p>Thanks for the feedback Ariel! Definitely post as you have more thoughts. </p>\n<p>For #1: Hopefully this will feel more natural as you have more unread messages? I agree we should make the onboarding of this more intuitive, and there are some open PRs in flight that will hopefully do so.</p>\n<p>For #2: Discussion on zulip/zulip issues averages 100s of messages a day (now is currently the lowest its been in months, since many of the core maintainers are on vacation). It would be hard for most contributors to manage 100s of emails or 100s of github comments, but it's easy to manage 100s of messages a day in Zulip. </p>\n<p>For \"what goes here vs there\", by default it should always go on <a href=\"http://chat.zulip.org\" target=\"_blank\" title=\"http://chat.zulip.org\">chat.zulip.org</a>. We should clarify that in our contributors guide.</p>",
        "id": 278258,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1504898905
    },
    {
        "content": "<p>I think collaboration tools like Zulip are more like virtual office spaces; they make working in a distributed environment easier.</p>",
        "id": 278978,
        "sender_full_name": "Umair Khan",
        "timestamp": 1505105851
    }
]