[
    {
        "content": "<p>Another design aspect that <span class=\"user-mention\" data-user-id=\"2328\">@Rein Zustand</span> raised for zulip-terminal in the context of autohide mode (so can't see the left panel) is to show the unread total in the narrow header. Using autohide mode I've also thought of this before; while this is potentially ZT-specific, has a design of having an unread count in the current narrow been considered previously?</p>",
        "id": 1243149,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1628016356
    },
    {
        "content": "<p>A ZT-specific solution is to put the unread counts in the</p>\n<div class=\"codehilite\"><pre><span></span><code>30\n&lt;\nS\nT\nR\nE\nA\nM\n.\n.\n.\n&lt;\n</code></pre></div>\n<p>area. At least for the total unread counts, not just for current narrow. The goal is to know if there are new unreads right away.</p>",
        "id": 1243493,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1628059878
    },
    {
        "content": "<p>This problem with this is large numbers won't fit and it may not look good to widen the tab to just fit the number. (This also wastes horizontal space)</p>",
        "id": 1244940,
        "sender_full_name": "Sai Rohitth Chiluka",
        "timestamp": 1628310665
    },
    {
        "content": "<p>Maybe displaying it in the footer or the current recipient bar would be better?</p>",
        "id": 1244942,
        "sender_full_name": "Sai Rohitth Chiluka",
        "timestamp": 1628310741
    },
    {
        "content": "<p>I'm not sure the web app has this issue, as the left panel doesn't get hidden, except maybe on very narrow windows - and then it has a number icon on the 'burger'?<br>\nHowever, the narrow-unreads is still an open issue for both clients, which was my original point.</p>",
        "id": 1244952,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1628318821
    },
    {
        "content": "<p>Not a problem with the width. When the number is large, you are basically in \"catching up\" mode, and so the number doesn't matter anyway until it becomes sufficiently small. The important use case is to be notified of new unreads once you have caught up.</p>",
        "id": 1244966,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1628326658
    },
    {
        "content": "<p>When the number is large, just show <code>2k</code> for 2000-ish unreads.</p>",
        "id": 1244975,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1628328705
    }
]