[
    {
        "content": "<p>Thoughts on allowing organizations to customize the login/signin pages according to their brand by choosing a background image of their choice?<br>\n<a href=\"/user_uploads/2/1f/diQeia7ABy3V_4vDf7B-Y-NK/Screenshot-from-2017-08-16-03.26.03.png\" target=\"_blank\" title=\"Screenshot-from-2017-08-16-03.26.03.png\">Screenshot-from-2017-08-16-03.26.03.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/1f/diQeia7ABy3V_4vDf7B-Y-NK/Screenshot-from-2017-08-16-03.26.03.png\" target=\"_blank\" title=\"Screenshot-from-2017-08-16-03.26.03.png\"><img src=\"/user_uploads/2/1f/diQeia7ABy3V_4vDf7B-Y-NK/Screenshot-from-2017-08-16-03.26.03.png\"></a></div>",
        "id": 268112,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1502834235
    },
    {
        "content": "<p>Looks pretty cool.  <span class=\"user-mention\" data-user-email=\"brock@zulipchat.com\" data-user-id=\"136\">@Brock Whittaker</span> <span class=\"user-mention\" data-user-email=\"rishig@zulipchat.com\" data-user-id=\"131\">@Rishi Gupta</span> what do you think?</p>",
        "id": 268119,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1502837081
    },
    {
        "content": "<p>My main uncertainty is whether this is something folks would actually use; many organizations don't have a pretty image of that size associated with them.</p>",
        "id": 268120,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1502837104
    },
    {
        "content": "<p>It's probably a cool feature in some cases but I think it's particularly low value given that as Tim said, I don't think most orgs have a bg-friendly image associated with them. I think it also serves to clutter interface visually in an unpredictable way – given that people can upload whatever image they want to.</p>\n<p>We would then have to worry about things like enforcing min-size or quality so we aren't stretching 100px photos. I just don't think it's worth implementing.</p>",
        "id": 268127,
        "sender_full_name": "Brock Whittaker",
        "timestamp": 1502837230
    },
    {
        "content": "<p>I think I am more on the pro side; I think orgs like the recurse center, etc would have the resources to do a good job, and it could feel pretty high value to have a strongly branded \"landing\" page. </p>\n<p>That being said, I agree that it could be a fair amount of work to make it generically look good.</p>",
        "id": 268131,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1502837708
    },
    {
        "content": "<p>For things like this I think you can rely on admins to do mostly sensible things.  I feel like this is a feature that 95% of people would ignore but people who used it would be really happy we did it.</p>",
        "id": 268134,
        "sender_full_name": "Steve Howell",
        "timestamp": 1502837893
    },
    {
        "content": "<p>I guess implementation-wise, it shouldn't be a lot of work if our file upload code paths are done properly.  I'm not sure it is, but maybe we should take the opportunity to look at refactoring to make adding this not hard, and then do it.</p>\n<p><span class=\"user-mention\" data-user-email=\"yo@vishnuks.com\" data-user-id=\"52\">@Vishnu Ks</span> can you open an issue for it?  Seems there's enough interest to at least make an issue :)</p>",
        "id": 268136,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1502837995
    },
    {
        "content": "<p>I was thinking the work would be in making the header and footer work (I assume we'd want the images to take up the whole page?)</p>",
        "id": 268137,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1502838062
    },
    {
        "content": "<p>additionally, we can provide a group of default public domain images (eg. from Pexels) that look professional &amp; have a nice colour variety for organisations that don't have a branded-bg to use!</p>",
        "id": 268604,
        "sender_full_name": "Vaida Plankyte",
        "timestamp": 1502875645
    }
]