[
    {
        "content": "<p>In this screenshot there is a four year break between messages that is not super clear:</p>\n<p><a href=\"/user_uploads/2/1d/MPllFMpFPQ6w2Q7WoaVQVcau/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/1d/MPllFMpFPQ6w2Q7WoaVQVcau/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/1d/MPllFMpFPQ6w2Q7WoaVQVcau/image.png\"></a></div>",
        "id": 1599342,
        "sender_full_name": "Steve Howell",
        "timestamp": 1687866676
    },
    {
        "content": "<p>The message sent by Tim on May 31 was sent this year (2023).</p>",
        "id": 1599343,
        "sender_full_name": "Steve Howell",
        "timestamp": 1687866733
    },
    {
        "content": "<p>See <a class=\"stream-topic\" data-stream-id=\"3\" href=\"/#narrow/stream/3-backend/topic/test-backend.20performance\">#backend &gt; test-backend performance</a></p>",
        "id": 1599344,
        "sender_full_name": "Steve Howell",
        "timestamp": 1687866747
    },
    {
        "content": "<p>Hmm, yeah, that is a potential flaw in our current algorithm for how to display dates -- we display the date this year without a year, and that would probably feel fine for a date like \"Yesterday\", but I can certainly imagine someone misinterpreting that \"May 31\" as \"May 31, 2019\".</p>",
        "id": 1599656,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1687891544
    },
    {
        "content": "<p>Let me move this thread to <a class=\"stream\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design\">#design</a>; I think that's probably a good place to discuss it. At a technical level, we certainly could make our logic always show the year if different from that of the previous date displayed, so that this would become \"May 31, 2023\", but another recipient bar for the next day would still say \"June 1\".</p>",
        "id": 1599657,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1687891604
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"9\" href=\"/#narrow/stream/9-issues/topic/year.20breaks\">#issues &gt; year breaks</a> by <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span>.</p>",
        "id": 1599660,
        "sender_full_name": "Notification Bot",
        "timestamp": 1687891639
    },
    {
        "content": "<p>I filed <strong>Show new year in date divider</strong> <a href=\"https://github.com/zulip/zulip/pull/26673\">#26673</a> for this. Do folks agree that we only need the year in date divider lines, not in message header bars?</p>",
        "id": 1637367,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1694214512
    },
    {
        "content": "<p>I think if we have a set of messages that's similar to the ones in the example above, but the newer messages happen to have their own message header bar instead of a date divider, it'd still be important to show the year for the same reason it's important in the date divider.</p>\n<p>That situation probably isn't quite as common, because if you have an interleaved view (so that it's possible to have multiple message header bars) then it's likely to be a higher-traffic view without such long gaps, and so if there's a year boundary then it's probably more like December to January and the reader won't be confused. But in principle it totally can happen.</p>\n<p>Perhaps one of the more likely ways is if there's a stream that goes unused for a year or two and then someone starts a new discussion there — then the stream narrow would fall into exactly this situation.</p>",
        "id": 1637420,
        "sender_full_name": "Greg Price",
        "timestamp": 1694217890
    },
    {
        "content": "<p>Yeah, I feel pretty pretty strongly that we should show the year whenever we're displaying a date that is in a different year than the current one, at least if there's also content in the current year on the screen.</p>\n<p>The clutter cost is pretty minimal -- except on January 3, almost all the dates that one looks at are in the current year. And it's very upsetting when you see \"June 27\" somewhere and start reasoning about the story there before discovering that actually it's \"June 27, 2021\".</p>\n<p>To be clear, we already show the year in message header bars -- the logic is that we show the year whenever it does not match the current year -- so I think there's nothing to change in <a href=\"https://github.com/zulip/zulip/pull/26673\">#26673</a> to achieve the desired behavior for that element.</p>",
        "id": 1637858,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1694392432
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/date.20display.20of.20year.20breaks/near/1637858\">said</a>:</p>\n<blockquote>\n<p>Yeah, I feel pretty pretty strongly that we should show the year whenever we're displaying a date that is in a different year than the current one, at least if there's also content in the current year on the screen.</p>\n</blockquote>\n<p>AFAIK we already do that. But this thread is about something more subtle — it's that we should show the year in certain circumstances when it is the current year, too.</p>",
        "id": 1638320,
        "sender_full_name": "Greg Price",
        "timestamp": 1694459702
    },
    {
        "content": "<p>Seems reasonable to me; I updated the issue accordingly.</p>",
        "id": 1640083,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1694651638
    },
    {
        "content": "<p>Reading the current issue description:</p>\n<blockquote>\n<p>Show the year in date dividers if it's different from the year of the previous date displayed.<br>\nShow the year in message header bars if it's different from the year of the previous date displayed.</p>\n</blockquote>\n<p>I think the message header bars already do this, so this would just be a change to the date dividers? Or am I missing something?</p>",
        "id": 1640104,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1694654170
    },
    {
        "content": "<p>The change is in both places to show the <em>current</em> year if it's different from the previous message.</p>",
        "id": 1642401,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695064031
    },
    {
        "content": "<p>I see, whereas currently we display that mainly on the \"previous year\" side. I think that's probably pretty low-cost to do -- and I think would be a nice improvement. Sorry for the confusion -- I would have found this discussion a lot easier to follow with examples/test cases as the format.</p>\n<p>Code-wise that part probably involves tweaking this interface to pass a <code>same_year(message_container, prev_message_container)</code> sort of thing down to <code>render_date</code>.</p>\n<div class=\"codehilite\"><pre><span></span><code>function update_group_date(group, message_container, prev) {\n    const time = new Date(message_container.msg.timestamp * 1000);\n    const today = new Date();\n\n    // Show the date in the recipient bar if the previous message was from a different day.\n    group.date_unchanged = same_day(message_container, prev);\n    group.group_date_html = timerender.render_date(time, today)[0].outerHTML;\n}\n</code></pre></div>",
        "id": 1642420,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695065065
    },
    {
        "content": "<p>Here are some concrete examples for today:</p>\n<div class=\"codehilite\"><pre><span></span><code>prev: Dec 31, 2021\ncur: Jan 1, 2022\n</code></pre></div>\n<div class=\"codehilite\"><pre><span></span><code>prev: Dec 31, 2021\ncur: Jan 1                           # current year, 2023\n</code></pre></div>\n<div class=\"codehilite\"><pre><span></span><code>prev: Jun 13, 2021\ncur: Jul 14                        # current year, 2023\n</code></pre></div>\n<p>And the latter two test cases would be changed to show the 2023 just because they are coming immediately after a year change.</p>",
        "id": 1642427,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695065244
    },
    {
        "content": "<p>I think it's mainly the <code>Jul 14</code> case that is confusing with the current UI and would be good to change -- because even if a user could figure out that Zulip always shows the year when it's different from the current, some other apps don't, and so a user might not feel safe in assuming that the <code>Jul 14</code> is not the same year as the previous message, even if they think about it.</p>\n<p>(And of course it's also very possible for someone to just be passively confused without thinking about it)</p>",
        "id": 1642428,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695065301
    }
]