[
    {
        "content": "<p>Currently we send our day1 email an hour after the user signs up. While I think I understand the motivation (let the user play around with stuff before they see the welcome email), I feel like that has a much higher chance of feeling like spam than if the email is more clearly transactional (sent as a part of the signup process, i.e. with no delay). </p>\n<p>Also, I think an hour is rarely the right time frame for re-engaging with a product. if I'm checking out a product, I'm usually giving it something like 10 minutes; by an hour later I'm on to something else.</p>",
        "id": 300673,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1508378124
    },
    {
        "content": "<p>dropbox paper sent me their four welcome emails on days: 0, 2, 5 ,7 (actually, wed, fri, mon, wed, which suggests an algorithm like \"add 2 days and round up to Monday if it's the weekend\"). I think that'd be a good algorithm for us as well?</p>",
        "id": 300676,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1508380611
    },
    {
        "content": "<p>Seems reasonable.</p>",
        "id": 300677,
        "sender_full_name": "Greg Price",
        "timestamp": 1508380779
    },
    {
        "content": "<p>Looking for other models, I searched my email for messages from Front -- they seem pretty good at this.</p>\n<p>It looks like they sent me just one timed email, a few days in -- a detailed pitch for the one feature they're really keen on convincing people to use (which is to connect their individual work inbox).</p>",
        "id": 300678,
        "sender_full_name": "Greg Price",
        "timestamp": 1508380843
    },
    {
        "content": "<p>But then they pretty often send announcements of new features -- like 1x/mo or more.</p>",
        "id": 300679,
        "sender_full_name": "Greg Price",
        "timestamp": 1508380876
    },
    {
        "content": "<p>good idea, thanks for the Front data. <br>\nMy current thought is that we should send three onboarding emails:</p>\n<ul>\n<li>Welcome: link to getting started guides, mobile and desktop apps, ideally a \"thanks for being a part of the zulip community\"</li>\n<li>Topics: getting the user to like/understand topics</li>\n<li>Keyboard shortcuts: another shot at teaching them n, r, End, etc</li>\n</ul>\n<p>And yeah, I've found the Front new feature announcements surprisingly useful.</p>",
        "id": 300680,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1508381448
    }
]