[
    {
        "content": "<p>I just opened <a href=\"https://github.com/zulip/zulip/pull/6377\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/6377\">#6377</a>, but realize I should have probably posted here first.<br>\nWe've gotten the request to be able to clear one's initial test messages several times now, from realm admins setting up their realm. <br>\nWhat would folks think of something in org settings that allows you to delete all your organization's messages?</p>",
        "id": 275889,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1504321225
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"rishig@zulipchat.com\" data-user-id=\"131\">@Rishi Gupta</span> I think that's fine, but we should limit it to realms with &lt;N messages, for some N~250, and if they have more than that, suggest they contact support to make sure they really mean it.</p>",
        "id": 279845,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1505226975
    },
    {
        "content": "<p>Just because I think we want it to be really hard to mass-delete everything.</p>",
        "id": 279846,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1505227009
    },
    {
        "content": "<p>We should be thoughtful about the specification: I think it should delete (using the same Archive approach we use for other message deletions, so one can recover if it happens accidentally) the messages sent by the human users; presumably we don't want to delete the bot messages.  and have a confirmation dialog.</p>",
        "id": 279848,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1505227084
    },
    {
        "content": "<p>agreed with all of those. By \"not delete bot messages\" I think you mean \"not delete system bot messages\"? If they set up a test integration presumably those messages should get deleted too.</p>",
        "id": 279974,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1505230380
    },
    {
        "content": "<p>Yeah.</p>",
        "id": 280009,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1505231548
    }
]