[
    {
        "content": "<p>How we do want to handle deleting a user group that where the group is used for a permission (See <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/New.20permissions.20model\">#design &gt; New permissions model</a> for background). This isn't a question we have to decide immediately, since all of our user-group based permissions only allow system groups as options for now, and those can't be deleted, but it'd be nice to have a decision on this so that we can write things in that direction and have minimal complexity when we start allowing non-system-groups.</p>",
        "id": 1569836,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1684197311
    },
    {
        "content": "<p>We have somewhat parallel prior art for deleting streams which are configured as, e.g. the announcement stream.</p>",
        "id": 1569879,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1684198724
    },
    {
        "content": "<p>Hm, I just tested the behavior, and it doesn't seem great. We just go ahead and delete the stream without letting the user know that announcements will be turned off.</p>",
        "id": 1569889,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1684199155
    },
    {
        "content": "<p>Yes, but importantly, <code>null</code> is a valid value for those, so <code>SET_NULL</code> is the correct behavior. Whereas I think for these group settings, we're using a special \"NOBODY\" user group (so it can use the same plumbing as the others around labels, etc.).</p>",
        "id": 1569890,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1684199174
    },
    {
        "content": "<p>Also we don't actually ever delete streams, we just archive them, so it's not quite parallel in terms of the implementation right now.</p>",
        "id": 1569891,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1684199217
    },
    {
        "content": "<p>It is possible that we don't want to delete user groups permanently either, and we just want to archive them when a user asks to delete them. But we'll get a lot more instances of this with user groups, including things like \"The group who can administer this stream or other group\" where it might be quite awkward to silently set that to \"nobody\".</p>",
        "id": 1569892,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1684199291
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/Deleting.20user.20groups/near/1569889\">said</a>:</p>\n<blockquote>\n<p>Hm, I just tested the behavior, and it doesn't seem great. We just go ahead and delete the stream without letting the user know that announcements will be turned off.</p>\n</blockquote>\n<p>I filed <strong>Warn when archiving a stream being used for announcements</strong> <a href=\"https://github.com/zulip/zulip/pull/25685\">#25685</a> for fixing this.</p>",
        "id": 1572894,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1684519715
    },
    {
        "content": "<p>We certainly shouldn't <em>silently</em> set permissions to \"nobody\".  I think the options to consider are warning vs. requiring the user to stop using the group for permissions before it can be deleted.</p>",
        "id": 1572897,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1684519855
    },
    {
        "content": "<p>I wonder if the user deleting the group will always have permissions to fix it, though? Maybe not if the group is being used for administering a private stream?</p>",
        "id": 1572903,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1684519910
    },
    {
        "content": "<p>I'm not sure; I'd generally expect a user deleting a group to be able to join the group and thus administer the private stream.</p>",
        "id": 1573318,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1684542833
    }
]