[
    {
        "content": "<p>Starting this conversation for two purposes. One, so that we can clarify the onboarding email process for demo organization owners/other invited users. Two, so that we can clarify any points for what needs to be taken into account for the demo organization creation process for users on the main zulip corporate pages.</p>",
        "id": 1644511,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1695303305
    },
    {
        "content": "<p>Just noting for easy access that the demo organization feature is tracked as <a href=\"https://github.com/zulip/zulip/pull/19523\">#19523</a>.</p>",
        "id": 1644512,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1695303315
    },
    {
        "content": "<p>For now, I'd like to focus on the first point. Currently, as demo organization owners don't set an email when the demo organization is created, the onboarding emails are never scheduled for them. When they have set an email and invite other users, then those users will have the regular onboarding emails scheduled when they join the demo organization, which could be less than ideal for any emails that rely on organization settings like the type of the organization as the demo organization owner may not have updated that setting.</p>",
        "id": 1644513,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1695303321
    },
    {
        "content": "<p>The current onboarding emails are:</p>\n<ul>\n<li>account_registered</li>\n<li>onboarding_zulip_topics</li>\n<li>onboarding_zulip_guide</li>\n</ul>",
        "id": 1644515,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1695303329
    },
    {
        "content": "<p><strong>account_registered</strong>:</p>\n<p>A version of the account_registered email could be sent / scheduled when they confirm their email and/or set their password. Currently, the account_registered email has a demo organization creation section, which will never currently be sent/scheduled:</p>\n<div class=\"codehilite\"><pre><span></span><code>{% if is_demo_organization %}\n&lt;p&gt;\n    {% trans demo_organizations_help_link=&quot;https://zulip.com/help/demo-organizations&quot; %}Congratulations, you have created a new Zulip demo organization. Note\n    that this organization will be automatically deleted in 30 days. Learn more\n    about demo organizations &lt;a\n    href=&quot;{{ demo_organizations_help_link }}&quot;&gt;here&lt;/a&gt;!\n    {% endtrans %}\n&lt;/p&gt;\n</code></pre></div>",
        "id": 1644518,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1695303338
    },
    {
        "content": "<p><strong>onboarding_zulip_topics</strong>:</p>\n<p>This email is scheduled if the user has no other accounts with the same email in other organizations on the server. Again, we could schedule this email, with the same restriction on non-duplicate users, for the demo organization owner when the confirm their email and/or set their password.</p>",
        "id": 1644519,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1695303350
    },
    {
        "content": "<p><strong>onboarding_zulip_guide</strong>:</p>\n<p>This email is currently always scheduled for new users of particular organization types.</p>\n<p>Currently, in the dev environment, demo organizations are set as with the organization type as 'Business'. If we set this to 'Undefined', then we could encourage the demo organization owner to set the organization's type before setting their email or before inviting other users.</p>",
        "id": 1644520,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1695303361
    },
    {
        "content": "<p>I'm a bit cautious of scheduling/rescheduling this email when they set the organization type in a demo organization. Since it's a sandbox environment, one could imagine someone clicking and updating settings just to test the UI experience at first and not really thinking about this being an organization they would want to keep.</p>",
        "id": 1644521,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1695303366
    },
    {
        "content": "<p>Alternatively to all the above, we could schedule some/all of the above emails for existing users when the demo organization is converted to a permanent organization as that would then imply that they wanted to keep the history there and that the demo organization wasn't just a sandbox to test/play with things before creating a new permanent organization. If we do that, then we would need to not schedule them for the users that the owner invites who join until the organization is converted.</p>",
        "id": 1644522,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1695303367
    },
    {
        "content": "<p>For getting the organization type configured, I would propose:</p>\n<ul>\n<li>Set org type for demo orgs to Undefined. This is conceptually correct, and if we want  certain experiences for Undefined orgs to match Business orgs, we can do that separately.</li>\n<li>Require org type when converting to a permanent organization; this is normally required when organizations sign up for Zulip Cloud. We should ask about it regardless of whether it's configured already -- as you noted, people might play with it for testing purposes.</li>\n<li>(maybe -- could be a follow-up if we decide to do it) In the spirit of <a href=\"https://github.com/zulip/zulip/pull/24262\">#24262</a>, add a banner to the invite modal encouraging admins to configure the org type when inviting users.</li>\n</ul>",
        "id": 1644880,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695323757
    },
    {
        "content": "<p>I think we don't need to send an <code>account_registered</code> email to org owners, but we we should probably add a confirmation email that they successfully configured their email? This confirmation email can convey any additional relevant info.</p>",
        "id": 1644888,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695324302
    },
    {
        "content": "<p>Maybe this is kind of equivalent, but I think most of the <code>account_registered</code> text won't really work, so it doesn't seem super helpful to reuse it.</p>",
        "id": 1644890,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695324635
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"21836\">Lauryn Menard</span> <a href=\"#narrow/stream/101-design/topic/demo.20organizations.3A.20onboarding.20flow/near/1644519\">said</a>:</p>\n<blockquote>\n<p><strong>onboarding_zulip_topics</strong>:</p>\n<p>This email is scheduled if the user has no other accounts with the same email in other organizations on the server. Again, we could schedule this email, with the same restriction on non-duplicate users, for the demo organization owner when the confirm their email and/or set their password.</p>\n</blockquote>\n<p>Yeah, scheduling this one when the owner confirms their email sounds good. It's quite helpful for a Zulip trial process.</p>",
        "id": 1644892,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695324706
    },
    {
        "content": "<p>I'm not sure what's best for the <strong>onboarding_zulip_guide</strong>. It would be great to get the info to users while they are trying out Zulip in a demo org.</p>",
        "id": 1644895,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695324921
    },
    {
        "content": "<p>I think in general it's simpler to just schedule emails in one place, when we get an email address.</p>",
        "id": 1645026,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695331300
    },
    {
        "content": "<p>After a further chat, <span class=\"user-mention silent\" data-user-id=\"21836\">Lauryn Menard</span> and I came up with the idea of adding an onboarding_zulip_guide email that works for orgs without a type configured, or with a type not directly covered by our set of guides. It will link to our list of use cases and case studies at <a href=\"https://zulip.com/use-cases/\">https://zulip.com/use-cases/</a>. This should be an improvement in general, as well as solving the problem for what to do with this email for demo orgs.</p>",
        "id": 1647484,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695754905
    },
    {
        "content": "<p>I filed <a href=\"https://github.com/zulip/zulip/pull/26868\">#26868</a> for this (assigned to <span class=\"user-mention silent\" data-user-id=\"21836\">Lauryn Menard</span> , since we should do this as part of the demo orgs project).</p>",
        "id": 1647485,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695754949
    }
]