[
    {
        "content": "<p>What would folks think of the ability to create a fast demo realm?<br>\nI'm imagining a button on /hello, or somewhere, that says \"Try it\"<br>\nClicking it creates an account with a made up username, subdomain, etc (like subdomain random-word-234534.server.tld, email <a href=\"mailto:noreply-134123@server.tld\" title=\"mailto:noreply-134123@server.tld\">noreply-134123@server.tld</a>, fake name, avatar, etc). <br>\nYou then get dumped right into our onboarding hotspot tutorial, where you get to see how the product looks, what we mean by threading, etc.</p>",
        "id": 306053,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1509210578
    },
    {
        "content": "<p>I like it!  Here's a variation on your idea:</p>\n<ul>\n<li>We set up a good newbie realm called <a href=\"http://newbie.zulip.org\" target=\"_blank\" title=\"http://newbie.zulip.org\">newbie.zulip.org</a> that has real streams and human babysitters.</li>\n<li>That realm has a special button to create-your-own realm.  You can only click this once, but when you do, it creates a demo realm with your actual email.  (Forget about the minor technical challenges here, such as duplicate emails.)</li>\n</ul>",
        "id": 306056,
        "sender_full_name": "Steve Howell",
        "timestamp": 1509211037
    },
    {
        "content": "<p>I basically want users to experience two situations:</p>\n<ul>\n<li>what does a functioning realm look like?</li>\n<li>how does the realm onboarding experience feel? (particularly useful for potential admins)</li>\n</ul>\n<p>It's probably also nice to have a little bit of gating before you get your own demo realm, just so we're not spinning up thousands of them when get slash-dotted.</p>",
        "id": 306064,
        "sender_full_name": "Steve Howell",
        "timestamp": 1509211602
    },
    {
        "content": "<p>This is  a great idea. I think one argument against using <code>newbie.zulip.org</code> is that users have to do registration to try Zulip which is a big barrier. Another reason is that the realm may get polluted with meaningless messages and topics won't be used properly which won't be a great way to demonstrate the power of Zulip. <br>\nI like more the idea of a realm created exclusively for each user with pre populated messages and we can keep sending artificial messages throughout the demo period. (a better version of our current zulip realm in environment).</p>",
        "id": 306084,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1509220386
    },
    {
        "content": "<p>Well, we could streamline registration for <code>newbie.zulip.org</code>.</p>",
        "id": 306085,
        "sender_full_name": "Steve Howell",
        "timestamp": 1509221631
    },
    {
        "content": "<p>Our problem right now is that <code>chat.zulip.org</code> is our only version of <code>newbie.zulip.org</code>, and there are contraints of <code>chat.zulip.org</code> that aren't necessarily relevant to newbies.  (It's only partially the purpose of this realm to welcome newcomers; our primary use case, helping to maintain the Zulip code base, isn't necessarily in line with most people evaluating the project.)</p>",
        "id": 306087,
        "sender_full_name": "Steve Howell",
        "timestamp": 1509221774
    },
    {
        "content": "<p>I think we can improve the experience of new comers a lore more by using default stream groups. When user registers for the first time they would be asked to choose what they are interested in. for eg</p>\n<ul>\n<li>Checking out Zulip</li>\n<li>Production Install</li>\n<li>Contribute to Zulip</li>\n<li>PyCon Sprint</li>\n<li>Feedback<br>\nThey would be only subscribed to the streams that they are interested in.</li>\n</ul>",
        "id": 306118,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1509231520
    },
    {
        "content": "<p>For people who are checking out Zulip, how is that scheme better than inviting the potential customers to a realm that’s specifically  tailored for their needs?</p>",
        "id": 306119,
        "sender_full_name": "Steve Howell",
        "timestamp": 1509231830
    },
    {
        "content": "<p>Isn’t it true that most people evaluating Zulip aren’t debugging a production install, aren’t contributing, aren’t sprinting, and, almost by definition, don’t have any feedback yet to give?  And even once they do have any of those concerns, what better way to help them to graduate than a newbie realm that we babysit and monitor?</p>",
        "id": 306120,
        "sender_full_name": "Steve Howell",
        "timestamp": 1509232182
    },
    {
        "content": "<p>I was just suggesting a method to improvise the new user experience of czo. If we can run a realm exclusive for newcomers and have enough people active to maintain that realm (from possible spamming from people testing zulip for the first time)  it's definitely a good idea :)</p>",
        "id": 306121,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1509232479
    },
    {
        "content": "<p>We're on the same page that the new default-stream features will make <a href=\"http://chat.zulip.org\" target=\"_blank\" title=\"http://chat.zulip.org\">chat.zulip.org</a> a more welcoming place for people who have the specific goal of evaluating Zulip.  So I'm on board with letting that experiment play out a bit.</p>\n<p>I'm a little concerned about the spin-up-new-realm feature trumping the go-to-healthy-realm-and-feel-how-great-a-well-functioning-Zulip-realm-is experience.</p>\n<p>But that's not to say I oppose the spin-up-new-realm experience.  I think it's a great idea, but I have concerns about dumping customers into it right away.  I'd rather have a funnel.</p>",
        "id": 306122,
        "sender_full_name": "Steve Howell",
        "timestamp": 1509233020
    }
]