[
    {
        "content": "<p>So, Alya and I recently had a conversation where we thought that making demo org registration a one-click process would be super cool. Alya pointed out in a comment on my PR <a href=\"https://github.com/zulip/zulip/pull/19741\">#19741</a> that this implies collecting a lot more information in the conversion dialog than just the subdomain. Here are some of the fields we may need to collect:</p>\n<ul>\n<li>Organization name - Currently the org name is the same as the demo randomly generated subdomain, so it makes sense to collect this upon conversion. If the user has already changed the org name, have the latest name as the placeholder.</li>\n<li>Org type - The default org type would be based on which page the user created the demo org from. If they signed up for a demo org from the For Education page, we would create a demo org with the education org type. This would leave room for further customization based on org type down the road.</li>\n<li>Organization URL - We have to have this, of course.</li>\n<li>The user's email, password, and full name. We need to think about the implications of creating a demo user for the demo org and then signing up that user for a regular account.</li>\n<li>ToS and newsletter subscription checkboxes?</li>\n</ul>\n<p>Would appreciate some feedback (general or specific). Thanks! :)</p>",
        "id": 1280347,
        "sender_full_name": "Eeshan Garg",
        "timestamp": 1636793003
    },
    {
        "content": "<p>What feedback are you looking for <span class=\"user-mention silent\" data-user-id=\"1833\">Eeshan Garg</span> ?</p>\n<p>I wonder if we should redirect the user to the org registration form rather than trying to rebuild it in-app?</p>",
        "id": 1282159,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1637021970
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/demo.20orgs.20realm.20conversion/near/1282159\">said</a>:</p>\n<blockquote>\n<p>What feedback are you looking for <span class=\"user-mention silent\" data-user-id=\"1833\">Eeshan Garg</span> ?</p>\n<p>I wonder if we should redirect the user to the org registration form rather than trying to rebuild it in-app?</p>\n</blockquote>\n<p>Haha, the last sentence in your message is exactly the kind of feedback I was looking for, so thank you! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> </p>\n<p>I do agree that this conversion dialog is getting too identical to our new org form. Also, in order to recreate this form in a dialog in org settings, we would need to add things like org types and other realm info to <code>page_params</code>, which is not ideal, in my opinion.</p>\n<p>I am in favor of either redirecting to the new org form and then modifying that code/copy to accommodate demo org conversion. Or, I would like to recreate that form separately and then use that for demo org conversion. <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> This is mostly an implementation detail, but the relative effort involved in accomplishing either is more or less the same.</p>",
        "id": 1282413,
        "sender_full_name": "Eeshan Garg",
        "timestamp": 1637072933
    },
    {
        "content": "<p>This does mean that most of my dialog work in <a href=\"https://github.com/zulip/zulip/pull/19741\">#19741</a> will get scrapped, but that's okay! I'm happy to get started once we are sure we want to go down the redirect route. :)</p>",
        "id": 1282414,
        "sender_full_name": "Eeshan Garg",
        "timestamp": 1637073165
    },
    {
        "content": "<p>Now that I think about it, I just think that converting a demo org <em>should</em> feel more like a sign-up flow than just a dialog flow.</p>",
        "id": 1282415,
        "sender_full_name": "Eeshan Garg",
        "timestamp": 1637074061
    },
    {
        "content": "<p>Yeah, we're letting you play with the app before doing the actual sign-up process.</p>",
        "id": 1282634,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1637103332
    },
    {
        "content": "<p>Ok that sounds good then, I'll get started updating the PR. Thanks! :)</p>",
        "id": 1282988,
        "sender_full_name": "Eeshan Garg",
        "timestamp": 1637149422
    }
]