[
    {
        "content": "<p>At present, we have the following algorithm for which topics to show in an open stream in the default view in the left sidebar:</p>\n<ol>\n<li>Selected topic</li>\n<li>The most recent 5 topics</li>\n<li>Older topics with unreads until we get to at most 8 topics total</li>\n</ol>\n<p>All muted topics are skipped unless they are selected.</p>",
        "id": 1442372,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1664407568
    },
    {
        "content": "<p>We currently have a UX issue where resolving a topic puts it at the top of the recent topics list, even though the user intent is likely to indicate that the topic is <em>not</em> important to pay attention to.</p>\n<p>Note that resolving a topic generates unread messages for topic participants but not for others.</p>",
        "id": 1442373,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1664407668
    },
    {
        "content": "<p>One easy to implement idea for making resolved topics less prominent is to exclude them from (2) recent topics, but not (3) unread topics. So they'd be likely to show up for participants only.</p>\n<p>Alternatively, we could treat resolved topics like muted topics for the purposes of being shown in the left sidebar, i.e., never show them there unless currently selected. But this would probably feel weird when the topic is generating an unread count?</p>",
        "id": 1442375,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1664407964
    },
    {
        "content": "<p>Thoughts? Other ideas for addressing this UX issue are welcome too!</p>",
        "id": 1442376,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1664407987
    },
    {
        "content": "<p>What if resolving topics only notified the stream updates topic?</p>",
        "id": 1445526,
        "sender_full_name": "Evy",
        "timestamp": 1665067936
    },
    {
        "content": "<p>Would it make sense to just auto-mute a resolved topic? If someone needs to notify individuals in the topic and continue the conversation you could have a prompt pop up asking if they want to \"unresolve\" the topic (such as when you notify all in a large stream and it asks you to confirm your intent).</p>",
        "id": 1445546,
        "sender_full_name": "SG",
        "timestamp": 1665073976
    },
    {
        "content": "<p>The system message on resolved topics could be rewritten to say something like \"[user] has marked this topic as resolved and has muted all future notifications for this thread.\" I think you might want to tag anyone who participated up to that point that the topic is resolved in case people were watching it.</p>",
        "id": 1445547,
        "sender_full_name": "SG",
        "timestamp": 1665074130
    },
    {
        "content": "<blockquote>\n<p>Would it make sense to just auto-mute a resolved topic? If someone needs to notify individuals in the topic and continue the conversation you could have a prompt pop up asking if they want to \"unresolve\" the topic (such as when you notify all in a large stream and it asks you to confirm your intent).</p>\n</blockquote>\n<p>We currently show this banner when composing to a resolved topic:</p>\n<p><a href=\"/user_uploads/2/93/D3SCTlogkWc0BA--L-SQ-7sv/Screen-Shot-2022-10-06-at-10.07.27-AM.png\">Screen-Shot-2022-10-06-at-10.07.27-AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/93/D3SCTlogkWc0BA--L-SQ-7sv/Screen-Shot-2022-10-06-at-10.07.27-AM.png\" title=\"Screen-Shot-2022-10-06-at-10.07.27-AM.png\"><img src=\"/user_uploads/2/93/D3SCTlogkWc0BA--L-SQ-7sv/Screen-Shot-2022-10-06-at-10.07.27-AM.png\"></a></div>",
        "id": 1445555,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1665076083
    },
    {
        "content": "<p>It's worth mentioning that there are lots of reasons one might want to reply to a resolved topic without unresolving it; a simple example would be just to thank someone who had done the work to resolve it, but you could also have a \"Should we also do x?\" question. I think an automatic muting sort of thing might not be ideal in that context.</p>",
        "id": 1445672,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1665084679
    },
    {
        "content": "<p>Knowing that a topic has been resolved can also be good to know, for example being aware of what helpdesk tickets have been resolved as they are fixed.</p>",
        "id": 1446173,
        "sender_full_name": "Evy",
        "timestamp": 1665163402
    },
    {
        "content": "<p>When you unpin a message in Slack or archive a channel, slackbot messages you directly about it, so it's in a different place. I don't really like that because it doesn't feel DM-worthy. I think that putting it in stream events is quite reasonable, and has the added bonus of being able to mute that topic if you don't care about that kind of thing.</p>",
        "id": 1446174,
        "sender_full_name": "Evy",
        "timestamp": 1665163447
    },
    {
        "content": "<p>Hm, I think we could potentially implement both of these ideas -- notifying the \"stream events\" topic instead of the topic itself when a topic is resolved/unresolved, and demoting resolved topics in the left sidebar.</p>\n<p>And both of these could be settings...</p>\n<ol>\n<li>\n<p>The most flexible version of the setting for where to send the \"resolve topic\" notification is a stream-level setting with an org-wide default.</p>\n</li>\n<li>\n<p>Whether to demote resolved topics could be a personal one (with an org-wide default for new users).</p>\n</li>\n</ol>",
        "id": 1493365,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674173187
    },
    {
        "content": "<p>Thoughts? I feel like folks' preferences on (1) could vary, which would argue for a setting. Not sure about (2).</p>",
        "id": 1493366,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674173358
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> has previously mentioned that he wants to be able to notice when a topic is resolved in most streams here, even if the topic is demoted for most users.</p>\n<p>And I think in general that need will apply for people who are responsible for overseeing how questions get taken care of. When the topic is resolved so that it won't be coming to people's attention in the future, one wants the opportunity to make a quick check that the discussion really does look like it was resolved.</p>",
        "id": 1493373,
        "sender_full_name": "Greg Price",
        "timestamp": 1674174903
    },
    {
        "content": "<p>The other thing to note is that the message that appears when a topic is resolved is part of how we make it easy to see on reading the topic that the topic is resolved, and when that happened -- we don't have an independent way to display that information.</p>",
        "id": 1502436,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675474624
    },
    {
        "content": "<p>One could imagine doing some sort of special banner thing; but I think conceptually the right way to think about that would in some sense be to have the \"This topic was marked as resolved\" message itself have a special rendering.</p>",
        "id": 1502439,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675474747
    },
    {
        "content": "<p>Hmm, maybe one could have a personal \"automatically mute resolved topics\" setting?</p>",
        "id": 1504575,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1675811420
    },
    {
        "content": "<p>What if we  sent a \"resolve topic\" notification both to a \"resolved topics\" topic <em>and</em> to the topic itself, but automatically marked the in-topic notification as read for everybody? That way, the information would still be in the topic, but it wouldn't unnecessarily bump the topic.</p>\n<p>Users who want to monitor when topics are resolved could do so via the \"resolved topics\" notifications, and others could just mute that topic.</p>",
        "id": 1576459,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1684992578
    },
    {
        "content": "<p>For recent topics we can have an <code>Unresolved</code> filter too like we are planning for <code>more topics</code>.</p>",
        "id": 1576672,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1685034557
    }
]