[
    {
        "content": "<p>The following is a follow-up to <a href=\"#narrow/stream/49-development-help/topic/micromodal.20multiple.20dialog.20flow/near/1279575\">this discussion in <a class=\"stream\" data-stream-id=\"49\" href=\"/#narrow/stream/49-development-help\">#development help</a></a>. This stream seemed like a more appropriate place for further discussion.</p>\n<p>In <a href=\"https://github.com/zulip/zulip/pull/19741\">#19741</a>, Alya suggested that we have a dialog where the user inputs the subdomain and once they click the submit button, we pop up a confirmation dialog that says \"this action is permanent and can't be undone\", etc. and then when the user submits that one is when the conversion happens. I have spent a bit of time on this now, and I am against this design for the following reasons:</p>\n<ul>\n<li>Tim is correct that the on-close handler might be a way to open the second dialog. However, I don't think that's a good design and complicates the code quite a bit. Not to mention, it seems like a very hacky way of accomplishing what should be a relatively simple dialog flow.</li>\n<li>For one, error handling would be a lot more complicated. Right now, the error is displayed in the org settings outside of the first dialog after the subdomain is submitted. If we choose to display the error inside the dialog itself, say the user submits an unavailable subdomain, we would need to add custom logic on the backend such that errors are displayed on the conversion dialog but if there are no errors, the confirmation dialog would pop-up for further confirmation before the actual conversion happens?</li>\n<li>Alya and I recently talked about making registration for demo orgs a one-click flow, which would mean that we need to collect the same info as we do on realm creation in <code>/new</code>. Having more fields with more error handling compounds the issues mentioned in the second bullet point even further.</li>\n</ul>\n<p>I think it would be much simpler if we just have the full dialog with a red banner at the end reminding the user that they are about to initiate a permanent conversion. Thoughts? <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> FYI :)</p>",
        "id": 1280344,
        "sender_full_name": "Eeshan Garg",
        "timestamp": 1636790967
    },
    {
        "content": "<p>I think we can continue this discussion in <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/demo.20orgs.20realm.20conversion\">#design &gt; demo orgs realm conversion</a> . :)</p>",
        "id": 1282172,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1637024027
    }
]