[
    {
        "content": "<p>There's a thoughtful issue up from a member of the Rust community, <a href=\"https://github.com/zulip/zulip/pull/26832\">#26832</a>, which includes some suggestions for the structure and styling of named links vs. linkifiers. Here are their core proposals:</p>\n<blockquote>\n<ul>\n<li>The ability to control the style on linkifier links (possibly even if it was one per all such links)</li>\n<li>The ability to add linkifier \"cooldowns\" so the same term isn't linkified twice in a single message or perhaps even single thread.</li>\n<li>Something else that serves the above need (the initial idea was a chatbot, but that requires connection overhead that may make it less appropriate, and hides the discoverability behind a command which itself may not inherently be that much more discoverable)</li>\n</ul>\n</blockquote>",
        "id": 1646600,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1695655757
    },
    {
        "content": "<p>Hm, interesting. I guess the core of the proposal in the issue is having different styling for regular links vs. automatically linkified links, with the idea that the regular named links are more intentional / more of a suggestion for the reader to click on them.</p>",
        "id": 1646658,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695665399
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/distinguishing.20linkifiers.20from.20named.20links/near/1646658\">said</a>:</p>\n<blockquote>\n<p>regular links vs. automatically linkified links, with the idea that the regular named links are more intentional / more of a suggestion for the reader to click on them.</p>\n</blockquote>\n<p>Interesting because that seems quite backward from the way I'm accustomed to linkifiers being used. For example in Karl's message above, the linkified <a href=\"https://github.com/zulip/zulip/pull/26832\">#26832</a> is the most important part of the message.</p>\n<p>Following the link, it seems like the context is that they tried adding linkifiers for a glossary of their community's internal jargon, so as to trigger when the words were just used in conversation. That is indeed a quite different use case.</p>",
        "id": 1646661,
        "sender_full_name": "Greg Price",
        "timestamp": 1695665695
    },
    {
        "content": "<p>That's my understanding, too. What's interesting is the sort of community-instruction angle: they're doing this with glossary terms, it seems, and they want the distinction to help new members understand how to properly reference those terms (as well as being able to update where the linkified terms point more gracefully).</p>",
        "id": 1646662,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1695665738
    },
    {
        "content": "<p>Oh and the title the person gave to the issue in our tracker frames it that way, too:</p>\n<blockquote>\n<p>Making \"linkifier\" usable for glosses alongside Markdown mavens?</p>\n</blockquote>",
        "id": 1646663,
        "sender_full_name": "Greg Price",
        "timestamp": 1695665739
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> <a href=\"#narrow/stream/101-design/topic/distinguishing.20linkifiers.20from.20named.20links/near/1646661\">said</a> in part:</p>\n<blockquote>\n<p>Interesting because that seems quite backward from the way I'm accustomed to linkifiers being used. For example in Karl's message above, the linkified <a href=\"https://github.com/zulip/zulip/pull/26832\">#26832</a> is the most important part of the message.</p>\n</blockquote>\n<p>Yeah. I'm more compelled by the distinction between links than I am going for any kind of implied/enforced subtlety, as you capture perfectly here, Greg.</p>",
        "id": 1646664,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1695665841
    },
    {
        "content": "<p>I feel like this glossary use case is not what linkifiers are intended for and probably it would be better to think about another feature for that problem statement.</p>",
        "id": 1646726,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695668196
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/distinguishing.20linkifiers.20from.20named.20links/near/1646726\">said</a>:</p>\n<blockquote>\n<p>I feel like this glossary use case is not what linkifiers are intended for and probably it would be better to think about another feature for that problem statement.</p>\n</blockquote>\n<p>I don't disagree necessarily but like whatchagonnado otherwise? the problem is one of discoverability.</p>",
        "id": 1646753,
        "sender_full_name": "Jubilee",
        "timestamp": 1695669581
    },
    {
        "content": "<p>only a solution that is pervasive requires 0 discoverability.</p>",
        "id": 1646754,
        "sender_full_name": "Jubilee",
        "timestamp": 1695669634
    },
    {
        "content": "<p>and our community (all communities, really, but I digress) already suffers from \"there's documentation to handle this, but nobody reads it lol, and because everyone 'knows' that nobody reads it, people rarely update it either\".</p>",
        "id": 1646757,
        "sender_full_name": "Jubilee",
        "timestamp": 1695669687
    },
    {
        "content": "<p>Yeah, I get the problem statement; just am thinking about whether there's something other solution that would help.</p>\n<p>Somewhat adjacent that I've been wanting to do for a while is a \"saved replies\" feature like what GitHub has, that would make it far easier to send a message linking to the glossary (or other resource!) with very low overhead. I feel like I would use that pretty often with phrases linking to various onboarding/new user docs.</p>",
        "id": 1646769,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695670099
    },
    {
        "content": "<p>One could a native glossary feature -- that allows an organization to configure certain words to be enclosed in an on-hover link to a configured URL, maybe controlled by a link so a heavy user could disable it as distracting.</p>\n<p>I haven't thought through how generally useful or popular that would be... it also might just be a variant of a linkifier that had basically \"very low touch\" styling that can be turned off altogether?  Not sure, just brainstorming here.</p>",
        "id": 1646773,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695670232
    },
    {
        "content": "<p>Thinking out loud, my primary things I would want glossary'd here on CZO are the <a href=\"https://zulip.com/development-community/#community-norms\">community guidelines</a> and description of <a href=\"https://zulip.com/help/code-blocks\">code blocks</a>. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 1646777,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1695670320
    },
    {
        "content": "<blockquote>\n<p>One could a native glossary feature -- that allows an organization to configure certain words to be enclosed in an on-hover link to a configured URL, maybe controlled by a link so a heavy user could disable it as distracting.</p>\n</blockquote>\n<p>Hm, maybe... I feel like an interaction I've seen elsewhere (Kindle?)  for looking up words is highlight -&gt; right click, which is uninvasive if you aren't looking for it.</p>",
        "id": 1646847,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695672022
    }
]