[
    {
        "content": "<p>I've been thinking about our UX and our messaging model in terms of how easy it is to moderate large groups of users (&gt;1000) actively talking to each other.</p>\n<p>The context is that I've been made a mod in a small discord server (and so I'm seeing the interface and experience) and I'm also a member of a different, active server with thousands of users that kinda struggles with moderation. The big community tends to attract somewhat toxic people at times and the moderation strategy is basically \"well if you go into the more risky channels, you might not get help immediately\" but there are lower traffic channels that are moderated <em>heavily</em>.</p>\n<p>However, I understand that our user base involves more trust than \"random trolls on the internet\" ie we cater more to businesses / companies / open source communities than hobbyist groups and fan-base communities. This is a pretty strong assumption to the Zulip interface and experience... but then I wonder if we'll be questioning it more in the future... for example consider the change of going from an always public email to hidden email setting. I wonder if there's more <em>optional</em> controls that we could add to cater to more people's needs... and if there's more core changes that we could make which would be convenient for users from any kind of userbase. Which brings this topic back to the \"moderator user experience\".</p>\n<p>In general, I think our messaging model would make the experience easier than other places, because it's simpler to go into a topic and say \"this entire topic should go over there\" than to say \"hey guys, this conversation you're having should go into that channel\". Moving topics is a v. big improvement from this perspective.</p>\n<p>Interesting to think about <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span>.</p>",
        "id": 842506,
        "sender_full_name": "Yash RE",
        "timestamp": 1585387156
    },
    {
        "content": "<p>(but this is mostly rambling so feel free to disregard)</p>",
        "id": 842507,
        "sender_full_name": "Yash RE",
        "timestamp": 1585387190
    },
    {
        "content": "<p>Ease of moderation is definitely an issue we think about a lot.</p>",
        "id": 843224,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1585507063
    },
    {
        "content": "<p>In my view the topics model helps a lot with moderation, in that it makes it a lot easier for a moderator to make sure they've seen every conversation, and also to be able to respond to something that happened while they weren't online.</p>",
        "id": 843225,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1585507101
    },
    {
        "content": "<p>We have a bunch of projects planned for this summer with the goal of improving moderation; <a href=\"https://zulipchat.com/help/moderating-open-organizations\" title=\"https://zulipchat.com/help/moderating-open-organizations\">https://zulipchat.com/help/moderating-open-organizations</a> mentions many of the things we support today and others we plan to add.</p>",
        "id": 843226,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1585507201
    },
    {
        "content": "<p>I do think there are big differences between different types of communities in terms of how much risk they have of having many toxic people join, and thus how much work moderation is.</p>",
        "id": 843227,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1585507396
    },
    {
        "content": "<p>But open source communities are a space where moderation can be really important, and so I definitely consider features in that area to be a high priority for us.</p>",
        "id": 843229,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1585507455
    }
]