[
    {
        "content": "<p>Our team has quickly grown to love (and depend on!) Zulip.  However, one request that comes up often is the ability, on the desktop/web app, to select multiple messages in a topic and bulk re-allocate them to another topic (and/or another stream).</p>\n<p>If we understand the Zulip paradigm correctly, then re-allocation of messages between topics is something that should be happening on a not-infrequent basis.  For example, you're having a conversation on one topic but then realise that something that has been said mid-conversation deserves its own topic.  However, at the moment you either have to re-allocate message-by-message - which quickly gets fiddly and repetitious - or you have to re-allocate all messages in the topic (falling either (i) before and after the selected message, or (ii) after the selected message).</p>\n<p>The ability to hold down, e.g., the Command key and click-select multiple messages and then re-allocate all of those selected messages with one edit would be very powerful.  Perhaps, in the fullness of time, the ability to simply drag-drop those selected messages onto a new topic could even be introduced.</p>\n<p>I've had a search within this <a class=\"stream\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design\">#design</a>  stream, as well as a look at  the official documentation and couldn't find anything pertinent but apologies if this functionality exists but I've missed it.</p>",
        "id": 1202322,
        "sender_full_name": "Alex Claydon",
        "timestamp": 1623046104
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"20374\">@Alex Claydon</span> <a href=\"https://github.com/zulip/zulip/pull/14187\">#14187</a> is the issue you want to follow for this.</p>",
        "id": 1202332,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1623047481
    },
    {
        "content": "<p>I think if someone can prototype reasonable \"Shift+Click\" type frontend UI for selecting a set of messages that folks like, the rest of this feature is pretty straightforward, and it'd certainly be nice to have.</p>",
        "id": 1203284,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1623107768
    },
    {
        "content": "<p>Zulip has Up and Down keyboard message navigation. Would it be easier to start a prototype using \"Shift+Up\" and \"Shift+Down\" to leverage the \"selectable_row\" class in the message table?</p>",
        "id": 1230712,
        "sender_full_name": "Andy Molenda",
        "timestamp": 1626234645
    }
]