[
    {
        "content": "<p>I think it is a good idea to think of emojis as purely 'text size' and 'standard set'. And stickers as anything that is custom and can be displayed larger. For non-professional chat apps, this is a huge feature. For Slack not so much.</p>",
        "id": 188454,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1492211273
    },
    {
        "content": "<p>Agreed that's the distinction between these; I'm curious why you're thinking about this?</p>",
        "id": 188459,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1492212152
    },
    {
        "content": "<p>Mostly to keep in mind the difference... for example, not sure what was the talk about 'custom emojis' that I read somewhere. But if it is something that has no alternative in the default emoji-set to not add them. I know that 'stickers' are simple problem from technical standpoint, and not so simple from the 'someone has to create these stickers' standpoint ;)</p>",
        "id": 188466,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1492213703
    },
    {
        "content": "<p>It might be interesting to have some sort of lightweight, non-professional chat app that is part of the Zulip ecosystem, and it would just use the backend for transport.</p>",
        "id": 188467,
        "sender_full_name": "Steve Howell",
        "timestamp": 1492214420
    },
    {
        "content": "<p>A lot of people are still unfamiliar with the concept of \"office chat.\"  Most of those people aren't really our target customers, of course.</p>",
        "id": 188468,
        "sender_full_name": "Steve Howell",
        "timestamp": 1492214534
    },
    {
        "content": "<p>Also, maybe 'office chat' is not a strict definition. I imagine if BuzzFeed use Zulip internally, half of their communications to be a stickers :)</p>",
        "id": 188479,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1492215680
    },
    {
        "content": "<p>Yeah, I'd like a good way to describe Zulip in 5 words or less that doesn't involve either the words \"office\" or \"chat,\" since I don't think either really capture what it does.  I mean, yeah, it's chat, but it's not your typical chat.  And, like many people, I don't actually use it in an office.</p>",
        "id": 188491,
        "sender_full_name": "Steve Howell",
        "timestamp": 1492215973
    }
]