[
    {
        "content": "<p>The single most annoying feature of Zulip for this heavy user is that I cannot go a to a stream without Zulip making a message read in a topic that is randomly chosen (ok, I know it's the oldest unread message, but from the pov of my workflow it might as well be random). When I'm nearly up to date, that's ok, but as I fall behind, this gets gradually more problematic - especially if it's the last message in a topic</p>",
        "id": 645652,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537574667
    },
    {
        "content": "<p>the topic disappears while i haven't got mental space to deal with it</p>",
        "id": 645653,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537574691
    },
    {
        "content": "<p>I agree in that I don't think just narrowing to a stream should mark any messages as read.</p>",
        "id": 645658,
        "sender_full_name": "Jack Zhang",
        "timestamp": 1537575836
    },
    {
        "content": "<p>Often, I'll click on the a stream in the left sidebar just to check the unread counts of specific topics.</p>",
        "id": 645659,
        "sender_full_name": "Jack Zhang",
        "timestamp": 1537575879
    },
    {
        "content": "<p>Maybe a better design would be, when entering a narrow, to select the most recent read message instead? The exception to that would be streams and topics with only 1 message, but I think it makes sense to automatically mark the only message as read in those cases.</p>",
        "id": 645661,
        "sender_full_name": "Jack Zhang",
        "timestamp": 1537576589
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"123\">@Grahame Grieve</span> one approach the user can take is starring the message; and then reviewing starred messages to clear them out.  We have an in-development setting to support showing a count of starred messages (similar to unread) that may help with this (for things for the user to come back to).</p>",
        "id": 645669,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1537577582
    },
    {
        "content": "<p>I have the same annoyance. A few notes</p>\n<ul>\n<li>The <code>n</code> keyboard shortcut \"does the right thing\" for me</li>\n<li>I use ctr+s heavily to star and come back later</li>\n<li>Eventually we want to support a mobile-like view on the left sidebar, where we just show the unread streams and topics</li>\n</ul>",
        "id": 645671,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1537578229
    },
    {
        "content": "<p>I would not like to use star in this case; I use that for things I have to come back to and do something about</p>",
        "id": 645674,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537578523
    },
    {
        "content": "<p>maybe ctrl-u could mark something unread, and then I could get use to reflexively hitting ctrl-u all the time</p>",
        "id": 645678,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537578655
    },
    {
        "content": "<p>yeah, not a bad idea.</p>",
        "id": 645679,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1537578755
    },
    {
        "content": "<p>It's tricky to implement something like \"mark as unread\" correctly, since there's a lot of tricky questions around what happens when you continue interacting with the messages on screen that you just marked that way.</p>",
        "id": 645688,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1537580233
    },
    {
        "content": "<p>hm, yeah. If it's only 2x as hard to do the \"all unreads\" view in the left sidebar, we should just go for that.</p>",
        "id": 645690,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1537581009
    },
    {
        "content": "<p>I've brought this up before too; starring/unread is just a workaround, which already has uses or isn't implemented. This is a bit like in email clients, where looking \"in an email folder\" (~stream) is a little strange if it jumps to the next unread, rather than just the previous location in that folder. Thinking mostly of Thunderbird, but also for other clients too?</p>",
        "id": 649620,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1538603198
    },
    {
        "content": "<p>I liked <span class=\"user-mention\" data-user-id=\"2255\">@Jack Zhang</span> ‘s suggestion. Seems pretty elegant from a UX perspective.</p>",
        "id": 649627,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1538603616
    },
    {
        "content": "<p>Being forced into interleaved views has always been one of my top pet peeves with Zulip.  I agree with Jack/Neil/Graham/Armaan here that we should solve this. I liked our first attempt at fixing this but it got some pushback and it’s hard to change the status quo sometimes.</p>",
        "id": 649629,
        "sender_full_name": "Steve Howell",
        "timestamp": 1538603983
    },
    {
        "content": "<blockquote>\n<p>hm, yeah. If it's only 2x as hard to do the \"all unreads\" view in the left sidebar, we should just go for that.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> I'm not sure which thing is \"go for that\" here -- is it the \"all unreads\" concept or something else?</p>",
        "id": 649638,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1538607795
    },
    {
        "content": "<p>I think \"all unreads\" is a good concept in its own right, but I don't think it actually solves my particular problems related to this conversation (and I suspect others may agree).</p>",
        "id": 649645,
        "sender_full_name": "Steve Howell",
        "timestamp": 1538608164
    },
    {
        "content": "<p>For me the problem always happens on streams with unread messages with topics that I don't want to address yet.  So it's not really the sidebar, per se, that's causing me a problem, it's the going-into-the-stream from the sidebar that causes me problems.  But maybe I'm misunderstanding Rishi's solution here.</p>",
        "id": 649646,
        "sender_full_name": "Steve Howell",
        "timestamp": 1538608301
    },
    {
        "content": "<p>One of the things that's interesting about this problem is that it always happens at the worst time.  I'm generally able to keep up with Zulip traffic, so it's pretty rare that I have a backlog of unread messages.  But when I've been super busy, like during GCI Week One, when you're bombarded, the whole single-topic-at-a-time-with-clean-unread-counts paradigm falls down like a house of cards once you have to start jumping into interleaved views to deal with things in  real time.</p>",
        "id": 649647,
        "sender_full_name": "Steve Howell",
        "timestamp": 1538608500
    },
    {
        "content": "<p>Well, the idea of an \"all unreads\" view would be that it'd list all the stream/topic pairs, and you'd click directly on a topic, not a stream.</p>",
        "id": 649654,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1538609850
    },
    {
        "content": "<p>I agree it doesn't completely eliminate the problem, but I think it could potentially make it not show up in your default catching-up workflow.</p>",
        "id": 649655,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1538609895
    },
    {
        "content": "<p>For me, I think the problem has also been that I've wanted to see the (recent) topics in a stream, and review the 'recent' ones again to see if there was an update, but then it forcibly marks the next message read - which is not what I want. The 'unreads list' might work for that, but I'm not sure.</p>",
        "id": 649656,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1538610055
    },
    {
        "content": "<p>My impression is that the \"straightforward\" solution of starting at the first unread is technically non-trivial. It could be worth working on if it was the right long-term direction, but I think what the mobile app does is the right long term direction (nice job to mobile for figuring it out :)).</p>\n<p>Specifically, there are two modes:</p>\n<ul>\n<li>Catching up, where you are presented with a list of unread topics (organized by stream), not a list of streams. You click topic by topic (or use <code>n</code> or whatever), and are never forced to click on anything that lands you in an interleaved view. </li>\n<li>Everything else, for which you would use the webapp's current left sidebar</li>\n</ul>",
        "id": 649659,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1538610427
    },
    {
        "content": "<p>Love the idea of incorporating the mobile unread view on the web app. I think it’s fantastically efficient at what it does.</p>\n<p>Additionally having the ability to mark as unread seems to make sense but perhaps an alternative to “starring messages” could be to be able to save pointers to messages in a thread. So in the UI it would say something like read later and it would get saved to a read later list that would then take you to the message within the topic instead of changing the “read” stage of the message. That way it doesn’t mess with the complicated read logic.</p>",
        "id": 649666,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1538611750
    },
    {
        "content": "<p>This is a regular annoyance for me too. FWIW here are the two workarounds I commonly use (/cc <span class=\"user-mention\" data-user-id=\"123\">@Grahame Grieve</span> ):</p>\n<ul>\n<li>If there's a particular conversation I want to get to, I go to the search bar and type a query that begins with <code>stream:foo</code> or whatever. If I know the topic, this is pretty easy -- after <code>stream:foo</code> I just start typing the topic name and choose it from the autocomplete. If I don't, search still works well.</li>\n<li>If I just want to see recent topics with unreads, I go to the mobile app. <span class=\"emoji emoji-263a\" title=\"smile\">:smile:</span></li>\n</ul>",
        "id": 649779,
        "sender_full_name": "Greg Price",
        "timestamp": 1538630924
    },
    {
        "content": "<p>I think the first of these cases doesn't fit well in <span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> 's classification a few messages up. The conversation I want to get to may not have any unreads (sometimes I was just reading it a minute ago, and I want to refer back to something or follow up with a reply or whatever), but there may be a bunch of other unreads in the stream so if I go via the sidebar I have exactly the experience Grahame described.</p>",
        "id": 649785,
        "sender_full_name": "Greg Price",
        "timestamp": 1538631106
    },
    {
        "content": "<p>Interesting, and good to know.</p>",
        "id": 649788,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1538632474
    },
    {
        "content": "<blockquote>\n<p>I think the first of these cases doesn't fit well in <span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> 's classification a few messages up. The conversation I want to get to may not have any unreads (sometimes I was just reading it a minute ago, and I want to refer back to something or follow up with a reply or whatever), but there may be a bunch of other unreads in the stream so if I go via the sidebar I have exactly the experience Grahame described.</p>\n</blockquote>\n<p>Yeah, that's basically my use case, which <span class=\"user-mention\" data-user-id=\"2187\">@Greg Price</span> is articulating better.  To give it some color, when you're mentoring GCI you might have a stream where each student creates a topic for themselves.  If something happens outside of Zulip for Alice, you may want to go to that topic and provide some info, but you can't do that without accidentally reading messages for  other students.</p>",
        "id": 649843,
        "sender_full_name": "Steve Howell",
        "timestamp": 1538651567
    }
]