[
    {
        "content": "<p>When I close the keyboard help with the escape key, the modal doesn't close right away, and I sometimes think I mis-hit the key.  And then I hit it again, which dumps me into the interleaved home view, which is a jarring experience.  If you set aside the fact that escape key shouldn't be mapped to jarring experiences, then the root cause of this problem is that the modal doesn't close quickly.   It's due to the fade out animation, which appears very sluggish on my browser (Chrome on an old Mac).</p>",
        "id": 558685,
        "sender_full_name": "Steve Howell",
        "timestamp": 1523532089
    },
    {
        "content": "<p>So I'm wondering if we can re-visit some of our fade-out animations and either eliminate them or make them more quick.  I'm in the eliminate-them camp, since they're hard to get right, and they always have the tradeoff that they make an app look slow.</p>",
        "id": 558687,
        "sender_full_name": "Steve Howell",
        "timestamp": 1523532198
    },
    {
        "content": "<p>agreed.</p>",
        "id": 558777,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1523549911
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"58\">@Steve Howell</span> can you do a quick Chrome profile of doing that fade-out?  Also, what Chrome version?</p>",
        "id": 558784,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1523550270
    },
    {
        "content": "<p>I think old Chrome had a pretty serious perf bug (that affected the Electron app for a while as well) where the best reproducer was that fade-out operation.</p>",
        "id": 558785,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1523550304
    },
    {
        "content": "<p>(It took like 10-15x the time it should)</p>",
        "id": 558786,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1523550310
    },
    {
        "content": "<p>it's ancient: 49.0.2623.112 (64-bit)</p>",
        "id": 558818,
        "sender_full_name": "Steve Howell",
        "timestamp": 1523551297
    },
    {
        "content": "<p>Yeah, OK, that is one of the affected versions.</p>",
        "id": 558822,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1523551332
    }
]