[
    {
        "content": "<p>For front ends in general, would it be correct to say that message context (focus) is preserved where possible? Eg. such as using s/S/Esc. With entering 'a stream', there is no context, so some default (last message or next unread?) seems necessary.</p>\n<p>It doesn't seem to be preserved in the webapp with eg. selecting a PM -&gt; 'P', which feels like a bug?</p>\n<p>As you might expect, I'm thinking of this coming from a zulip-term angle; I posted something similar in <a class=\"stream\" data-stream-id=\"206\" href=\"/#narrow/stream/206-zulip-terminal\">#zulip-terminal</a> recently, but wondered if there was a standard behavior, or rather an 'ideal' behavior. I'm inclined towards 'keep focus on (ie. move focus to) selected message in new narrow, if have a selected message and message exists in new narrow'.</p>",
        "id": 777187,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1565215639
    },
    {
        "content": "<p>If the hotkey relates to the message you have focused, we keep it selected.</p>",
        "id": 777192,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1565216238
    },
    {
        "content": "<p>Like s/S, etc.</p>",
        "id": 777193,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1565216263
    },
    {
        "content": "<p>It's arguable what <code>P</code> should do; it does the same thing regardless of what message you have highlighted.</p>",
        "id": 777194,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1565216272
    },
    {
        "content": "<p>P will eventually be replaced with g+p in the webapp, if that helps. I.e. I think we can just make it do whatever clicking on \"Private messages\" (or the equilavent on z-t) would do</p>",
        "id": 777196,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1565217136
    },
    {
        "content": "<p>I think it is not that useful a shortcut in practice</p>",
        "id": 777197,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1565217148
    },
    {
        "content": "<p>Even if the key represents that click, shouldn't it maintain context if there is one? Or is that overcome by a desire to go to a 'general' message in that narrow? (unread/previous)</p>",
        "id": 777200,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1565217501
    },
    {
        "content": "<p>The same applies to streams - if a message is selected and I enter a stream (or topic) I wouldn't expect my location to jump around?</p>",
        "id": 777202,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1565217659
    },
    {
        "content": "<p>(if the selection is in that stream/topic)</p>",
        "id": 777205,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1565217683
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"2406\">@Neil Pilgrim</span> generally our model is we preserve the location only if you click on a message recipient bar header or use a hotkey, not if you click elsewhere.</p>",
        "id": 777206,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1565217700
    },
    {
        "content": "<p>If the user is (e.g.) clicking in the left sidebar, it's unlikely that the context of what message is selected is meaningful, and it's better to use our default behavior of sending the user to the first unread message in the narrow (or bottom if there are none)</p>",
        "id": 777207,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1565217749
    },
    {
        "content": "<p>Hmm. This might be colored by our lack of narrow memory, so 'undoing' (or redoing) a movement can be frustrating. So explicit feels better than this approach, given p/n give next unread, and another key could go to 'latest'</p>",
        "id": 777209,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1565218466
    },
    {
        "content": "<p>...with some nuances there, true.</p>",
        "id": 777210,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1565218492
    }
]