[
    {
        "content": "<p>We should probably have a feature to set name/discussion topic for group PMs. I am having trouble figuring out what is the topic of discussion of each group PMs and have to manually open them one by one to figure it out.</p>",
        "id": 197001,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1494083674
    },
    {
        "content": "<p>Yep, we've talked about adding topics to PMs.  (They can even be useful for 1:1 PM conversations in my opinion.)  I think there's an issue already open for this.</p>",
        "id": 197018,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494085108
    },
    {
        "content": "<p>To be clear I meant changing the name of the group discussion from participant a, participant b etc to a custom name.Topics would be also nice :)</p>",
        "id": 197019,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1494085194
    },
    {
        "content": "<p>Oh, interesting.  Basically you want a way to tag your group PMs as kind of a virtual stream.  (Incidentally, for some of these types of conversations, we should be encouraging folks to create a private stream.)</p>",
        "id": 197021,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494085264
    },
    {
        "content": "<p>+1 for having topics in PMs.</p>",
        "id": 197023,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1494085903
    },
    {
        "content": "<p>Yeah. I consider creating streams to be more formal than group pms. Most of the group PMs I am in consist of all most the same members and are casual talks. It's kind of difficult from the current UI to figure out what each groups are for. Sometimes the conversation I am looking for would not be present in the Group PMs list. Given private streams and group pms are used in almost equal proportions in our organization we should spend some effort to improve the current UI for group PMS. <br>\n<a href=\"/user_uploads/2/9b/IrrHOFhzntSGehzww9JZI2gD/Screenshot-from-2017-05-06-211748.png\" target=\"_blank\" title=\"Screenshot-from-2017-05-06-211748.png\">Screenshot-from-2017-05-06-211748.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/9b/IrrHOFhzntSGehzww9JZI2gD/Screenshot-from-2017-05-06-211748.png\" target=\"_blank\" title=\"Screenshot-from-2017-05-06-211748.png\"><img src=\"/user_uploads/2/9b/IrrHOFhzntSGehzww9JZI2gD/Screenshot-from-2017-05-06-211748.png\"></a></div>",
        "id": 197024,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1494085965
    },
    {
        "content": "<p>Maybe this isn't exactly what you're proposing, but you're inspiring me to like the idea that each person can tag the conversation to their own liking for these sort of spontaneous group PM conversations.  Now that I think about it, this idea has come up before in a slightly different context.  Let me find the ticket...</p>",
        "id": 197025,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494086268
    },
    {
        "content": "<p>Hmmm, I can't find the ticket, so maybe we just brainstormed ideas here.  What I would like is a way to see all of your recent conversations, which is useful in its own right, and then as part of that UI, you could star/pin the conversations you want to go back to and then also tag them with your own description as needed (particularly for PMs).</p>",
        "id": 197027,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494086546
    },
    {
        "content": "<p>Ah, here is a related issue: <a href=\"https://github.com/zulip/zulip/issues/4271\" target=\"_blank\" title=\"https://github.com/zulip/zulip/issues/4271\">https://github.com/zulip/zulip/issues/4271</a></p>",
        "id": 197028,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494086595
    },
    {
        "content": "<p>Missing this feature and trying to generalize each engagement as an abstract 'message to recipients' is great for 'developer thinking' but not that much for end-users.</p>",
        "id": 197030,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494087613
    },
    {
        "content": "<p>There is a semi-related issue for the mobile app that I recently opened:<br>\n<a href=\"https://github.com/zulip/zulip-mobile/issues/546\" target=\"_blank\" title=\"https://github.com/zulip/zulip-mobile/issues/546\">https://github.com/zulip/zulip-mobile/issues/546</a></p>",
        "id": 197031,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494087628
    },
    {
        "content": "<p>Anyone remembers what Windows Vista would have had as their main feature, and that was their biggest failure? I think it very closely matches one of the issues with Zulip messaging...</p>",
        "id": 197032,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494087689
    },
    {
        "content": "<p>They tried to create a database-instead-of-files. It made a lot of sense, but not to users.</p>",
        "id": 197033,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494087716
    },
    {
        "content": "<p>I'm not sure which suggestion you're criticizing here.</p>",
        "id": 197034,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494087752
    },
    {
        "content": "<p>When I chat with a person, I consider it a conversation one-on-one. (everyone does of course). That means it is perfectly acceptable if the UI changes a bit to reflect that...</p>",
        "id": 197035,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494087763
    },
    {
        "content": "<p>Meaning an aggregate like 'Home' vs 'Stream' vs 'Private' vs 'Group' can and likely should <strong>look</strong> different.</p>",
        "id": 197036,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494087792
    },
    {
        "content": "<p>I think you're reading too much into what I was saying.</p>",
        "id": 197037,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494087816
    },
    {
        "content": "<p>I am not cirticizing a suggestion, but the status quo :)</p>",
        "id": 197038,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494087825
    },
    {
        "content": "<p>Actually your suggestion needs to be even more bold.</p>",
        "id": 197039,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494087845
    },
    {
        "content": "<p>Oh, yeah, gotcha.  We're on the same page in terms of having more customized UIs for each type of mode.</p>",
        "id": 197040,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494087851
    },
    {
        "content": "<p>One a related note, I've always wanted a customized UI to start a new topic.  The current process feels very awkward and developer-ish to me, where you just fill in the topic field.</p>",
        "id": 197041,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494087906
    },
    {
        "content": "<p>And 1:1 conversations are usually quite different in nature from group conversations.</p>",
        "id": 197042,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494087932
    },
    {
        "content": "<p>Current issues I see are few:</p>\n<ul>\n<li>group messages are too 'robotic' in their formulation, they should be 'named'</li>\n<li>I can not add a person to a group message, if I do it is a different conversation</li>\n<li>creating the group conversation can be a chore</li>\n</ul>",
        "id": 197043,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494087943
    },
    {
        "content": "<p>The ideal group conversation is a blend between a private stream and the current group conversation</p>",
        "id": 197044,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494087979
    },
    {
        "content": "<p>We've always neglected the group-PM experience in Zulip's evolution.  It's kind of like the \"middle child\" that gets no attention.</p>",
        "id": 197045,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494088006
    },
    {
        "content": "<p>They need to be temporary and informal, vs what a private stream is right now.</p>",
        "id": 197046,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494088009
    },
    {
        "content": "<p>Yeah, I think <span class=\"user-mention\" data-user-email=\"yo@vishnuks.com\" data-user-id=\"52\">@Vishnu Ks</span> saw how we are using the group conversation to talk about the US trip and it isn't working very well.</p>",
        "id": 197047,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494088045
    },
    {
        "content": "<p>I think our stream/topic UI is pretty decent, because that's our bread and butter.  And our PM UI isn't too bad, because it's kind of hard to screw that up.  But our Group PM user interface always makes me sad.</p>",
        "id": 197048,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494088075
    },
    {
        "content": "<p>I currently have 3-4 very similar groups of chats, one including you Steve and the other 3 guys, one not including you but including them, and one including similar but not even sure what was the difference ;)</p>",
        "id": 197049,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494088092
    },
    {
        "content": "<p>Skype allows you to name a conversation whatever you want. This is ok, but not going far enough.<br>\nMost other chat apps do it the way I think is perfect, also they converge on the same idea, so I guess they also think this is best.</p>",
        "id": 197050,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494088160
    },
    {
        "content": "<p>Hahaha, yeah, and you'll notice that I didn't engage in the group PM conversation and tried to move it to a public stream. :)  Part of the reason for that was contextual, but it also reflects the clumsiness of the experience that you and Vishnu are correctly pointing out.</p>",
        "id": 197051,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494088161
    },
    {
        "content": "<p>Basically you 'create a group', give it a name and add people to it. But it is always intended as something temporary.</p>",
        "id": 197052,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494088185
    },
    {
        "content": "<p>Maybe the private stream concept can be enhanced and turned into a 'group chat'</p>",
        "id": 197053,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494088215
    },
    {
        "content": "<p>Yeah, from an internal perspective I basically consider those things a \"lightweight private stream.\"  I'm not saying that's how we should present it to the user, but that's really what it would amount to.</p>",
        "id": 197054,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494088240
    },
    {
        "content": "<p>Incidentally, while I like our streams re-design overall, I still find the create-stream flow kind of clumsy.  You have to go into Manage Streams, and then when you show your intention to create a stream, we cram it all into the right-hand-side pane.</p>",
        "id": 197055,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494088362
    },
    {
        "content": "<p>Have a look at <a href=\"https://discordapp.com\" target=\"_blank\" title=\"https://discordapp.com\">https://discordapp.com</a> if you haven't.</p>",
        "id": 197056,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494088416
    },
    {
        "content": "<p>They are actually targeting a very different group of people, yet the app is quite similar to Zulip. They do several things better.</p>",
        "id": 197057,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494088452
    },
    {
        "content": "<p>I'm not a big fan of the dark color scheme (which maybe you could change), but it seems nice in other ways.</p>",
        "id": 197058,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494088914
    },
    {
        "content": "<p>It is targeted towards games, that is why they have more 'audio' and other functions. I use it only for <a href=\"https://www.reactiflux.com/\" target=\"_blank\" title=\"https://www.reactiflux.com/\">https://www.reactiflux.com/</a></p>",
        "id": 197059,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494090054
    },
    {
        "content": "<p>The <code>What's new</code> screen is a really good thing to borrow</p>",
        "id": 197060,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494090080
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"showell@zulipchat.com\" data-user-id=\"58\">@Steve Howell</span> go to Settings &gt; Appearance &gt; Light</p>",
        "id": 197061,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494090309
    },
    {
        "content": "<p>The 'Add reaction' popup is quite good</p>",
        "id": 197062,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494090410
    },
    {
        "content": "<p>Hmm, also you can search for 'Zulip' inside Reactiflux. Interesting...</p>",
        "id": 197070,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494091215
    },
    {
        "content": "<p>Another issue I have faced is that there is no way to see the list of all people with which I had 1-1 private conversation with. I wanted to reply to a person who messaged me long time back but I unfortunately forgot his name. The only way I can find that conversation is by scrolling up through all the private conversations I had till I find the particular chat which I am interested in.</p>",
        "id": 197079,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1494093132
    },
    {
        "content": "<p>I also really like the design of discordapp.</p>\n<p>If it weren't a ton of work to design and build, I would love being able to pop out 1-on-1 and Group PMs, like gmail chat. Since often I'm chatting with someone semi-real-time, but also want to be reading/responding to other things in Zulip. (In terms of going even farther along the specialized UI for PMs direction.)</p>",
        "id": 197083,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1494094017
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"yo@vishnuks.com\" data-user-id=\"52\">@Vishnu Ks</span> we discussed with <span class=\"user-mention\" data-user-email=\"tabbott@zulipchat.com\" data-user-id=\"7\">@Tim Abbott</span> an API call that will return recent conversations that works differently than how it does right now. Now the app just asks for 1000 messages and if your chat is older, which is very likely, it will not get it listed. I suspect the new call will still be limited somewhat, but hopefully it will be able to give us much more chats. I would say ideally few months back.</p>",
        "id": 197091,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494095147
    },
    {
        "content": "<p>I added a recent-conversations sprint to our list of PyCon sprints.  One thing to note is that we do now have an API that can get all the recent topics for a particular stream, but we haven't incorporated it in the front end yet.  This API doesn't solve the problem that we're discussing here, but it might be useful to look at.</p>",
        "id": 197145,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494167152
    },
    {
        "content": "<p>We'll need to decide the semantics of recent conversations, too.  There are two major possibilities that come to mind for me:</p>\n<ul>\n<li>Track recent conversations where you have been a recipient, and order those by how recently each thread's most recent message arrived.</li>\n<li>Track recent conversations by which conversations you narrowed to in the sidebar, and figure out the semantics for home-view users that makes sense.</li>\n</ul>\n<p>The latter approach would personally make more sense to me as a user, but it would require a bit of work for us to persist your searches.</p>",
        "id": 197146,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494167305
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"showell@zulipchat.com\" data-user-id=\"58\">@Steve Howell</span> it is not clear to me what the 2nd option is.</p>",
        "id": 197162,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494182838
    },
    {
        "content": "<p>Let's say that I narrow to:</p>\n<ul>\n<li>announce</li>\n<li>checkins</li>\n<li>design/logo</li>\n<li>PMs w/Boris</li>\n</ul>\n<p>One approach to recent-conversations would show me a link to all those conversations, and I could click to re-narrow to them.</p>",
        "id": 197167,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494184024
    },
    {
        "content": "<p>I think conceptually, we probably want \"name this group PM thread\" to actually be \"create a private stream with this group of people, and possibly this message history\".  </p>\n<p>The main thing that is really tricky from a UI perspective is how to handle the moving-history side of it, since you can imagine that a set of 3 people might have a wide range of different things they talk about, and not really intend their argument about whether to let Fred join their trip go into the trip planning thread which they then add Fred to (or whatever).</p>",
        "id": 197367,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1494266612
    },
    {
        "content": "<p>So there needs to be some mechanism for controlling what subset of the potentially thousands of messages of history with a set of people go into the new stream</p>",
        "id": 197369,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1494266640
    },
    {
        "content": "<p>+1 to \"name this group PM thread\" to just be a light-feeling way to create a private stream. I think a binary \"keep/don't keep all history\" option would cover a large majority of the cases, especially if (as future work) our search or narrow operator became smart enough to make it seamless (e.g. if searching for stream:the-new-private-stream would also search the Group PM it was based off of).</p>",
        "id": 197384,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1494266862
    },
    {
        "content": "<p>Since there seems to be some consensus on making this basically be create-a-lightweight-private-stream, I'll repeat something earlier in the discussion, which is that creating streams should be more lightweight in general (with some caveats that public streams should have some checks/balances for newbies).</p>",
        "id": 197395,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494267153
    },
    {
        "content": "<p>I also +1 the \"name this group PM thread\" thing.<br>\nIf topics are added to PMs, some topics could be selected to be taken for the history of the new stream. And as the topic of a message can be changed, it would be possible to choose which messages to take.</p>",
        "id": 197404,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1494267881
    },
    {
        "content": "<p>Yeah, that's a good thought.</p>",
        "id": 197405,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1494267960
    },
    {
        "content": "<p>Another advantage to the lightweight-stream approach that may not have been mentioned yet is that if the group-PM conversation stops being interesting to you, you can unsubscribe or mute.</p>",
        "id": 197407,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494268024
    },
    {
        "content": "<p>Yeah.  There will also likely be some follow-up things coming out of this, like we may need to make it easy to garbage-collect private streams if this becomes a common flow.  But we can deal with those once we have the feature.  </p>\n<p>I bet there's a version of working on this that could be a good PyCon project.</p>",
        "id": 197409,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1494268159
    },
    {
        "content": "<p>'named group chat' should conceptually be treated as group chat... meaning in the list with private messages</p>",
        "id": 197425,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494272100
    },
    {
        "content": "<p>'Named group PMs' and 'private streams' are very similar concepts. How do you choose one over the other then?</p>",
        "id": 197426,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1494272715
    },
    {
        "content": "<p>That's a good point <span class=\"user-mention\" data-user-email=\"Shayan.To@hotmail.com\" data-user-id=\"1073\">@Shayan Toqraee</span></p>",
        "id": 197427,
        "sender_full_name": "Joshua Pan",
        "timestamp": 1494272772
    },
    {
        "content": "<p>I guess like 'private streams' have a reason behind them, focused on one thing. 'named group PMs' are just informal chats that happen– usually not focused on only one thing</p>",
        "id": 197428,
        "sender_full_name": "Joshua Pan",
        "timestamp": 1494272858
    },
    {
        "content": "<p>'Named group PMs' is more like what Skype does. Other chats like FB Messenger and WhatsApp do it very officially under the name 'Groups'. They are temporary...</p>",
        "id": 197429,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494272914
    },
    {
        "content": "<p>Actually, the private streams tend to be temporary but don't necessarily act like it</p>",
        "id": 197430,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494272931
    },
    {
        "content": "<p>If there are topics, the 'just informal chats' can be organized as 'unnamed group PMs'. The named ones can be created then from some topics to make things more formal and more organized.</p>",
        "id": 197431,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1494273043
    },
    {
        "content": "<p>Another thing is, when I decide to create a group chat, this sounds very 'easy' and very non-commital. If I am asked to create a private stream, I am thinking 'do I really need a stream for that'.  That role is hinted a bit by the UI. I haven't created a single stream up till now. That is a good indicator how 'permanent' I think they are.</p>",
        "id": 197432,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1494273076
    },
    {
        "content": "<p>So comes the point <span class=\"user-mention\" data-user-email=\"showell@zulipchat.com\" data-user-id=\"58\">@Steve Howell</span> has pointed out a few times, creating streams is unnecessarily difficult.</p>",
        "id": 197433,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1494273196
    },
    {
        "content": "<p>And the fact that you cannot add or remove people to and from a group PM is very annoying.</p>",
        "id": 197435,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1494273264
    },
    {
        "content": "<p>When a discussion is organized enough that you want to add some more people to it, you can name it, and even promote it to be a public stream.</p>",
        "id": 197436,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1494273353
    },
    {
        "content": "<p>I think that in some sense the lowest hanging fruit here is an upgrade-to-private-stream option.  It would be nontrivial to implement, but I think it would be the least disruptive change for users.</p>",
        "id": 197460,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494288350
    },
    {
        "content": "<p>yeah, I think we can manage this somewhat by being thoughtful about what we name the feature.<br>\nSome private streams are very non-temporary; e.g. the group of engineering managers at a company would fit this role.  Others are temporary.  Others are intended to not be temporary but then end up that way :)</p>",
        "id": 197462,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1494288751
    },
    {
        "content": "<p>Let's do the promote-to-private-stream thing and then go from there.</p>",
        "id": 197463,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1494288770
    },
    {
        "content": "<p>You mean implementing the promote-to-private-stream thing? I think it is not that useful without PM topics. <span class=\"user-mention\" data-user-email=\"tabbott@zulipchat.com\" data-user-id=\"7\">@Tim Abbott</span></p>",
        "id": 197504,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1494317540
    },
    {
        "content": "<p>Hmmm, <span class=\"user-mention\" data-user-email=\"Shayan.To@hotmail.com\" data-user-id=\"1073\">@Shayan Toqraee</span> makes an interesting point...maybe PM topics should come first here.</p>",
        "id": 197537,
        "sender_full_name": "Steve Howell",
        "timestamp": 1494338153
    },
    {
        "content": "<p>as an example for group PM being difficult to use: we have <em>only</em> a total of 10k messages on our production server (not everyone uses it yet, maybe I push it with Zulip 1.6 again and Electron app working) but only 0.86% are in group PMs... Here at <a href=\"http://chat.zulip.org\" target=\"_blank\" title=\"http://chat.zulip.org\">chat.zulip.org</a> it's 5.5 % of all msgs. because I guess there are more 'developer minds' here.</p>",
        "id": 197539,
        "sender_full_name": "Matthias",
        "timestamp": 1494339284
    },
    {
        "content": "<p>Do we just want to put group PMs at the top of the user list?  I don't think that would be super hard.</p>",
        "id": 700721,
        "sender_full_name": "Steve Howell",
        "timestamp": 1550188205
    },
    {
        "content": "<p>probably a day or two's work after fiddling with resize code, user search, etc.</p>",
        "id": 700722,
        "sender_full_name": "Steve Howell",
        "timestamp": 1550188305
    },
    {
        "content": "<p>interesting thought. Does mixing them look bad?</p>",
        "id": 700723,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1550188335
    },
    {
        "content": "<p>I don't think so.  (haven't actually prototyped it, but pretty easy to imagine what it'd look like)</p>",
        "id": 700724,
        "sender_full_name": "Steve Howell",
        "timestamp": 1550188364
    },
    {
        "content": "<p>I can imagine just using the ordering we use in Private messages now</p>",
        "id": 700725,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1550188408
    },
    {
        "content": "<p>I think on the right sidebar there's benefit to just keeping users in alpha order.  So I'd probably just put group PMs above single users.</p>",
        "id": 700726,
        "sender_full_name": "Steve Howell",
        "timestamp": 1550188469
    },
    {
        "content": "<p>yeah, agreed</p>",
        "id": 700727,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1550188493
    }
]