[
    {
        "content": "<p>Hi Everyone! I've been reading and working on Zulip's react native codebase for almost 3 weeks now, I've created issues interacted with the community and opened PRs. I wish to apply for GSoC. I come from a design background and have noticed that Zulip's mobile app can use some design refinements. Do you think improving Zulip's App's UI/UX/Animations + Making the code self documenting  (adding descriptive comments which are currently missing) would make a good GSoC proposal?</p>",
        "id": 172375,
        "sender_full_name": "Nash Vail",
        "timestamp": 1489766999
    },
    {
        "content": "<p>That sounds good to me.  Are there particular parts of the codebase that you think could benefit from more comments?</p>",
        "id": 172383,
        "sender_full_name": "Steve Howell",
        "timestamp": 1489767356
    },
    {
        "content": "<p>I believe in having well document code in general. While starting out I found parts like \"narrow\" confusing, because it's a Zulip term afaik, if it was mentioned somewhere in the code what a narrow is and how the isNarrow method works, it would've been helpful. Moreover a component's name isn't always enough of a descriptor, for example reading MessageBrief and MessageFull gave me a completely different idea than what it really is. Describing wherever possible each component's place in the UI and what it does will be super helpful. We can use JSDoc comments and generate documentation from a single command.</p>",
        "id": 172507,
        "sender_full_name": "Nash Vail",
        "timestamp": 1489771123
    },
    {
        "content": "<p>What I've seen from experience is that comments get stale way too fast. Best effort-to-value ratio to me looks to be 'comments only on tricky parts + high level documentation + refactoring where names are not clear'</p>",
        "id": 172516,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1489771215
    },
    {
        "content": "<p>About the design part, <span class=\"user-mention\" data-user-email=\"nishantve1@gmail.com\" data-user-id=\"1730\">@Nash Vail</span> that is always a mid-effort, high-benefit part and I am often a fan of polishing visuals ;)</p>",
        "id": 172531,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1489771478
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"borisyankov@gmail.com\" data-user-id=\"284\">@Boris Yankov</span> 100% agree that comments get stale way too fast. Isn't there a way somewhere in the middle to economize effort-to-value ratio and still keep codebase friendly for beginners?  I think 'comments only on tricky parts + high level documentation + refactoring where names are not clear' looks like a good way to go and benefits intermediate-experienced developers but kind of leaves beginners out of the equation, don't you think? In my opinion we can improve our developer guide (<a href=\"https://github.com/zulip/zulip-mobile/blob/master/docs/developer-guide.md\" target=\"_blank\" title=\"https://github.com/zulip/zulip-mobile/blob/master/docs/developer-guide.md\">https://github.com/zulip/zulip-mobile/blob/master/docs/developer-guide.md</a>) to include more information and examples, that should be helpful.</p>",
        "id": 172546,
        "sender_full_name": "Nash Vail",
        "timestamp": 1489771945
    },
    {
        "content": "<p>I would like to have more high-level comments at the top of modules.  I think these types of comments can he helpful to beginners with less danger of going stale.</p>",
        "id": 172563,
        "sender_full_name": "Steve Howell",
        "timestamp": 1489772403
    },
    {
        "content": "<p>Yeah, definitely the documentation. I would try to add a lot, but anyone can give it a shot, and I will polish or fix stuff if not correct</p>",
        "id": 172565,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1489772454
    },
    {
        "content": "<p>Yeah I agree that good names for things can often remove the need for comments, and combining that with high-level documentation on ideas that are unlikely to change for a long time (possibly with a small glossary) can be great for helping folks get started.</p>",
        "id": 172579,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1489772803
    },
    {
        "content": "<p>I'd strongly appreciate user research on this -- Nash, if you could introduce a developer to the app and give them a task to do, and then take notes as they narrate their experience and especially make note of specific pain points, that would be great.</p>",
        "id": 172583,
        "sender_full_name": "Sumana Harihareswara",
        "timestamp": 1489772910
    },
    {
        "content": "<p>Sounds like a great idea, I personally draw UML diagrams of sort with arrows and modules to get through the codebase <img alt=\":sweat_smile:\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/unicode/1f605.png\" title=\":sweat_smile:\">  Since I am new to the codebase I remember my pain points, that combined with other developers' we'll have a solid idea of how to document the code <img alt=\":+1:\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/unicode/1f44d.png\" title=\":+1:\"></p>",
        "id": 172603,
        "sender_full_name": "Nash Vail",
        "timestamp": 1489773229
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"nishantve1@gmail.com\" data-user-id=\"1730\">@Nash Vail</span> have you ever read any of the academic research on what new developers tend to have trouble with when starting with a new codebase?</p>",
        "id": 172607,
        "sender_full_name": "Sumana Harihareswara",
        "timestamp": 1489773305
    },
    {
        "content": "<p>There are a few chapters about that in <a href=\"http://www.aosabook.org/en/makingsoftware.html\" target=\"_blank\" title=\"http://www.aosabook.org/en/makingsoftware.html\">Making Software</a> that I have found very useful in structuring my own documentation improvement work in the past.</p>\n<p>Also <a href=\"http://www.heidiwaterhouse.com/2016/03/19/the-three-documents-you-actually-need-first/\" target=\"_blank\" title=\"http://www.heidiwaterhouse.com/2016/03/19/the-three-documents-you-actually-need-first/\">Heidi Waterhouse's guidance</a> is pretty useful.</p>",
        "id": 172611,
        "sender_full_name": "Sumana Harihareswara",
        "timestamp": 1489773370
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"sh@changeset.nyc\" data-user-id=\"18\">@Sumana Harihareswara</span> No I haven't yet, I'll definitely find time to go through those links, they seem really useful. Thanks!</p>",
        "id": 172622,
        "sender_full_name": "Nash Vail",
        "timestamp": 1489773583
    },
    {
        "content": "<p>One of the best things we get out of doing sprints with Zulip is in-person feedback on what folks found confusing</p>",
        "id": 172628,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1489773770
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"tabbott@zulipchat.com\" data-user-id=\"7\">@Tim Abbott</span>  <span class=\"user-mention\" data-user-email=\"sh@changeset.nyc\" data-user-id=\"18\">@Sumana Harihareswara</span>  What are your thoughts on working on and improving app's UI/UX as part of GSoC ?</p>",
        "id": 172642,
        "sender_full_name": "Nash Vail",
        "timestamp": 1489774080
    },
    {
        "content": "<p>I think that's a fantastic choice of project area.  There's lots to do on that front; I'd try to pick out several specific larger areas you want to work on.</p>",
        "id": 172655,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1489774331
    },
    {
        "content": "<p>I'm going to post some thoughts in <a class=\"stream\" data-stream-id=\"48\" href=\"/#narrow/stream/react%20native%20app\">#react native app</a> on GSoC project ideas</p>",
        "id": 172661,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1489774535
    },
    {
        "content": "<p>thanks Tim! that'd be helpful :)</p>",
        "id": 172674,
        "sender_full_name": "Nash Vail",
        "timestamp": 1489774707
    }
]