[
    {
        "content": "<p>Hi, I am Yash!<br>\nWith respect to GSoC 2020, I wanted to contribute to Zulip. I have read the idea doc and found there are places where I can contribute as a designer. I am exploring UI/UX from the past 3 years. I would love to know how can I start with designing experiences for Zulip. <br>\nThank You</p>",
        "id": 821603,
        "sender_full_name": "Yash Khandelwal",
        "timestamp": 1582671433
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14995\">@Yash Khandelwal</span> welcome!  I'd start with working on small issues with the \"portico\" or \"design\" labels (post here if you're having trouble finding a good candidate)</p>",
        "id": 821612,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1582675584
    },
    {
        "content": "<p>What is the best way to ask the maintainers to merge our pull request? Should we ask them by mentioning them?</p>",
        "id": 822220,
        "sender_full_name": "Arunika Y",
        "timestamp": 1582729706
    },
    {
        "content": "<p>How  frequently should we mention the reviewers to do it? I do not want to poke a lot so I want to understand the best practise. One of my PRs <a href=\"https://github.com/zulip/zulip/pull/13919\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/13919\">https://github.com/zulip/zulip/pull/13919</a> has been waiting for the last 4 days</p>",
        "id": 822221,
        "sender_full_name": "Arunika Y",
        "timestamp": 1582729822
    },
    {
        "content": "<p>tagging reviewers on GitHub is the right way to ensure they get a notification about your PR. (Especially Tim).</p>",
        "id": 822222,
        "sender_full_name": "Yash RE",
        "timestamp": 1582729835
    },
    {
        "content": "<p>Although, if they're busy it might take them a while to actually get to you. (again, especially so for Tim).</p>",
        "id": 822223,
        "sender_full_name": "Yash RE",
        "timestamp": 1582729865
    },
    {
        "content": "<p>I think it's okay to mention reviewers every time you've completed your change set from your end and you feel like your PR is ready for the next round of reviews, (because there's practically no other way for reviewers to know that you're done and waiting for feedback).</p>",
        "id": 822224,
        "sender_full_name": "Yash RE",
        "timestamp": 1582729986
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14715\">@Arunika</span> It's a bit of a delicate balance.  Sometimes we simply have lots of PRs in the queue, so having a lot of folks asking to have their PRs get merged doesn't help a lot.  There are several things under your control, though:</p>\n<ul>\n<li>put a little extra attention into your PR description, so that it clearly states what you're fixing (sort of the same principles apply to PR descriptions as commit messages--be concise, be precise, use good grammar, etc.)</li>\n<li>make sure your build passes</li>\n<li>address any feedback that you've already gotten</li>\n</ul>\n<p>Another good way to engage here is to ask a pretty specific question about something that's pertinent to your PR.  That can sometimes start a good conversation and help improve the quality of the PRs.</p>\n<p>I know that doesn't directly answer your question, but I hope it helps!</p>",
        "id": 822226,
        "sender_full_name": "Steve Howell",
        "timestamp": 1582730144
    },
    {
        "content": "<p>(Please correct me if I'm wrong, core team)</p>",
        "id": 822227,
        "sender_full_name": "Yash RE",
        "timestamp": 1582730149
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"9808\">Yash RE</span> <a href=\"#narrow/stream/101-design/topic/GSoC.202020/near/822227\" title=\"#narrow/stream/101-design/topic/GSoC.202020/near/822227\">said</a>:</p>\n<blockquote>\n<p>(Please correct me if I'm wrong, core team)</p>\n</blockquote>\n<p>We actually sort of discourage mentions of PRs that don't have much more context.  If somebody has already engaged you on a PR and if there has maybe been some discussion on chat about the PR already, it's fine to mention here that you've addressed concerns, but even that can be a bit unnecessary at time.  It's mostly harmless, of course, so people shouldn't feel bad about doing it.  But really the way reviews tend to be prioritized is that Tim looks at GH and uses his own heuristics of what to review next.</p>",
        "id": 822230,
        "sender_full_name": "Steve Howell",
        "timestamp": 1582730330
    },
    {
        "content": "<p>ah, I see... I get what you're saying,</p>\n<p>however, I kinda don't think we're on the same page:<br>\nI more of meant to answer \"How often should I ping on an existing PR, if it's not getting attention\" which is kinda a wrong question because, as you describe, the PR will be seen based on reviewer's heuristics.</p>\n<p>But say you're working on a moderate or higher priority PR, in which case I think it'd be helpful send the reviewer a notification every time you feel like you've completed their requests and done as much as you can ie send an interrupt before idle-spinning / going on to do something else. I'd like to hear your opinion, because if it's not helpful, as I imagine, then I've been wasting my time <span aria-label=\"mischievous\" class=\"emoji emoji-1f61b\" role=\"img\" title=\"mischievous\">:mischievous:</span> .</p>",
        "id": 822249,
        "sender_full_name": "Yash RE",
        "timestamp": 1582731365
    },
    {
        "content": "<p>It's always a judgment call.  Obviously, for anything that's high priority, you should get the attention of whoever you need in the most direct way.  But very few things are truly \"high priority.\"</p>\n<p>The better strategy long term is just to try to have useful engagement on chat about the issues around your PR.  And do your best to make it high quality.</p>",
        "id": 822251,
        "sender_full_name": "Steve Howell",
        "timestamp": 1582731647
    },
    {
        "content": "<p>cool, thanks for clarifying :)</p>",
        "id": 822255,
        "sender_full_name": "Yash RE",
        "timestamp": 1582731799
    },
    {
        "content": "<p>hello iam vamsi well experienced in React native and App design and development want to contribute to this project by the means of GSOC 2020. I have experience since 1 year in developing these things i want to have a startup guide to get into dev environment for zulip</p>",
        "id": 824509,
        "sender_full_name": "Venkata Vamsi",
        "timestamp": 1583128034
    },
    {
        "content": "<p>Hye everyone! I'm a UI/UX designer with a knack for front-end development. Ideas that got my attention were visual design work on Zulip’s logged-out pages, rebuilding the Zulip web UI and improving the UI and visual design of Zulip settings and admin pages. I believe a consistent and harmonious design system that a platform breathes is necessary to provide a fluent user experience. Let me know how can I start contributing, which issues relate to these topics and how can I assign them to myself.  Cheers!</p>",
        "id": 824846,
        "sender_full_name": "Priyanshu.barnwal",
        "timestamp": 1583175960
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"15080\">@Priyanshu.barnwal</span> welcome!  I would start with just finding some small things to fix to get experienced with working with our CSS and development tooling.</p>",
        "id": 825707,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1583277779
    },
    {
        "content": "<p>Cool <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span></p>",
        "id": 825739,
        "sender_full_name": "Priyanshu.barnwal",
        "timestamp": 1583281749
    }
]