[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"22433\">@Vlad Korobov</span> does our latest design make it easier to hide user list for users who don't want to see it on any screen width?</p>\n<p>I was working on rebasing (basically rewrite) <a href=\"https://github.com/zulip/zulip/pull/19927\">#19927</a>, and realized that it would break with every PR for our new design that touches the navbar or right sidebar.</p>",
        "id": 1608878,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1689250623
    },
    {
        "content": "<p>Here's a screenshot of our final design if I am correct.<br>\n<a href=\"/user_uploads/2/41/A50VrMlZKkMaFnwGitIcZAPT/Screenshot-2023-07-13-at-5.48.30-PM.png\">Screenshot-2023-07-13-at-5.48.30-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/41/A50VrMlZKkMaFnwGitIcZAPT/Screenshot-2023-07-13-at-5.48.30-PM.png\" title=\"Screenshot-2023-07-13-at-5.48.30-PM.png\"><img src=\"/user_uploads/2/41/A50VrMlZKkMaFnwGitIcZAPT/Screenshot-2023-07-13-at-5.48.30-PM.png\"></a></div>",
        "id": 1608881,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1689250734
    },
    {
        "content": "<p>I am curious to know how the icons in top navbar would change on smaller window width in the new design.</p>",
        "id": 1608892,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1689250892
    },
    {
        "content": "<p>hello I'm solving a similar problem I need a user list only for people who are in the channels and with whom I'm in touch as friends or together we discuss something, I don't want there to be a list of all users</p>",
        "id": 1608902,
        "sender_full_name": "Tuho",
        "timestamp": 1689251065
    },
    {
        "content": "<p>Yeah, as you can see in our new design, you can toggle in the right sidebar to only see users in the current stream. You can use the <code>Direct Messages</code> section in the left sidebar to see users who you have exchanged messages in the past.</p>",
        "id": 1608916,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1689251511
    },
    {
        "content": "<p>Hmm, yeah, I think clicking that users icon (currently underlined) could hide the panel, but I'm not sure how that would adjust for mobile widths, for example.</p>",
        "id": 1609068,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1689261682
    },
    {
        "content": "<p>Users icon just shows and hides right side panel. This action doesn't change anything else. Nothing else moves. Just an empty space at the right side.</p>\n<p>With that right side space is collapsing after certain break point (same as it is now). And the icons aligned to the right side in the top panel, search converts to icon instead of input like button.</p>",
        "id": 1609676,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1689298978
    },
    {
        "content": "<p>And if user has \"take full width\" setting it is not taking space of the empty right side space anyway... but after some break point this space is disappearing</p>",
        "id": 1609677,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1689299030
    },
    {
        "content": "<p>Oh! Then with the new design \"Hide user list\" feature would be as simple as having a <code>display: none</code> right? I guess then it makes sense to implement it later with the new design.</p>",
        "id": 1609685,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1689301701
    }
]