[
    {
        "content": "<p>In a customer support discussion, it came up that the action of the \"Edit topic\" pencil button in the topic header bar is quite confusing in interleaved views. It's not very clear that editing the topic there will move <em>all</em> the messages in a topic, which may be above or below other messages that are not being moved.</p>\n<p>Should we perhaps hide that button in interleaved views? Users will still be able to move messages via the message and topic menus as usual.</p>\n<p>(I'm not caught up on <a class=\"stream\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design\">#design</a> , so apologies if there's discussion elsewhere that makes this question moot.)</p>",
        "id": 1635284,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1693953175
    },
    {
        "content": "<p>I vote for hiding it unless hovered or hiding those buttons unless inside a topic view</p>",
        "id": 1635300,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1693955527
    },
    {
        "content": "<p>The proposal we’ve discussed in the past is to show buttons in recipient bar only when in that topic view + possible to show those buttons in other view on hover. That was UI clean up. But if we  think that those buttons could be misguiding without the full context of the topic we could have only one button in interleaved view “go to the full version of that topic”. <br>\nI would still appreciate mute control inside interleaved view. And I’m not sure it is ok to not show some options over an topic if a user doesn’t see all of it</p>",
        "id": 1635301,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1693955847
    },
    {
        "content": "<p>Yeah I am ok with something in this direction. I don't think there's a situation where I'd recommend using that edit pencil in an interleaved view other than when the bottom of the feed is in view (e.g. you just sent a message to a topic from the stream view).</p>",
        "id": 1640943,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1694733314
    },
    {
        "content": "<blockquote>\n<p>“go to the full version of that topic”.</p>\n</blockquote>\n<p>Currently, the name of the topic is that button.</p>",
        "id": 1641694,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1694825268
    }
]