[
    {
        "content": "<p>Currently, on the webapp, the way for me to <em>quickly</em> visually check whether I am in a topic narrow vs stream narrow is to either:</p>\n<ol>\n<li>see that the URL is sufficiently long</li>\n<li>see if there are multiple topic messages in the messages list if I scroll up slightly.</li>\n<li>see if a particular topic is highlighted in the left sidebar (I almost never use this option)</li>\n</ol>\n<p>These methods are rather implicit. (Edit: Option 3 is explicit, but I have to move my eye focus to the left side of the screen to do the deed.)<br>\nI rarely have a problem with knowing the mode of my narrow, because I am almost always in topic narrow.<br>\nBut I imagine this could be a huge problem for new users.<br>\nWould it be a good idea to tweak the UI to make this more easily discoverable?</p>\n<p>I have explored a way to do this in ZT, as can be seen in the screenshots in <a href=\"#narrow/stream/206-zulip-terminal/topic/mode.20indicator.20like.20vim/near/1249826\">https://chat.zulip.org/#narrow/stream/206-zulip-terminal/topic/mode.20indicator.20like.20vim/near/1249826</a> (with all caps text of <code>STREAM</code>, <code>TOPIC</code>), which is partly inspired by Vim. It is definitely too esoteric to use Vim-style indicator in the web app, and so I am not recommending this approach. But I'm just giving an illustration of what can be done about it.</p>",
        "id": 1251451,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1630488353
    },
    {
        "content": "<p>Even if the all caps text can't be used, maybe a color hint could be used? For instance, dark blue color for the bar for topic narrow, lighter blue for stream narrow?</p>",
        "id": 1251452,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1630488703
    },
    {
        "content": "<p>Mm, interesting. Just so I understand the suggestion, are you saying we could change the background color for the topic part of the header row to indicate whether or not the user is in an interleaved view?</p>",
        "id": 1251488,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1630509344
    },
    {
        "content": "<p>Yes, the header row:<br>\n<a href=\"/user_uploads/2/b/Gd7qsYIQaeN00wTxK31VTEHI/2021-09-01-193351_717x49_scrot.png\">2021-09-01-193351_717x49_scrot.png</a> <br>\nThough this still requires learning by the user to deduce that a different color means different narrow mode.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/b/Gd7qsYIQaeN00wTxK31VTEHI/2021-09-01-193351_717x49_scrot.png\" title=\"2021-09-01-193351_717x49_scrot.png\"><img src=\"/user_uploads/2/b/Gd7qsYIQaeN00wTxK31VTEHI/2021-09-01-193351_717x49_scrot.png\"></a></div>",
        "id": 1251743,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1630539459
    },
    {
        "content": "<p>Can you say more about why you regularly find that this is something you want to check?</p>",
        "id": 1251954,
        "sender_full_name": "Greg Price",
        "timestamp": 1630615603
    },
    {
        "content": "<p>It's not in my case, because I usually make sure that I am not in interleaved views (I don't know if other experienced users also do the same).</p>\n<p>As one example, it happened in the conversation around here: <a href=\"#narrow/stream/31-production-help/topic/aws.20ubuntu.20installation/near/1250951\">https://chat.zulip.org/#narrow/stream/31-production-help/topic/aws.20ubuntu.20installation/near/1250951</a> because I think <span class=\"user-mention silent\" data-user-id=\"21370\">Md Nishad Hussain</span> was in stream narrow when he replied.</p>",
        "id": 1251999,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1630641956
    },
    {
        "content": "<p>Mmm, got it.</p>\n<p>My quick read from that thread is that that's a user who has not yet acquired much understanding of how Zulip works. I think a subtle cue like those dark/light colors is not going to help a user in that state at all -- they're just not going to pick up on that, not before learning enough else about Zulip that it's not a problem for them.</p>\n<p>For users who are in that state, I think our best strategy is to help them stay in single-conversation narrows (one topic, or one PM thread) and not end up in interleaved views.</p>",
        "id": 1252286,
        "sender_full_name": "Greg Price",
        "timestamp": 1630706173
    },
    {
        "content": "<p>One way is to disable writing a message when in interleaved views, and the message box instead says a warning that one is not in stream narrow.</p>",
        "id": 1252337,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1630748847
    },
    {
        "content": "<p>Another way is to disable interleaved views by default, and add a toggle to enable/disable in settings, so that the users who enable it, know what they are doing.</p>",
        "id": 1252501,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1630906021
    }
]