[
    {
        "content": "<p>Hi everyone,</p>\n<p>we're currently establishing Zulip in my team at work. While people seem to like the concept, they don't really like the somewhat dated-looking design of the app.<br>\nI've heard about some redesign ideas and played around with css for a little while and came up with something that looks somewhat decent.<br>\nMaybe this provides some inspiration for a more modern look for Zulip.</p>\n<p>I focused on the message stream, as that's the most important path of the application.</p>\n<p><a href=\"/user_uploads/2/fe/90k7fvPWeZ1Ghl0pyU_UQMLr/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a><br>\nYou can use this custom css for the desktop client to try it for yourself: <a href=\"user_uploads/2/e4/U6ORDVfNVgrnHd8hJyQu2NMx/zulip.css\" target=\"_blank\" title=\"user_uploads/2/e4/U6ORDVfNVgrnHd8hJyQu2NMx/zulip.css\">zulip.css</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/fe/90k7fvPWeZ1Ghl0pyU_UQMLr/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/2/fe/90k7fvPWeZ1Ghl0pyU_UQMLr/pasted_image.png\"></a></div>",
        "id": 738589,
        "sender_full_name": "Jakob",
        "timestamp": 1556797733
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"10096\">@Jakob</span> This looks great!</p>",
        "id": 738594,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1556801120
    },
    {
        "content": "<p>Thanks, I've updated the css with some fixes btw.</p>",
        "id": 738597,
        "sender_full_name": "Jakob",
        "timestamp": 1556801268
    },
    {
        "content": "<p>Injecting this in my desktop client right away!</p>",
        "id": 738599,
        "sender_full_name": "Abhigyan Khaund",
        "timestamp": 1556801675
    },
    {
        "content": "<p>Awesome work <span class=\"user-mention\" data-user-id=\"10096\">@Jakob</span></p>",
        "id": 738601,
        "sender_full_name": "Vipul Sharma",
        "timestamp": 1556801831
    },
    {
        "content": "<p>Nice work!</p>",
        "id": 738604,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1556802610
    },
    {
        "content": "<p>Looks good event in night mode :D</p>",
        "id": 738616,
        "sender_full_name": "Abhigyan Khaund",
        "timestamp": 1556810243
    },
    {
        "content": "<p>Night mode was a very quick hack though :D</p>",
        "id": 738617,
        "sender_full_name": "Jakob",
        "timestamp": 1556810612
    },
    {
        "content": "<p>And if users could choose theme/skins?</p>",
        "id": 739156,
        "sender_full_name": "Pedro Barbosa",
        "timestamp": 1556965059
    },
    {
        "content": "<p>Looks nice</p>",
        "id": 739200,
        "sender_full_name": "Mohit Gupta",
        "timestamp": 1556995100
    },
    {
        "content": "<p>I have been using this theme for a month now and the difference is feel is quite evident when I move from the Desktop app to the webapp. I was wondering if we'd be able to host such community developed themes somewhere for ease of access to wider people.</p>",
        "id": 754270,
        "sender_full_name": "Abhigyan Khaund",
        "timestamp": 1560608037
    },
    {
        "content": "<blockquote>\n<p>I have been using this theme for a month now and the difference is feel is quite evident when I move from the Desktop app to the webapp. I was wondering if we'd be able to host such community developed themes somewhere for ease of access to wider people.</p>\n</blockquote>\n<p>I think custom user themes would be pretty cool idea, and hosting would be great.</p>",
        "id": 754585,
        "sender_full_name": "Yash RE",
        "timestamp": 1560707710
    },
    {
        "content": "<p>It could just start as a git repository that people send PRs to. And if it takes off, we could find a way to get screenshots with those themes, etc.</p>",
        "id": 754732,
        "sender_full_name": "Puneeth Chaganti",
        "timestamp": 1560740387
    },
    {
        "content": "<blockquote>\n<p>It could just start as a git repository that people send PRs to. And if it takes off, we could find a way to get screenshots with those themes, etc.</p>\n</blockquote>\n<p>This is a great idea. Additionally, we could have this as an option in the Settings as well so that it is much easier for the normal user to choose from and apply. (with the potential for it to be applicable not only on the Desktop app, but the webapp as well)</p>",
        "id": 754980,
        "sender_full_name": "Vinit Singh",
        "timestamp": 1560796015
    },
    {
        "content": "<p>Sounds good. It would be good to start a repository in the Zulip org itself.</p>",
        "id": 760273,
        "sender_full_name": "Abhigyan Khaund",
        "timestamp": 1561558926
    },
    {
        "content": "<p>Ultimately the solution is for us to make the default Zulip UI more modern, though I'm not sure what the right interim solution is.</p>\n<p>One issue with giving official support to user themes is that there is an implicit assumption we won't regularly break them.</p>",
        "id": 760429,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1561566957
    },
    {
        "content": "<p>Has there been a discussion regarding a number of themes (different colors, like slack), that we can provide to the users ? That would be a great feature to have.</p>",
        "id": 766033,
        "sender_full_name": "Vipul Sharma",
        "timestamp": 1562768687
    },
    {
        "content": "<p>I think our highest priority work on the frontend is probably things like increasing the font size. We're not currently set up for different colors really; eg we use color to indicate PMs and mentions</p>",
        "id": 766046,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1562771554
    },
    {
        "content": "<p>The themes in Slack really only affect the sidebar, which makes them quite easy to implement. Just generate a little bit of dynamic css with the user colors and you're done. Slack doesn't even have a dark mode and also doesn't allow to change all colours, only a very small subset.<br>\nI wouldn't focus on stuff like user color schemes before making the ui more modern. The issue isn't that people are unhappy with the colors, they are unhappy with the outdated design in general.</p>",
        "id": 766057,
        "sender_full_name": "Jakob",
        "timestamp": 1562771926
    },
    {
        "content": "<p>I agree.</p>",
        "id": 766132,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1562777599
    },
    {
        "content": "<p>I'm saying this at the risk of sounding overly aggressive... but I think the topic here has digressed.</p>\n<p>The point here was that <a href=\"/user_uploads/2/7f/J8hA9QGOwlpK2kSzytDlfoKh/beauty.gif\" target=\"_blank\" title=\"beauty.gif\">this</a>  is BEAUTIFUL and I don't think a single person here would disagree to that.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/7f/J8hA9QGOwlpK2kSzytDlfoKh/beauty.gif\" target=\"_blank\" title=\"this\"><img src=\"/user_uploads/2/7f/J8hA9QGOwlpK2kSzytDlfoKh/beauty.gif\"></a></div><p>This really goes pretty far in \"solving\" the problem that our UI looks really archaic (which is a big complaint, and probably a big stopper from people moving over to our superior threads modal) we should really look at this as inspiration for where the app design should go.<br>\nAnd by that I mean we should really think about everything that this mock up changes from what we currently have on master and see why those changes are or aren't good ideas. (be harsh with the criticism).<br>\nWe could then <a href=\"/user_uploads/2/a9/p757NYxCi6FQN-rgfCTFJ09b/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">iterate</a> <a href=\"/user_uploads/2/b2/SS8P3H1MxnI05Yy61yNoeqWg/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">over this</a> based on discussion...</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/a9/p757NYxCi6FQN-rgfCTFJ09b/pasted_image.png\" target=\"_blank\" title=\"iterate\"><img src=\"/user_uploads/2/a9/p757NYxCi6FQN-rgfCTFJ09b/pasted_image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/b2/SS8P3H1MxnI05Yy61yNoeqWg/pasted_image.png\" target=\"_blank\" title=\"over this\"><img src=\"/user_uploads/2/b2/SS8P3H1MxnI05Yy61yNoeqWg/pasted_image.png\"></a></div><p>This could really be the start of the roadmap of \"modern Zulip\". <br>\nAs for actual implementation of this?<br>\nI understand that it's far too big a UI change to send to users.<br>\nPut it behind a \"experimental UI\" display setting that very few users will ever know about... which I can flip on and never need to change back.</p>\n<p>Examples of changes to look at from this mockup:</p>\n<ul>\n<li>forces full-width -&gt; we've added a setting for that.</li>\n<li>changes the \"select\" to highlight the entire message in blue -&gt; people may argue that this is too noisy for everyone and I understand that argument.</li>\n<li>rounds out the stream name and removes the left sidebar line -&gt; this looks great for individual topics but it makes interleaved views a bit confusing.</li>\n<li>changes FRB background to white -&gt; makes interleaved views more confusing (less visually apparent).</li>\n<li>etc </li>\n</ul>\n<p>(honestly the biggest change is just the background color...)</p>",
        "id": 770634,
        "sender_full_name": "Yash RE",
        "timestamp": 1563652383
    },
    {
        "content": "<p>One place we've gotten stuck in the past is how to make colored sidebars work without forcing full width. Would love ideas there.</p>",
        "id": 770678,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1563684682
    },
    {
        "content": "<p>(though possibly also just worth trying a colored background without worrying about it; e.g. fb has styling like the above but without full width)</p>",
        "id": 770679,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1563685085
    },
    {
        "content": "<p><a href=\"/user_uploads/2/25/VXKys7BScIOg71ABNW6TLwJs/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\"></a> <a href=\"/user_uploads/2/9d/D8dYKN8FKoj_HgYSDZY2ybVw/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\"></a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/25/VXKys7BScIOg71ABNW6TLwJs/pasted_image.png\" target=\"_blank\" title=\"\"><img src=\"/user_uploads/2/25/VXKys7BScIOg71ABNW6TLwJs/pasted_image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/9d/D8dYKN8FKoj_HgYSDZY2ybVw/pasted_image.png\" target=\"_blank\" title=\"\"><img src=\"/user_uploads/2/9d/D8dYKN8FKoj_HgYSDZY2ybVw/pasted_image.png\"></a></div>",
        "id": 770688,
        "sender_full_name": "Yash RE",
        "timestamp": 1563693359
    },
    {
        "content": "<p>This is how it looks if I just kill the full width. Maybe the ideal look would be something that raises the app onto a \"card\" of it's own.... or something like that.</p>",
        "id": 770689,
        "sender_full_name": "Yash RE",
        "timestamp": 1563693560
    },
    {
        "content": "<p><a href=\"/user_uploads/2/12/J34lKYJtHkQDdKcfunZ8VWdM/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">maybe something like this?</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/12/J34lKYJtHkQDdKcfunZ8VWdM/pasted_image.png\" target=\"_blank\" title=\"maybe something like this?\"><img src=\"/user_uploads/2/12/J34lKYJtHkQDdKcfunZ8VWdM/pasted_image.png\"></a></div>",
        "id": 770694,
        "sender_full_name": "Yash RE",
        "timestamp": 1563698220
    },
    {
        "content": "<p>Interesting. I think there are likely some quick wins here.</p>",
        "id": 770704,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1563728551
    },
    {
        "content": "<p>The last one looks pretty good.</p>",
        "id": 770706,
        "sender_full_name": "Vinit Singh",
        "timestamp": 1563728795
    },
    {
        "content": "<p>Yeah, I actually really like that last one.</p>",
        "id": 770710,
        "sender_full_name": "Wyatt Hoodes",
        "timestamp": 1563729931
    },
    {
        "content": "<blockquote>\n<p><a href=\"/user_uploads/2/a9/p757NYxCi6FQN-rgfCTFJ09b/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">iterate</a> <a href=\"/user_uploads/2/b2/SS8P3H1MxnI05Yy61yNoeqWg/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">over this</a></p>\n</blockquote>\n<p>Another thing that I think we should iterate on is how this changes the styling of the message list itself. I really like how it creates this appearance of a card layout for each message especially in interleaved views. So it seems as though topics and streams are divided by the fact that they are on different cards.<br>\nI also love how the selected marker moves over the cards and \"selects\" a card in a way that sort of \"raises\" it with the blue background.</p>\n<p>The problem is that it's not that clear \"what the different topics are\" because the frb is the same color as the message box....</p>\n<p>So, trying to change that and preserve the card like look led me to these two iterations that I mentioned before (quoted above)</p>",
        "id": 770711,
        "sender_full_name": "Yash RE",
        "timestamp": 1563730087
    },
    {
        "content": "<p>One thing worth mentioning is that a \"cards\" like design suggests that a given card contains all the messages on that topic, total, not just the ones that are consecutive in that time-sorted view.  This is the reason we've avoided designs that are inspired by Facebook posts (which do have the property that all content for a given post is grouped together there)</p>",
        "id": 770798,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1563760305
    },
    {
        "content": "<p>I don't know if this fits into the discussion but honestly I really like the current message list and message box design. Not that the design being discussed is not good, but I think there are other areas which need more attention with respect to design rather than the message list. I mentioned this in my GSoC proposal, and if you guys agree, I think improving spacing in areas such as sidebars, having more consistency in style all through the app (including mobile and desktop too) and just making such minor adjustments might make the UI look a bit more modern. We could go ahead with the new theme but these changes are require more attention according to me.</p>\n<p>For example -- when occupying full screen width, the left sidebar sticks to the side of the window. This is weird because neither is there defined indication of the sidebar being a sidebar (since the background is same as the complete site) and the left corners are curved. This might be a very minor improvement. Some people might not notice this at all, but for me just adding some space on the left would make the app look less cluttered.<br>\nAnother thing is when you click on the search icon in streams (left sidebar), the search text-box looks clumsy to me. </p>\n<p>The one thing I really like about the current message-box is that there is proper spacing wherever required. I do have some more opinions which are minor improvements but could bring in a lot of change in the current design. Just want to know what you guys think first.</p>",
        "id": 770828,
        "sender_full_name": "Vaibhav Rabber",
        "timestamp": 1563772228
    },
    {
        "content": "<p>What Tim is saying makes sense to me... but, maybe there's something we could still do here... I genuinely think more users would adopt Zulip if this design were fixed and made available to them and the cards are a part of that... <br>\nI'd appreciate feedback/criticism on the iterations I tried... </p>\n<p>How about this? We don't \"close\" the \"bottom\" of the card if it isn't the last message of the topic.</p>\n<p>I disagree with <span class=\"user-mention silent\" data-user-id=\"5593\">Vaibhav Rabber</span>... But regardless, we should really make a big list of all the areas that need work, both in this current design and the one suggested in this thread...</p>",
        "id": 771203,
        "sender_full_name": "Yash RE",
        "timestamp": 1563827498
    },
    {
        "content": "<p>(One thing the current design should really fix is the glitch-ish frb... We have an open PR that's held back because \"sticky\" property isn't universally supported)</p>",
        "id": 771208,
        "sender_full_name": "Yash RE",
        "timestamp": 1563827667
    },
    {
        "content": "<blockquote>\n<p>How about this? We don't \"close\" the \"bottom\" of the card if it isn't the last message of the topic.</p>\n</blockquote>\n<p>We need to indicate there are more messages both before and after the ones on the card (if that's the case).</p>",
        "id": 771311,
        "sender_full_name": "Tommy Ip",
        "timestamp": 1563853879
    },
    {
        "content": "<p>Just FYI: The reason the theme is full width is that I prefer that on the zulip-desktop. I don't like an \"application window\" that contains whitespace. If I want to have it smaller, I resize the window. In a web browser it makes sense to limit the max width of course.</p>",
        "id": 772452,
        "sender_full_name": "Jakob",
        "timestamp": 1564046018
    },
    {
        "content": "<p>I also agree that cards might be misleading. But finding a good alternative might be difficult. Maybe just adding a small ellipsis button at the bottom and top, that will narrow to the topic when clicked could solve that on cards. it doesn't need to be big, otherwise it will get in the way, but it gives an indication that there is more, and a intuitive way to get to it, maybe better than having to click on the topic name.<br>\nSmall things like that might also help with improving the UX, another area my colleagues complained about. Zulip can be really confusing for new users.</p>",
        "id": 772453,
        "sender_full_name": "Jakob",
        "timestamp": 1564046207
    },
    {
        "content": "<p>I think that makes sense... The primary area to click on in the message list is the message. Currently what that does is open the message box and blur the messages from other streams/topics... We could also consider having the ellipses only when that happens? (Although I don't know if that's better or worse...)</p>",
        "id": 772494,
        "sender_full_name": "Yash RE",
        "timestamp": 1564060410
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> Assuming that solution is okay for the normal app width, what's the next thing you see here that would be a big problem for us?</p>",
        "id": 773605,
        "sender_full_name": "Yash RE",
        "timestamp": 1564203330
    },
    {
        "content": "<p>Loving this design btw (works well in the web interface too)</p>",
        "id": 774041,
        "sender_full_name": "Carlo Kok",
        "timestamp": 1564388429
    },
    {
        "content": "<p>Going by the initial message in this topic, are there any plans to introduce multiple theme options through predefined CSS files. e.g. <code>zulip_nightly_blue.css</code>, <code>zulip_purple_shade.css</code>, etc.</p>",
        "id": 839327,
        "sender_full_name": "Vaibhav Raj Singh",
        "timestamp": 1585124265
    },
    {
        "content": "<p>We already have the option to add external CSS. This could be an add on to it. Just an added ability to choose from some of our predefined styles.</p>",
        "id": 839328,
        "sender_full_name": "Vaibhav Raj Singh",
        "timestamp": 1585124305
    },
    {
        "content": "<p>A in-built theme generator would be nice, a page with color selectors for different element. If you want to share it the page can generate a unique string, other user can input the string in their settings to use that style.</p>",
        "id": 839337,
        "sender_full_name": "Tejas Tank",
        "timestamp": 1585124829
    },
    {
        "content": "<p>I'd really like to approach new themes by embracing a Stylish/Stylebot type solution.  Folks on the Zulip project can install these plugins and experiment with their own styles changes.  If we find places where it's hard to override Zulip styles with Stylish, we can try to make Zulip's scheme easier to overwrite.   And then we can publish unofficial themes on some GH repo outside of Zulip.</p>\n<p>The idea here is to actually encourage a little bit of \"unofficial\" customization, sort of similar to what happens for games (where people build their own mods).  I'm not really a gamer, so I'm maybe not doing the game analogy justice.</p>",
        "id": 839396,
        "sender_full_name": "Steve Howell",
        "timestamp": 1585133242
    },
    {
        "content": "<p>Then suppose <span class=\"user-mention\" data-user-id=\"13307\">@Vaibhav Raj Singh</span> published a purple-shade them on his GH account and it got 30 stars, and we started getting people coming on here asking about it, etc., or some other indicators of its popularity.  At that point we'd consider making it a more \"official\" option.</p>",
        "id": 839397,
        "sender_full_name": "Steve Howell",
        "timestamp": 1585133336
    },
    {
        "content": "<blockquote>\n<p>purple-shade</p>\n</blockquote>\n<p><del>slack</del></p>",
        "id": 839441,
        "sender_full_name": "Yash RE",
        "timestamp": 1585136621
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"9808\">@Yash RE</span> I recommend you get on the purple-shade package right away.  And you can sell merchandise here: <a href=\"https://www.thepurplestore.com/\" title=\"https://www.thepurplestore.com/\">https://www.thepurplestore.com/</a></p>",
        "id": 839461,
        "sender_full_name": "Steve Howell",
        "timestamp": 1585138395
    },
    {
        "content": "<p>\"Everything we sell is purple.\" <span aria-label=\"purple heart\" class=\"emoji emoji-1f49c\" role=\"img\" title=\"purple heart\">:purple_heart:</span></p>",
        "id": 839462,
        "sender_full_name": "Steve Howell",
        "timestamp": 1585138422
    },
    {
        "content": "<p>Purple does look <em>really</em> good. Honestly, I might just play around..</p>",
        "id": 839478,
        "sender_full_name": "Yash RE",
        "timestamp": 1585139496
    },
    {
        "content": "<p>We've created a monster!</p>",
        "id": 839488,
        "sender_full_name": "Steve Howell",
        "timestamp": 1585139811
    },
    {
        "content": "<p>My view is much more important than support for new themes is pushing on things that impact \"every theme\", like the top navbar visual design.  My guess is reasonable support for alternative themes might be more work (<code>night_mode.scss</code> is 600+ LOC) and I think would have impact only on the small fraction of users who installed an alternative theme.</p>",
        "id": 839684,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1585157656
    },
    {
        "content": "<p>I assume we're mainly talking colors here?</p>",
        "id": 839843,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1585163639
    },
    {
        "content": "<p>I think so.</p>",
        "id": 839851,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1585163911
    },
    {
        "content": "<p>My contribution to the conversation isn't really specific to colors.  It's more about a methodology of us being friendly to folks outside of Zulip who want to use things like like Stylish, so that we don't have to do it ourselves.</p>\n<p>I've mostly heard of people using Stylish for things that are color-related (like night-mode, especially before we supported it), but other things are more layout-related.  Like it would be nice if we could just point people to some unofficial buyer-beware wide-mode css that they could just drop in.  And see if that just solves 80% of the problems for the more finicky power user population, at least.</p>",
        "id": 839889,
        "sender_full_name": "Steve Howell",
        "timestamp": 1585164812
    },
    {
        "content": "<p>Like, I'd like to treat some \"wide mode css\" with the same sort of unofficial support we might have for something like \"PHP client bindings.\"  We don't have to fully support it, just encourage out-of-the-box community efforts and listen to anything where they're truly blocked by us.</p>",
        "id": 839893,
        "sender_full_name": "Steve Howell",
        "timestamp": 1585164915
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell</span> <a href=\"#narrow/stream/101-design/topic/ideas.20for.20a.20new.20theme/near/839889\" title=\"#narrow/stream/101-design/topic/ideas.20for.20a.20new.20theme/near/839889\">said</a>:</p>\n<blockquote>\n<p>I've mostly heard of people using Stylish for things that are color-related (like night-mode, especially before we supported it), but other things are more layout-related.  Like it would be nice if we could just point people to some unofficial buyer-beware wide-mode css that they could just drop in.  </p>\n</blockquote>\n<p>(As an aside: if we do, we should probably recommend Stylus, not Stylish. The latter was <a href=\"https://robertheaton.com/2018/07/02/stylish-browser-extension-steals-your-internet-history/\" title=\"https://robertheaton.com/2018/07/02/stylish-browser-extension-steals-your-internet-history/\">bought by an ad company</a>; the former is <a href=\"https://github.com/openstyles/stylus\" title=\"https://github.com/openstyles/stylus\">an openly-maintained fork</a>.)</p>",
        "id": 839923,
        "sender_full_name": "Ray Kraesig",
        "timestamp": 1585165359
    },
    {
        "content": "<p>btw, the context of me bringing this up was to show off that original theme that was presented at the top and wonder if there's anything we could pick up from it...</p>",
        "id": 839942,
        "sender_full_name": "Yash RE",
        "timestamp": 1585166280
    },
    {
        "content": "<p>Zulip purple, coming to your czo, next April fools. I'm kidding ofc, but it'd be funny.</p>",
        "id": 845220,
        "sender_full_name": "Yash RE",
        "timestamp": 1585719032
    },
    {
        "content": "<p>I would love to see pure dark mode(like with black/gray colors)</p>",
        "id": 845222,
        "sender_full_name": "Siddharth",
        "timestamp": 1585719199
    },
    {
        "content": "<p>Actually, the correct dark mode is the perfect one. Too dark backgrounds aren't great and the current one just seems to fall right with zulip's design philosophy. Feels in place.</p>",
        "id": 845249,
        "sender_full_name": "Vaibhav Raj Singh",
        "timestamp": 1585722644
    },
    {
        "content": "<p>(Instagram could learn a thing or two from zulip's dark mode <span aria-label=\"new moon face\" class=\"emoji emoji-1f31a\" role=\"img\" title=\"new moon face\">:new_moon_face:</span>)</p>",
        "id": 845251,
        "sender_full_name": "Vaibhav Raj Singh",
        "timestamp": 1585722674
    },
    {
        "content": "<p>If we could minimize the different colors we use for the main UI, we can have an integrated tool inside settings to have a theme, like in slack. That's more of theme side but we first need to update the current UI to look more modern.</p>",
        "id": 894185,
        "sender_full_name": "Tejas Tank",
        "timestamp": 1591266252
    }
]