[
    {
        "content": "<p>So, I have been working on <a href=\"https://github.com/zulip/zulip/pull/19433\">#19433</a> to fix a bug in our sponsorship form. While investigating, I discovered that users tend to input invalid values in the URL field when their organization has no website. They tend to do this because the URL field is required so they can't leave it empty. This leads to an exception in another part of the code since the form is invalid, which is what <a href=\"https://github.com/zulip/zulip/pull/19433\">#19433</a> aims to fix.</p>\n<p>A few ways forward:</p>\n<ul>\n<li>Tim suggested on the PR that we add a check box \"org doesn't have a website\" and then set the URL to be empty.</li>\n<li>My suggestion is that we should not do the checkbox and just make the URL field not \"required\". That approach seems more of a conventional way of making a form value optional. Once we do this, I think we should just use Django's <code>Form.errors</code> attribute to render proper and field-specific error messages that help the user submit the form correctly.</li>\n</ul>\n<p>My general idea here is that we should take this opportunity to make the sponsorship form's error handling better and just make it better in general. I would love to hear if anyone has further suggestions as to what the right form configuration could be here! Thanks! :)</p>",
        "id": 1244400,
        "sender_full_name": "Eeshan Garg",
        "timestamp": 1628186669
    },
    {
        "content": "<p>The reason I proposed the checkbox model is that it allows us to validate that if they submit a URL, it is valid.  I suppose we could allow <code>\"\"</code> or a valid URL, and have a placeholder say \"Leave blank is your organization doesn't have a website\"; that's probably cleaner.</p>",
        "id": 1244404,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1628186861
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/improve.20sponsorship.20form/near/1244404\">said</a>:</p>\n<blockquote>\n<p>The reason I proposed the checkbox model is that it allows us to validate that if they submit a URL, it is valid.  I suppose we could allow <code>\"\"</code> or a valid URL, and have a placeholder say \"Leave blank is your organization doesn't have a website\"; that's probably cleaner.</p>\n</blockquote>\n<p>Agreed that's cleaner, the URL would still get validated if it is there though, it is just that empty values would be acceptable as well. What you said above aligns very well with how Django's forms do validation and how the model would do the validation for a value that can be null.</p>",
        "id": 1244406,
        "sender_full_name": "Eeshan Garg",
        "timestamp": 1628187049
    },
    {
        "content": "<p>Yeah, that sounds good to me.</p>",
        "id": 1244409,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1628187398
    }
]