[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"17945\">Wesley Aptekar-Cassels</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1219509\">said</a>:</p>\n<blockquote>\n<p>I think that the amount of time we spend right now doing user-facing polish on existing features is very very small, and it would likely be worth slowing down some of the (admittedly quite valuable) infrastructure projects we're working on to ensure that we're spending time polishing user-facing features.</p>\n</blockquote>\n<p>Responding to this in particular, I certainly don't have the perception that user-facing work on existing features is \"very very small\". Nor do I have the perception that most of our resources are going into infrastructure projects. One thing that may be happening is that infrastructure work is differently visible in <a href=\"http://chat.zulip.org\">chat.zulip.org</a> from user-facing feature work (which can have a lot more rounds of discussion on GitHub before focus shifts to here).  It's also worth mentioning that we have many contributors who prefer to work on backend/infrastructure projects, and so redirecting \"infrastructure work\" to \"UI work\" is not always on the menu of options.</p>\n<p>Especially if one defines \"infrastructure work\" to include data piping etc. required to support new features or make existing features more complete and bug-free.</p>",
        "id": 1222461,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1624990539
    },
    {
        "content": "<p>I totally appreciate the point that <span class=\"user-mention\" data-user-id=\"17945\">@Wesley Aptekar-Cassels</span> is making here. (I don't know which topic this was moved from.)</p>\n<p>I'm not saying that the Zulip project has ever neglected infrastructure, but there's definitely been a huge infrastructure push in the last few years.  It's a good thing.  I don't think there's even necessarily a huge tradeoff.  Infrastructure-focused folks tend to to like working on infrastructure, so it's not like there's a huge opportunity cost.  And feature-focused folks can always make an impact on this project.</p>",
        "id": 1222517,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624993299
    },
    {
        "content": "<p>I don't think I have a very good picture of what's happening in zulip/zulip, since my view of that is mostly from CZO (which as you mention, is quite biased).</p>\n<p>I don't think a comparison to infrastructure work specifically is as useful as talking about priorities more broadly (which hopefully we'll get to soon as part of the planning process).</p>\n<p>\"very very small\" is probably a mischaracterization, but I will stand by the thing that I'm trying to communicate, which is that I think the progress that we're making on UI polish is quite slow. I definitely appreciate that there's a huge amount of work to be done, but I also think we could be doing a better job prioritizing high-impact things (and that \"fit-and-finish\" work is higher-impact than we probably realize).</p>",
        "id": 1222616,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1624997272
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"17945\">Wesley Aptekar-Cassels</span> <a href=\"#narrow/stream/101-design/topic/Infrastructure.2FUI.20work.20balance/near/1222616\">said</a>:</p>\n<blockquote>\n<p>I definitely appreciate that there's a huge amount of work to be done, but I also think we could be doing a better job prioritizing high-impact things (and that \"fit-and-finish\" work is higher-impact than we probably realize).</p>\n</blockquote>\n<p>FWIW, when I tried to get one community to use Zulip, I think a lot of the pushback that nixed it was roughly people saying it was too ugly. (I can't find the conversation now, though.)</p>",
        "id": 1222635,
        "sender_full_name": "Alex Dehnert",
        "timestamp": 1624997839
    },
    {
        "content": "<p>(One point was also \"it won't be high enough traffic to be worth a tab\", which was a decent part of why we ended up on Discord.)</p>",
        "id": 1222638,
        "sender_full_name": "Alex Dehnert",
        "timestamp": 1624997875
    },
    {
        "content": "<p>My perspective is that work that impacts what <span class=\"user-mention silent\" data-user-id=\"591\">Alex Dehnert</span> describes should be our highest priority within the category of work on polish. From talking to customers, it definitely feels like there's a first impressions effect that is impacting Zulip's growth. The later-stage impact for organizations that do adopt Zulip is less obvious. That's why I'm especially excited about projects that affect the impression we give to new users, including making it easier to join streams and compose messages, changing the font size/spacing, and figuring how how to staff modernizing the overall look &amp; feel.</p>\n<p>We're always making choices about where to direct limited resources. There are different levels to have the discussion at, from priorities for iterating on specific features, to high-level perspective on how to distribute our efforts. If folks are concerned that we're under-investing in certain areas compared to others, in large part that's feedback that should be directed to Tim and myself, so that we can discuss and take those ideas into account.</p>",
        "id": 1222862,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1625005678
    }
]