[
    {
        "content": "<p>Is there a way to indicate if a user is an internal LDAP user, or an external (meaning invited) user? Perhaps with a small overlay in the display jpg, or some specific username colour in the userlist, or perhaps make the username italic..? It would be nice to be able to see \"where a user comes from\"... (internal vs external)</p>",
        "id": 908731,
        "sender_full_name": "mouk",
        "timestamp": 1592507939
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16223\">@mouk</span> I am pretty sure we don't have anything like that yet.</p>",
        "id": 908748,
        "sender_full_name": "Steve Howell",
        "timestamp": 1592508345
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16223\">@mouk</span> can you talk more about the use case?  Is the idea that you're inviting contractors who aren't in LDAP and want to distinguish them?</p>",
        "id": 908750,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1592508388
    },
    {
        "content": "<p>Yes, it's exactly that. We have of course many 'internal' AD users. They can invite external users into the system. (which is <em>VERY</em> nice and one of the reasons we actually chose zulip) However, these external users become indistinguishable from 'internal company users' once they are in the system.</p>",
        "id": 908843,
        "sender_full_name": "mouk",
        "timestamp": 1592511452
    },
    {
        "content": "<p>The only difference is an external email address, which is something you don't immediately see, unless you open their detailed profile.</p>",
        "id": 908844,
        "sender_full_name": "mouk",
        "timestamp": 1592511495
    },
    {
        "content": "<p>Yeah, makes sense.  Have you considered inviting them as guest users?  I believe they are visually distinguished in how their avatars are displayed.</p>",
        "id": 908856,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1592513911
    },
    {
        "content": "<p>No, i tried it just now, but they look exactly the same, at least in the users list on the right.</p>",
        "id": 908881,
        "sender_full_name": "mouk",
        "timestamp": 1592514975
    }
]