[
    {
        "content": "<p>What would folks think of adding an \"invite as admin\" checkbox in the invite modal? This would have two benefits</p>\n<ul>\n<li>When they accept the invitation and test zulip out, they'll get to see everything as an admin</li>\n<li>There are a few onboarding differences for admins and non-admins, and we can give them the admin onboarding experience</li>\n</ul>",
        "id": 289530,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1506669109
    },
    {
        "content": "<p>Good idea.</p>",
        "id": 289531,
        "sender_full_name": "Joshua Pan",
        "timestamp": 1506669159
    },
    {
        "content": "<p>It depends on the usage frequency of this feature, I suppose (whether the scenario happens often or not). Currently, it is already doable with few more clicks, but with this existing method, it is impossible to implement admin-specific onboarding.</p>",
        "id": 289532,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1506669626
    },
    {
        "content": "<p>This is a good idea. But I am a bit wary of the issues that can cause if the email of the user was misspelled and went to a wrong person.</p>",
        "id": 289533,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1506669667
    },
    {
        "content": "<p>I think a better solution would be to list all the invites somewhere and make the users email used for the invitation as \"make admin\". So when the user logins in the first time it will be as admin. <br>\nI agree with <span class=\"user-mention\" data-user-email=\"rhtbot@protonmail.com\" data-user-id=\"2328\">@Rein Zustand</span>: This feature would be used rarely or mainly in dev environments where users log in to test stuff.</p>",
        "id": 289534,
        "sender_full_name": "Matthias",
        "timestamp": 1506669827
    },
    {
        "content": "<p>It's rare in the sense of most invites are not admin invites, but I think common in the sense that many orgs trying out zulip have the following pattern:</p>\n<ul>\n<li>Someone is tasked with trying a bunch of chat products out</li>\n<li>They send 1-2 possibilities up to their boss, who is the actual decision maker</li>\n<li>The boss is going to give like 10 min to investigating the product</li>\n</ul>\n<p>So I think it's worth doing even fairly \"rare\" things to make those 10 minutes as helpful as possible.</p>",
        "id": 289716,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1506703058
    },
    {
        "content": "<p>Mattias' idea is an interesting one.  I guess we'll see once we have an \"invite users\" page.  I think in the meantime it'd be reasonable to have a checkbox for this.</p>",
        "id": 289736,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1506703715
    }
]