[
    {
        "content": "<blockquote>\n<p>Restrict email domains of new users (i)  <br>\n[No restrictions]  <br>\n[Don’t allow disposable email addresses]  <br>\n[Restrict to a list of domains]<br>\nAnd then clicking the last one should show  <br>\nComma-separated list of allowed domains. Use *.example.com to include subdomains.  <br>\n[        long text box        ] </p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> For the last one, isn't our current modal is better here for managing the domains because while managing one domain in a <code>textbox</code> we can make mistake in another domain(like a typo and things can go wrong), Also we have to make many requests to the server just to edit/add a single domain, so are we sure to go with this approach or am I misunderstanding the mockup?</p>",
        "id": 553459,
        "sender_full_name": "Shubham Dhama",
        "timestamp": 1522692310
    },
    {
        "content": "<p>Fair enough. How about then, we show<br>\nAllowed domains: *.google.com, <a href=\"http://zulip.com\" target=\"_blank\" title=\"http://zulip.com\">zulip.com</a> [Change]</p>\n<p>And clicking Change opens the modal as it currently does.</p>",
        "id": 553505,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1522703175
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> What should be the behavior of dropdown under these conditions:</p>\n<ul>\n<li>\n<p>Currently, If there is no selected domain and if we check the checkbox it opens the modal automatically and if we \"cancel\"/\"add a domain\" it remains unchecked(we have to again check it to enable it). So what should be this behavior for dropdown. How about opening modal when we select \"restrict to list of domain\" and if we cancel it reset to the original value of dropdown i.e. show this option only when there are domains in the list.</p>\n</li>\n<li>\n<p>What should be behavior when removing all the domains from the list when \"restrict to list of domain\" option is already selected. Currently, it unchecks the checkbox so my suggestion here would be to save \"no restriction\" option automatically when there is no domain in list.</p>\n</li>\n</ul>",
        "id": 553913,
        "sender_full_name": "Shubham Dhama",
        "timestamp": 1522762167
    },
    {
        "content": "<p>that sounds great!</p>",
        "id": 553918,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1522764936
    }
]