[
    {
        "content": "<p>So there's a user experience question I'd like to figure out following the integration of <a href=\"https://github.com/zulip/zulip/pull/20866\">#20866</a>. Specifically, the vast majority of emails that Zulip sends are translated into the language used by the user who is receiving the email:</p>\n<ul>\n<li>For new account signups, we use the browser's configured default language.</li>\n<li>For emails to existing accounts, we use that user's configured language.</li>\n</ul>\n<p>The exception to this rule is new account invitation emails, where the only thing we know about the target user is their email address. Currently we send those using the default language for new users configured for the organization (<a href=\"https://zulip.com/help/change-the-default-language-for-your-organization\">https://zulip.com/help/change-the-default-language-for-your-organization</a>) unconditionally. This is probably better than always using English for communities that have a non-English primary language. </p>\n<p>On the one hand, that clearly seems more correct, in that if you know that the part of your community you're inviting today prefers French, you can do that.  But I've also never seen anything similar in other products, perhaps because invitation emails are all kinda the same -- there's a big button you click and then you can make your account.</p>\n<p>But it makes me wonder whether it'd be correct to have a language dropdown inside the \"Invite users\" UI to select what language to use in your invitation. I worry a bit that doing so might make the UI more unwieldy; but we can probably do a redesign that addresses that.</p>\n<p>Thoughts?</p>",
        "id": 1375528,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1651180921
    },
    {
        "content": "<p>That seems like it might clutter up the UI -- and I feel like we're already going farther than most other software in terms of sending those out in non-english <em>ever</em>.</p>\n<p>Though on reflection I don't actually know that at all -- my default languages have English at the top, so I wouldn't expect to ever get anything else even if the website is doing i18n on the outgoing email.</p>",
        "id": 1375688,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1651186957
    },
    {
        "content": "<p>I'm not sure it's worth the complexity either... I don't want users to get stuck on pondering the question of what language someone would prefer when sending an invite.</p>",
        "id": 1375961,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1651246356
    },
    {
        "content": "<p>So not just UI complexity, but the complexity of thinking through the answer, is what concerns me.</p>",
        "id": 1375962,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1651246382
    },
    {
        "content": "<p>Yeah, I agree. So I think we should leave this as-is. I suppose if someone really cares, they can go change the organization's default language when sending invitations and then change it back. The one action item there is that perhaps we should document on the /help/ pages about sending invitations that they are translated using the realm's notifications language, so that a sufficiently motivated individual can discover that detail.  (I think currently, it's only documented on the page explaining that language setting).</p>",
        "id": 1376052,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1651250732
    },
    {
        "content": "<p>Sure, <span class=\"user-mention\" data-user-id=\"21836\">@Lauryn Menard</span> would you be up for adding this to your to-do list (no rush)?</p>",
        "id": 1376063,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1651251078
    },
    {
        "content": "<p>How does this addition to the current help center article on <a href=\"help/invite-new-users\">inviting new users</a> look:</p>\n<p><a href=\"/user_uploads/2/3a/rCTtGCF12Sorek8DpnEYUcYM/Screenshot-from-2022-05-03-17-17-51.png\">Screenshot-from-2022-05-03-17-17-51.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/3a/rCTtGCF12Sorek8DpnEYUcYM/Screenshot-from-2022-05-03-17-17-51.png\" title=\"Screenshot-from-2022-05-03-17-17-51.png\"><img src=\"/user_uploads/2/3a/rCTtGCF12Sorek8DpnEYUcYM/Screenshot-from-2022-05-03-17-17-51.png\"></a></div>",
        "id": 1377247,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1651591148
    },
    {
        "content": "<p>New text is:</p>\n<blockquote>\n<p>Outgoing email invitations are translated and sent in the organization's <a href=\"help/change-the-default-language-for-your-organization\">notifications language</a>, so you may want to check (or update) that configuration before sending email invitations.</p>\n</blockquote>",
        "id": 1377248,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1651591214
    },
    {
        "content": "<p>I think that new text is good, but we might want a sentence before that just explaining what email invitations are; it feels a bit abrupt to discuss that detail right after the heading.</p>",
        "id": 1377370,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1651598868
    },
    {
        "content": "<p>Maybe changing the warning text as well to be part of an intro to the section?</p>",
        "id": 1377372,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1651599037
    },
    {
        "content": "<p>Well, that class of warning text is how we generally indicate permissions restrictions (E.g. for things that require an administrator).</p>",
        "id": 1377401,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1651604961
    },
    {
        "content": "<p>I've got <a href=\"https://github.com/zulip/zulip/pull/22014\">#22014</a> up as a draft for these updates.</p>",
        "id": 1379002,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1651858730
    }
]