[
    {
        "content": "<p>While working on an issue, I found that the current design of the topic list in the left sidebar topics has some space between them where the cursor is not pointing at any topic.</p>\n<p>I don't think this is intentional and could be fixed by some redistribution of padding.</p>\n<p><a href=\"/user_uploads/2/eb/g639_MhB6JWj0eI-quqPX4-N/1090-design-Zulip-Community-Zulip-Brave-2022-12-02-19-11-18.mp4\">1090-design-Zulip-Community-Zulip-Brave-2022-12-02-19-11-18.mp4</a></p>",
        "id": 1473027,
        "sender_full_name": "Hemant Umre",
        "timestamp": 1669988883
    },
    {
        "content": "<p>You are right about it. The new design implementation should fix that.</p>",
        "id": 1473051,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1669995012
    },
    {
        "content": "<p>I think this was actually an intentional decision. I don't know what's best but here's a few interaction details that motivated this:</p>\n<ul>\n<li>In the right sidebar, when you hover over a user row, we display a tooltip with extra details. Those tooltips can feel awkward when you're hovering the space between rows.</li>\n<li>It can be more annoying for a misclick on the boundary between rows to take you to the wrong view than to do nothing.</li>\n</ul>",
        "id": 1473212,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1670008367
    },
    {
        "content": "<p>I don't see any value in those tooltips actually</p>",
        "id": 1473779,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1670044659
    },
    {
        "content": "<p>They are potentially useful when the topic name doesn't fit.</p>",
        "id": 1473792,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1670049638
    },
    {
        "content": "<p>I meant in the right sidebar, they just showing the name of the person and the status which is already there</p>",
        "id": 1473883,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1670110519
    },
    {
        "content": "<p>Yeah we should rethink the right sidebar tooltips; they predated having a way to see the status text not on hover. I think they can show when the user was last present in more detail, and that'd be useful and justify them existing I think.</p>",
        "id": 1474933,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1670345855
    },
    {
        "content": "<blockquote>\n<p>I think they can show when the user was last present in more detail, and that'd be useful and justify them existing I think.</p>\n</blockquote>\n<p>I'm confused -- they already do that.</p>",
        "id": 1474950,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1670347436
    },
    {
        "content": "<blockquote>\n<p>they predated having a way to see the status text not on hover</p>\n</blockquote>\n<p>Note that this is a personal display setting, so not everyone sees the status text.</p>",
        "id": 1474951,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1670347465
    },
    {
        "content": "<p>Even if it is hidden, as default here (?), they also show long names/status if the end of that is hidden.</p>",
        "id": 1475018,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1670350362
    },
    {
        "content": "<p>I suppose it could show more up to date timing of when last online, for active/idle users?</p>",
        "id": 1475020,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1670350403
    },
    {
        "content": "<p>Yeah, you can mostly ignore my last message; was a bit distracted.</p>",
        "id": 1476460,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1670463808
    }
]