[
    {
        "content": "<p>Should we add a link-to-topic icon to the right of the topic in the recipient bar?<br>\nThat would make the feature a bit more discoverable.</p>",
        "id": 651036,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1539104594
    },
    {
        "content": "<p>Would this be any different from copying the link from the status bar. I see that theres a subtle difference where a \"near\" attribute is added. My natural inclination is to copy the url so I feel like a more important addition may be to make the near attribute work with the url.</p>\n<p>On a related note I feel like the down chevron on messages is really hard to click easily. I feel like those icons could become 30% bigger. Perhaps a down chevron next to the date on the topic heading regarding the feature you're proposing?</p>",
        "id": 651040,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1539105144
    },
    {
        "content": "<p>It would be the stream + topic link, so no \"near\" attribute.<br>\nI think the main problem with the URL is that people don't realize that the URL is a permalink.</p>",
        "id": 651041,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1539105256
    },
    {
        "content": "<p>I guess what i mean is that if the first message is selected that would be the \"near\". I feel like users are quite used to the url being consistent with state on the web. Specially tech oriented users. Anyhow, a down chevron at the top wouldn't hurt.</p>\n<p>Another small gripe for me is that we have no right-click menus throughout the app. For me this is a huge missed opportunity for usability. It can be as simple as activating the same dropdown as the down chevron when a message is right-clicked. Ditto for down chevrons everywhere. I always get annoyed having to hover over and then click the icon.</p>",
        "id": 651042,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1539105394
    }
]