[
    {
        "content": "<p>Something that's come up lately is that we have several places in our UI where we have (or will soon have) a list of messages that don't truly correspond to a \"message feed\" UI, i.e. you're not really viewing messages in the context of their original conversations:</p>\n<ul>\n<li>Starred messages</li>\n<li>Mentions</li>\n<li>keyword search results</li>\n<li>drafts</li>\n<li>scheduled messages (in a PR now)</li>\n</ul>\n<p>For the first three, we show <code>is:starred</code>, <code>is:mentioned</code>, and <code>search:lunch</code> as typical narrows, which can create confusion when you forget you're in that unique kind of narrow.</p>\n<p>For drafts, we still have our V1 UI that tries to render drafts as messages, but I find it very visually confusing. </p>\n<p>And for scheduled messages, we don't even have a proposed UI yet, but it made me think of the other stuff.</p>",
        "id": 425728,
        "sender_full_name": "Steve Howell",
        "timestamp": 1515098757
    },
    {
        "content": "<p>So I'm wondering if we want some kind of unified way of dealing with \"lists of messages\" that aren't single conversations or even interleaved conversations.</p>",
        "id": 425731,
        "sender_full_name": "Steve Howell",
        "timestamp": 1515098837
    },
    {
        "content": "<p>Would a cards view work? <a href=\"#narrow/stream/design/subject/new.20topic.20narrow/near/379474\" title=\"#narrow/stream/design/subject/new.20topic.20narrow/near/379474\">https://chat.zulip.org/#narrow/stream/design/subject/new.20topic.20narrow/near/379474</a></p>",
        "id": 425740,
        "sender_full_name": "Tommy Ip",
        "timestamp": 1515099064
    },
    {
        "content": "<p>It sort of depends on what you mean by \"cards,\" but I think a key thing would be to have visual separation (i.e. whitespace) between the messages, since adjacent messages in things like \"Starred messages\" aren't any more closely related to each other than non-adjacent messages.</p>",
        "id": 425765,
        "sender_full_name": "Steve Howell",
        "timestamp": 1515099578
    },
    {
        "content": "<p>I completely agree. Will potentially take a fair amount of design iteration, though.</p>",
        "id": 426082,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1515119735
    }
]