[
    {
        "content": "<p>The current behavior for Manage Streams is wonky when it comes to combing a filter and sort.  Suppose you use \"dev\" as the filter.  It will show all streams whose names match \"dev\" above all streams whose description matches \"dev\".  And then even if you sort by weekly traffic, the name-match streams will stay above the description-match streams.</p>\n<p>I think this might be an accident of the original implementation, but I'm not sure.</p>\n<p>I find the current behavior to be less than ideal.  If nothing else, we should have some kind of visual distinction between the streams that match on name vs. those that match on description.   Otherwise, users are likely to just think our sorts are broken.  Or, worse, they might not even realize that high-traffic streams are below the fold.</p>\n<p>Fortunately, most times that you apply a filter, you get pretty close to being able to fit all streams on the screen.</p>\n<p>But it would be nice to re-visit this.</p>",
        "id": 1120637,
        "sender_full_name": "Steve Howell",
        "timestamp": 1613655793
    },
    {
        "content": "<blockquote>\n<p>And then even if you sort by weekly traffic, the name-match streams will stay above the description-match streams.</p>\n</blockquote>\n<p>This certainly seems like a bug -- when you sort by weekly traffic, that should be the first sort key before anything else.  I'm not sure that the prioritization of name over description in sorting is wrong, though-- certainly I'm more interested in name matches than description matches, but want to see both categories.</p>",
        "id": 1121023,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1613683374
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> I think we just need a product decision here.  Here are the choices for the sort keys:</p>\n<ul>\n<li>(name-in-filter: bool, weekly_traffic: int) -- this is what we have now and seems clearly broken</li>\n<li>(weekly_traffic: int)  -- just keep it simple</li>\n<li>(weekly_traffic: int, name: str)</li>\n<li>(weekly_traffic: int, name-in-filter: bool, name: str) </li>\n</ul>\n<p>I'm inclined to the simple approach here, as I don't think tiebreakers come up much.</p>",
        "id": 1121190,
        "sender_full_name": "Steve Howell",
        "timestamp": 1613738864
    },
    {
        "content": "<p>I don't think I understand your notation for the options; can you explain them again?</p>",
        "id": 1123746,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1614221548
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> <code>(name-in-filter: bool, weekly_traffic: int)</code> means that the first \"key\" we check is whether the name is in the filter.  So a \"true\" match always go ahead of a \"false\" match.  And then the second key (tiebreaker) is the weekly traffic count.</p>",
        "id": 1123906,
        "sender_full_name": "Steve Howell",
        "timestamp": 1614253998
    },
    {
        "content": "<p>The simplest thing to do here is to just sort by weekly traffic.</p>",
        "id": 1123907,
        "sender_full_name": "Steve Howell",
        "timestamp": 1614254040
    },
    {
        "content": "<p>Sorting by weekly traffic if the user selected that makes sense; but don't we only display at all streams with names matching the filter, making the ordering of these operations irrelevant?</p>",
        "id": 1124360,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1614312997
    },
    {
        "content": "<p>I guess the point is if it's a weaker match on the filter (e.g. because the stream description, rather than the name matches)?  </p>\n<p>I think just sorting by weekly traffic if the user has selected that is probably fine.</p>",
        "id": 1124361,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1614313071
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/Manage.20Streams.20sort.2Ffilter/near/1124361\">said</a>:</p>\n<blockquote>\n<p>I guess the point is if it's a weaker match on the filter (e.g. because the stream description, rather than the name matches)?  </p>\n</blockquote>\n<p>Yes, that's exactly why we have the current behavior that just looks buggy.</p>\n<blockquote>\n<p>I think just sorting by weekly traffic if the user has selected that is probably fine.</p>\n</blockquote>\n<p>Good, I'll go with that.  (and similar for subscription counts)</p>",
        "id": 1124503,
        "sender_full_name": "Steve Howell",
        "timestamp": 1614338497
    }
]