[
    {
        "content": "<p>So, in <a href=\"https://github.com/zulip/zulip/pull/22893\">#22893</a> / <a class=\"stream-topic\" data-stream-id=\"378\" href=\"/#narrow/stream/378-api-design/topic/mark-as-unread.20request\">#api design &gt; mark-as-unread request</a>, we will be adding a new API for bulk-marking messages as read/unread. We will be able to use this to replace the existing \"Mark all messages as read\" feature, which currently has a pretty poor user feedback story.</p>\n<p>In the common case, the new API will just do what you asked, and we may not need feedback UI. </p>\n<p>But if you are asking to mark many thousands of messages as read/unread, it may take longer, and we probably need to notify the user about the status of their request somehow. What we'll be have from the API endpoint is:</p>\n<ul>\n<li>What the earliest and latest messages that've been processed are, and their timestamps.</li>\n<li>How many total messages have been modified.</li>\n</ul>\n<p>We will not know how many total messages the user asked to modify; computing that is too expensive.</p>",
        "id": 1462505,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668114525
    },
    {
        "content": "<p>One option for this is use the top-of-app banner feature we already have, that is currently used for things like the notice you get when the browser can't reach the Zulip server:</p>\n<p><a href=\"/user_uploads/2/5a/Fr1LFZ_anEfGLEsh-iWjsUsX/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/5a/Fr1LFZ_anEfGLEsh-iWjsUsX/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/5a/Fr1LFZ_anEfGLEsh-iWjsUsX/image.png\"></a></div><p>And have text for that of the form \"Marked 10231 messages as unread between Jan 2, 2021 and July 7, 2022\", and update the numbers/dates every time we process a batch of messages. We can probably tune the size of batches such that it updates every few seconds, and I'm imagining it should disappear on successful completion. (And I imagine we'd only show this banner at all in cases where we need to do multiple matches of 1K+ messages).</p>\n<p>Another option is to pop up a modal; I'm not thrilled with that option in that it's kinda in your face.</p>",
        "id": 1462508,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668114749
    },
    {
        "content": "<p>We need a design for this that's quick in that we're probably only going to have a couple days to implement it; so that's one reason using the existing banner system might be appealing. </p>\n<p><span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> thoughts?</p>",
        "id": 1462509,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668114846
    },
    {
        "content": "<p>I think a banner seems fine... A modal prevents users from doing other things in the meantime; my understanding is that they can keep using Zulip without interrupting the process.</p>",
        "id": 1462563,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668118795
    },
    {
        "content": "<p>For precise wording, something like this?</p>\n<h2>Mark as read</h2>\n<p>Marking all messages as read... X messages sent before January 2, 2022 have been marked as read so far.<br>\nMarking all messages in #stream as read... X messages sent (etc.)<br>\nMarking all messages in #stream &gt; topic as read... X messages sent (etc.)</p>\n<p>(The date is the closest we have to a progress marker without knowing the total number of messages.)</p>\n<h2>Mark as unread</h2>\n<p>Marking messages as unread...  X messages sent before January 2, 2022 have been marked as unread so far.</p>",
        "id": 1462564,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668119133
    },
    {
        "content": "<p>We should make sure there's a delay before we show the banner at all, so that we don't flash it unnecessarily. (I'm not sure what the right amount of time to wait is.)</p>",
        "id": 1462565,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668119172
    },
    {
        "content": "<blockquote>\n<p>We can probably tune the size of batches such that it updates every few seconds, and I'm imagining it should disappear on successful completion.</p>\n</blockquote>\n<p>We should probably leave up have a successful completion banner for clarity? Otherwise sounds good.</p>\n<blockquote>\n<p>All messages have been marked as read.<br>\nAll messages [in #stream] / [in #stream &gt; topic] have been marked as read.<br>\nMessages have been marked as unread.</p>\n</blockquote>",
        "id": 1462570,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668119346
    },
    {
        "content": "<p>I think I like having both dates just because you clicked \"mark as read from here\" and that's a \"messages after\" operation, so having a \"before date\" string feels confusing.</p>",
        "id": 1462607,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668123158
    },
    {
        "content": "<p>Yeah, I'm not sure. Giving the start date is more info for the user to process and try to figure out what to do with.</p>",
        "id": 1462611,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668123255
    },
    {
        "content": "<p>I believe <a href=\"https://github.com/zulip/zulip/pull/23512\">#23512</a> is available for the backend, so we can start implementing this; <span class=\"user-mention\" data-user-id=\"5140\">@Aman (amanagr)</span> do you have time to implement this in the next couple days?</p>",
        "id": 1463444,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668448342
    },
    {
        "content": "<p>Yes!</p>",
        "id": 1463467,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1668449039
    },
    {
        "content": "<p>Just adding a link to <a class=\"stream-topic\" data-stream-id=\"378\" href=\"/#narrow/stream/378-api-design/topic/mark-as-unread.20request\">#api design &gt; mark-as-unread request</a>, since there's some API details being hammered out there that you'll want to be current on for writing this.</p>",
        "id": 1464046,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668472069
    },
    {
        "content": "<p>I opened <a href=\"https://github.com/zulip/zulip/pull/23579\">#23579</a>, there are some details to finalize, but it is a good start IMO.</p>",
        "id": 1464372,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1668524398
    },
    {
        "content": "<p>This seems pretty good; I think the set of comments I posted should cover the remaining details to tweak.</p>",
        "id": 1464780,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668541863
    },
    {
        "content": "<p>I left a bunch of feedback on the PR (with a shoulder review from <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> as well). Thanks!</p>",
        "id": 1464960,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668549502
    },
    {
        "content": "<p><a href=\"http://chat.zulip.org\">chat.zulip.org</a> is now running the hopefully final version of this UI for 6.0.</p>",
        "id": 1466415,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668673791
    },
    {
        "content": "<p>I suppose that you need to mark 5K+ messages as unread to actually see it, though, so maybe not that helpful for folks who want to test <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 1466416,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668673856
    },
    {
        "content": "<blockquote>\n<p>Scrolling back to before Oct 13 or so (in all messages narrow) puts you at 5k+ messages if anyone wants to test.</p>\n</blockquote>",
        "id": 1466418,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1668673941
    },
    {
        "content": "<p>Some testing on <a href=\"http://chat.zulip.org\">chat.zulip.org</a> suggests that a bulk mark-as-read/unread batch takes about 1 second per 1k messages.</p>",
        "id": 1466419,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668674126
    },
    {
        "content": "<p>I think it's possible we should change the batch size to 1K messages at a time rather than 5k, at least on the client side to provide more immediate feedback.</p>",
        "id": 1466420,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668674148
    },
    {
        "content": "<p>12 messages were moved from this topic to <a class=\"stream-topic\" data-stream-id=\"378\" href=\"/#narrow/stream/378-api-design/topic/mark-as-unread.20request\">#api design &gt; mark-as-unread request</a> by <span class=\"user-mention silent\" data-user-id=\"5140\">Aman (amanagr)</span>.</p>",
        "id": 1466502,
        "sender_full_name": "Notification Bot",
        "timestamp": 1668687626
    },
    {
        "content": "<p>Playing with it with my alternate account on CZO, I think we should fix the fact that the first batch size is N+1, making all the message counts on the update banner end in 1. It really makes it look like the counter is buggy (which it's not, but that's how it makes it seem).</p>",
        "id": 1466553,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668702648
    },
    {
        "content": "<p>Hm, it seemed to be going fine 1000 at a time, and is now stuck at 49001. Is that a known issue?</p>\n<p>It got past it, but it took a really long time.</p>",
        "id": 1466554,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668702717
    },
    {
        "content": "<p>Looking at the server logs, I don't see any server requests that took longer than 1.1s for that account. So probably it was a networking delay when it got stuck, or maybe just the range; some batches were as fast as 250ms.</p>",
        "id": 1466555,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668702937
    },
    {
        "content": "<p>I suppose another possibility is that the frontend/browser is having a performance issue.</p>",
        "id": 1466556,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668703150
    },
    {
        "content": "<p>Things have generally been much slower since that happened.</p>",
        "id": 1466557,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668703423
    },
    {
        "content": "<p>Yeah I'm pretty sure this is a frontend live-update performance issue when marking a ton of messages unread at once. We can investigate with profiling, but probably not a big deal if we fix this in 6.1.</p>",
        "id": 1466559,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668703565
    },
    {
        "content": "<p>OK, for mark-as-unread, with recent topics visible, it's <code>recent_topics_ui.inplace_rerender</code> which we're calling for each newly unread message; probably we just want to switch to a full rerender of recent topics, at least if there's more than 10 messages in the event.</p>",
        "id": 1466560,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668703707
    },
    {
        "content": "<p>We have a similar issue with mark-as-read, but that'll require more care, since we definitely don't want to do a bulk operation when processing  small number of messages being marked as unread.</p>",
        "id": 1466561,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668704275
    },
    {
        "content": "<p>Merged <a href=\"https://github.com/zulip/zulip/commit/14e14c4d35cac002d9b59a8a7e6f64b70418227f\">14e14c4d35cac002d9b59a8a7e6f64b70418227f</a> to fix this in the mark-as-unread code path. We should open follow-up issues for optimizing the UI updates for both bulk mark-as-unread and bulk mark-as-unread, since I don't think either would be super hard to make efficient.</p>",
        "id": 1466569,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668704861
    },
    {
        "content": "<p>So I think we have two outstanding details here:</p>\n<ul>\n<li>Batch sizes. Ideally, I think we want the browser to request 1000 total (999 + the anchor) for its first batch and 2000 for batches after that, or something like it.</li>\n<li>The issue with muted streams not being fully covered in the \"mark all as read\" code path.</li>\n</ul>",
        "id": 1466613,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668706889
    },
    {
        "content": "<p>I can take care of batch sizes part right now.</p>",
        "id": 1466628,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1668707604
    }
]