[
    {
        "content": "<p>i see the mention background changed recently — overall i like this (the gradient was imo pretty ugly), but i find it a lot harder to notice mentions in messages now. could we make the background just a hair darker to make them stand out more?</p>",
        "id": 1124671,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1614363189
    },
    {
        "content": "<p>That’s another symptom of the clean-css regression that I fixed in <a href=\"https://github.com/zulip/zulip/pull/17416\">#17416</a>. <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> that should probably be deployed here when you get a chance.</p>",
        "id": 1124675,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1614363876
    },
    {
        "content": "<p>oh, i see <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> well, is it worth considering switching to using a flat grey background once that's merged in? i do think that would look a bit nicer, although if the change wasn't on purpose than there's a much stronger argument for keeping the status quo.</p>\n<p>also, excellent branch name btw :)</p>",
        "id": 1124685,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1614364320
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"17945\">@Wesley Aptekar-Cassels</span> I'd be curious to see what you have in mind as a visual prototype with screenshot.  We're always open to design tweaks but it'll be a lot easier to get feedback from the community with before/after screenshots.</p>",
        "id": 1125720,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1614642264
    },
    {
        "content": "<p>i'm a fan of how they look on mobile, just taking that CSS and putting it in the webapp would be good, i think:</p>\n<p><a href=\"/user_uploads/2/2e/MLG-Xjp_mOgtTTTksFsYTRqV/zulip-mobile-mention-tag.png\">zulip-mobile-mention-tag.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/2e/MLG-Xjp_mOgtTTTksFsYTRqV/zulip-mobile-mention-tag.png\" title=\"zulip-mobile-mention-tag.png\"><img src=\"/user_uploads/2/2e/MLG-Xjp_mOgtTTTksFsYTRqV/zulip-mobile-mention-tag.png\"></a></div>",
        "id": 1125846,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1614665659
    },
    {
        "content": "<p>I think that's actually what they used to look like in the webapp; I think we got complaints that the grey background for mentions looked ugly.  Might be worth doing a poll at some point, but I'd love some commentary from anyone reading this.</p>",
        "id": 1126084,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1614715659
    },
    {
        "content": "<p>Time widgets, mentions and silent mentions all have similar background color in the webapp, which IMO is a bit odd.<br>\nIn the mobile app, inline codeblocks also have a similar background color as those above.</p>",
        "id": 1126173,
        "sender_full_name": "Abhijeet Bodas",
        "timestamp": 1614742863
    },
    {
        "content": "<p>hmm, interesting. if that's the case, i think keeping it as is is fine — i mostly brought this up because i thought it was changing anyways.</p>\n<p>i personally think that the fact that time widgets/mentions/silent mentions looks the same is good, since they seem to me like the same category of thing (interactive/dynamic parts of a message)</p>",
        "id": 1126248,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1614772215
    }
]