[
    {
        "content": "<p>This topic was inspired by Alya's PR/issue link in <a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/.5BFeature.5D.20Remind.20me.20of.20this.20message\">#feedback &gt; [Feature] Remind me of this message</a>, simply since one consequence is adding further to the length of the message actions ('vdot') menu. For me on czo it is already 6, which feels like a lot (so would be 7, and maybe larger for admins?):</p>\n<ul>\n<li>View source / edit (e) [<strong>below I assume these are being or could be split</strong>]</li>\n<li>Quote / ... (&gt;)</li>\n<li>Mark as unread (m)</li>\n<li>Collapse (-)</li>\n<li>View read receipts</li>\n<li>Copy link to message</li>\n</ul>\n<p>I'm sure there have been many discussions on ordering the menu to prioritize the most common actions, but given the increasing length, <strong>multiple</strong> menus would seem to better support more direct access to the kind of action wanted. I understand that doing so could be against some UI guidelines, but perhaps the following is convincing or at least interesting :)</p>\n<h1>actions/info (~role)</h1>\n<p>My original thought for a split was <code>info</code> vs <code>actions</code> - the current menu is called <code>message actions (i)</code>, and the hotkey is like an <code>i</code> for information:</p>\n<ul>\n<li>info: view source, view read receipts (?), copy link to message</li>\n<li>actions (\"change the state/view of my zulip\"): edit, quote, mark as unread, collapse</li>\n</ul>\n<p>An unexpected benefit from this is how the info category relates to web-public streams (~spectators), vs actions if you have an account, so the actions menu might just be hidden if not logged in (though view read receipts is awkward there). That also hints at different menus per role, so eg. an admin menu with delete message. That could be visible only for users with those roles, or extra permissions associated with their user group(s), and also clarify that these are additional features related only to extra roles/permission(s). There are a few actions that change (rename/move topic?), which could be tricky and constrain moving in this direction, or suggest other UI.</p>\n<h1>personal/public (~action visibility/safety)</h1>\n<p>The alternative categories I considered were more along the lines of how broadly the effects of the info/changes would be visible:</p>\n<ul>\n<li>\"personal\": info (view source, view read receipts?, copy link to message), mark as unread, collapse</li>\n<li>\"public\": edit, quote</li>\n</ul>\n<p>This split emphasizes how some actions don't affect what other users see while others do, and so other than visibility also confers an aspect of 'safety' based on the menu being used. I'm not convinced this distinction is otherwise always clear to users, and so could be useful. This split works well with the other quick message actions not in the menu: stars (\"personal\") and reactions (\"public\"), so that could inform a layout/design for grouping the menus with those two non-menu 'quick' actions.</p>\n<h1>Combinations &amp; practicality</h1>\n<p>As per the grouped section in \"personal\", and basing this on broader roles, these ideas could be variously combined:</p>\n<ul>\n<li>info (~spectators? \"message information (i)\")</li>\n<li>personally visible actions (~personal state; include read receipts here? \"message view\", \"change my message view\")</li>\n<li>actions visible beyond me (~external state; \"use(?) this message\")</li>\n<li>extra actions (~moderator/admin/...; \"&lt;role&gt; actions\" or \"extra message actions\")</li>\n</ul>\n<p>Obviously 4 root menus plus star and react (6) would be UI-heavy/complex compared to right now (3), so I know it'd be quite a change to move to that without serious thought. However, as above, one could only be visible for moderators/admins, or given action overlaps/modifications, integrated into the preceding menu, at least for now. More broadly the groupings above could be combined into 2 or 3 menus, but with internal dividers/rulers for such kinds of sections (at risk of reducing the prioritized-at-top layout we currently have).</p>\n<p>At an extreme, I'd consider it could look like the following (square brackets indicating visual groupings), or perhaps even with other icons for 'default' actions in each group - 'copy message link'=link, for info?</p>\n<div class=\"codehilite\"><pre><span></span><code>[info-menu-icon link]   [view-menu-icon star]    [use-menu-icon react]    [extra-menu-icon]\n</code></pre></div>\n<p>(or possibly for layout reasons, reversed, such that groups build in increasing role/visibility from the right side)</p>\n<p>To simplify from there, one has to consider what categories are most useful: roles, visibility, or both - or none! Interested to hear :)</p>",
        "id": 1429889,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1662159198
    },
    {
        "content": "<p>good ideas, agree to have some logic behind ordering and grouping. What do you think <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> ?</p>",
        "id": 1430053,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1662218164
    },
    {
        "content": "<p>I think I actually suggested to <span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> a week or two ago that we probably want something like that last proposal: For 3-4 actions in the menu to be represented as (relatively large, so the click targets are nice) square icons in a row at the top, rather than as textual items, to help keep the size of that menu under control.</p>",
        "id": 1433313,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1662768614
    },
    {
        "content": "<p>I definitely agree with the problem statement! (Note that <a href=\"https://github.com/zulip/zulip/pull/22537\">#22537</a> splits \" View source / Move message\" into 2 separate items.)</p>",
        "id": 1434786,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1663092760
    },
    {
        "content": "<p>In general, the challenge with creating additional menus is that the user then has to figure out what menu to go to for what they need, so organizing/restructuring a single menu seems like a more promising direction to me.</p>",
        "id": 1434789,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1663092936
    },
    {
        "content": "<p>Following up on Tim's proposal, how about something like this as a way to organize it?</p>\n<p><strong>Icons</strong>: Edit message [if allowed], Move message [if allowed], Add emoji reaction, Copy link to message</p>\n<p>Note that the design would have to look reasonable with 2, 3 or 4 icons, since the actions will vary based on permissions.</p>\n<p><strong>List</strong>: <br>\n<strong>[public actions]</strong><br>\nQuote and reply or forward<br>\nDelete message</p>\n<p><strong>[personal reading experience actions]</strong><br>\nMark as unread from here<br>\nSchedule a reminder [when implemented]<br>\nCollapse message</p>\n<p><strong>[get more info actions]</strong><br>\nView message source<br>\nView edit history<br>\nView read receipts</p>",
        "id": 1434804,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1663093830
    },
    {
        "content": "<p>The following items may be missing from the menu, based on permissions:</p>\n<p>Edit message<br>\nMove message<br>\nDelete message<br>\nView edit history<br>\nView read receipts</p>",
        "id": 1434807,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1663093933
    },
    {
        "content": "<p>Is this proposal suggesting the top of the single menu structured a little like the following?</p>\n<div class=\"codehilite\"><pre><span></span><code>[edit icon] [move icon] [emoji icon] [link icon]\n---\nquote\ndelete\n---\nmark unread\n...\n</code></pre></div>\n<p>Would that move the reaction icon into the menu? What about starring? Or is the idea to have those icons outside of the menu, with starring?</p>\n<p>Would there be headings in the menu (list), or was that to indicate the groups to us only? </p>\n<p>I agree that restructuring one menu is simpler on the surface than figuring out how to enable users to identify which menu to use (or which things are menus). However, I'm not yet convinced that having those groups together in one menu is going to make it clearer; sections can be distinguished with eg. styling or dividers, but unless we use titles to identify the groups, the grouping goes unexplained - and if we use titles then the menu gets even larger.</p>",
        "id": 1435142,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1663134031
    },
    {
        "content": "<blockquote>\n<p>Is this proposal suggesting the top of the single menu structured a little like the following?</p>\n</blockquote>\n<p>Yep!</p>\n<blockquote>\n<p>Would that move the reaction icon into the menu? What about starring? Or is the idea to have those icons outside of the menu, with starring?</p>\n</blockquote>\n<p>I was thinking we'd leave the icons outside the menu as-is. Note that the icon to the left is emoji for other people's messages, but something else (depending on permissions) for your own. It's probably simplest to keep the three-dot menu constant no matter what that icon happens to be.</p>",
        "id": 1435144,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1663134357
    },
    {
        "content": "<blockquote>\n<p>Would there be headings in the menu (list), or was that to indicate the groups to us only?</p>\n</blockquote>\n<p>Definitely for us only. :)</p>",
        "id": 1435146,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1663134420
    },
    {
        "content": "<p>I was imagining styling/dividers for the groups, yeah.</p>",
        "id": 1435152,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1663134469
    },
    {
        "content": "<p>Yeah, I didn't factor in the edit vs react priority of icons.</p>",
        "id": 1435189,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1663137529
    },
    {
        "content": "<p>Otherwise, as above, while I think groups in one menu could be worth experimenting with, we'd lose the priority order right now vs group ordering with this. For separate menus, icons/tooltips would describe groups and provide ordered priority access to shorter lists, but with one menu we'd need to find another way to convey grouping to indicate jumping n elements down.</p>",
        "id": 1435190,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1663137557
    },
    {
        "content": "<p>That organization sounds plausible. I think \"Delete message\" could go into the icons at the top if 5 works visually, or I could imagine that \"get more info\" set of items actually be a similar row of icons at the bottom, if we don't feel it looks good after that design.</p>",
        "id": 1437066,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1663371360
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"22433\">@Vlad Korobov</span> would you be up for playing with redesigning the three-dot message menu in this direction?</p>",
        "id": 1437173,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1663391053
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/Message.20actions.20per.20role.2Fvisibility/near/1437173\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> would you be up for playing with redesigning the three-dot message menu in this direction?</p>\n</blockquote>\n<p>I would like to talk it through during 1-1</p>",
        "id": 1437402,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1663473015
    },
    {
        "content": "<p>To close the loop here, <span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> proposed just organizing the menu into sections to start with, as using icons may not reduce cognitive load much. <strong>Organize three-dot message menu</strong> <a href=\"https://github.com/zulip/zulip/pull/23076\">#23076</a> is the issue for that.</p>\n<p>We're also considering removing a couple of options from the three-dot message menu:</p>\n<ul>\n<li>\"View edit history\" after <strong>Improve tooltip on \"Edited\" / \"Moved\"</strong> <a href=\"https://github.com/zulip/zulip/pull/23075\">#23075</a> is completed (issue: <a href=\"https://github.com/zulip/zulip/pull/23077\">#23077</a>). Users will still be able to access message edit history by clicking on \"Edited\" / \"Moved\".</li>\n<li>\"Collapse message\", which is used quite rarely, but we should probably resolve issues around disabling animation in GIFs / emoji first. There would still be a keyboard shortcut for collapsing messages.</li>\n</ul>",
        "id": 1442438,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1664431658
    },
    {
        "content": "<p>I also filed <strong>Add \"Quote and reply or forward\" button to message bar</strong> <a href=\"https://github.com/zulip/zulip/pull/23100\">#23100</a> for another idea, which would let us remove the top section of the reorganized three-dot menu. Please speak up if you have any concerns.</p>",
        "id": 1442817,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1664477628
    },
    {
        "content": "<p>One complication with <a href=\"https://github.com/zulip/zulip/pull/23077\">#23077</a> (removing \"View edit history\" from the 3-dots menu) is that it will become impossible to navigate to edit history using the keyboard. </p>\n<p>I suppose a possible answer would be to make a keyboard shortcut for accessing message edit history, perhaps <code>Shift+H</code> would be a reasonable choice for the level of frequency that one expects users to interact with? I feel like reserving plain <code>H</code> for something more prominent is probably a good idea. (<code>H</code> is also the <code>vim</code> style left key, but we don't do anything with that outside \"Recent conversations\").</p>\n<p><span class=\"user-mention\" data-user-id=\"24862\">@Palash Baderia</span> FYI since you're working on that.</p>\n<p>(In theory some version of <a class=\"stream-topic\" data-stream-id=\"6\" href=\"/#narrow/stream/6-frontend/topic/tabbing.20to.20hover.20controls.3F\">#frontend &gt; tabbing to hover controls?</a> would be a different answer, but I think a keyboard shortcut might be better -- it seems like a totally reasonable thing to have a shortcut for)</p>",
        "id": 1615072,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1690231150
    },
    {
        "content": "<p>Sounds good! <code>Shift+H</code> would be a great addition. I will implement this and push it into the same PR, removing the option from the 3-dot menu.</p>",
        "id": 1615097,
        "sender_full_name": "Palash Baderia",
        "timestamp": 1690232056
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24862\">@Palash Baderia</span> sounds good!</p>",
        "id": 1615179,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1690236598
    },
    {
        "content": "<p>here is the updated PR: <a href=\"https://github.com/zulip/zulip/pull/26245\">#26245</a></p>",
        "id": 1617242,
        "sender_full_name": "Palash Baderia",
        "timestamp": 1690502994
    }
]