[
    {
        "content": "<p>Is it right that most experienced users use <code>r</code>/<code>enter</code>/clicks to reply to messages?<br>\n<strong>If so</strong>, how about this - we have an actual text box at the bottom, which would be pretty barebones and allow you to send a message only to the topic of the selected message. New users would first see this and immediately know where to type, and old users can still use it to send short and quick messages. And we can make that text area expand into the normal compose box if the message gets too long. And we can (as it is now) have <code>r</code> and <code>enter</code> trigger the normal, full-fledged compose box, to still satisfy advanced users.</p>",
        "id": 1164518,
        "sender_full_name": "Abhijeet Bodas",
        "timestamp": 1618577252
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16839\">@Abhijeet Bodas</span> Can we move that idea to an alternate topic?  I don't really agree with your solution, but I don't want to move this topic too far away from discussions that are more about tweaking the current plan?</p>",
        "id": 1164557,
        "sender_full_name": "Steve Howell",
        "timestamp": 1618579296
    },
    {
        "content": "<p>Ok, moved this here. Would love to know why you think that would be a bad idea.</p>",
        "id": 1164607,
        "sender_full_name": "Abhijeet Bodas",
        "timestamp": 1618584380
    },
    {
        "content": "<p>Mostly, I don't think advanced users actually want this.  It's nice to have the compose box closed when you're in reading mode, and if you want to reply, just hit enter, and the compose box is automatically focused at a useful size.  Having the compose box open but unfocused has an awkwardness to it.</p>\n<p>Beyond that, I just think improving the buttons is a more incremental change here.</p>",
        "id": 1164610,
        "sender_full_name": "Steve Howell",
        "timestamp": 1618584772
    },
    {
        "content": "<p>(This discussion was digressed from <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/bottom.20row.20design\">#design &gt; bottom row design</a>.)</p>",
        "id": 1164611,
        "sender_full_name": "Steve Howell",
        "timestamp": 1618584839
    },
    {
        "content": "<p>I was proposing a small text input strip inside the already present bottom row, not a complete box as such. The strip could the  naturally expand into what currently is the compose box, once the message reaches a certain length.</p>",
        "id": 1164613,
        "sender_full_name": "Abhijeet Bodas",
        "timestamp": 1618585274
    },
    {
        "content": "<p>Basically just <a href=\"#narrow/stream/101-design/topic/bottom.20row.20design/near/1150116\">https://chat.zulip.org/#narrow/stream/101-design/topic/bottom.20row.20design/near/1150116</a>, with it being actually a place where you can type stuff.</p>",
        "id": 1164614,
        "sender_full_name": "Abhijeet Bodas",
        "timestamp": 1618585385
    },
    {
        "content": "<p>a (different) idea that has come up is having that small text box, but having it open the full compose box (possibly in an animated fashion) when it gets keyboard focus. it's kind a have-your-cake-and-eat-it-too solution to this whole coversation. the UX is probably a little convoluted (having the other buttons disappear on a focus event).</p>",
        "id": 1164631,
        "sender_full_name": "Ken Clary",
        "timestamp": 1618586345
    },
    {
        "content": "<p>Animations here have a downside that you (at least may feel like you) have to wait for the animation to finish before typing; that's IIRC the reason we open the compose box the way we do today.</p>",
        "id": 1165003,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1618602509
    },
    {
        "content": "<p>Well this sparked some harsh words on our instance, apparently the compose box defaults to collapsed more now? But </p>\n<p>I was thinking that the new fake textfield would work better if it didn't look like a disabled text field. I think it's just a matter of background color: <a href=\"/user_uploads/2/a7/Cx0v-AwcfuyZ_YTa4O90GxIW/image.png\">image.png</a>  (I don't think that has any accessibility issues?)</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/a7/Cx0v-AwcfuyZ_YTa4O90GxIW/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/a7/Cx0v-AwcfuyZ_YTa4O90GxIW/image.png\"></a></div>",
        "id": 1174246,
        "sender_full_name": "Thomas Fini Hansen",
        "timestamp": 1620202911
    },
    {
        "content": "<p>We didn't change any behaviour for compose box. It is same as it used to be. Just the <code>Reply</code> button was renamed.</p>",
        "id": 1174247,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1620203005
    },
    {
        "content": "<p>Maybe some other change? I thought I saw something about the box being refactored a bit. I have one user that's convinced that clicking on a stream would have the compose box be expanded, with the last topic selected.</p>",
        "id": 1174248,
        "sender_full_name": "Thomas Fini Hansen",
        "timestamp": 1620203347
    },
    {
        "content": "<p>In any case, wouldn't it be more clear with a white background?</p>",
        "id": 1174249,
        "sender_full_name": "Thomas Fini Hansen",
        "timestamp": 1620203541
    },
    {
        "content": "<p>the distinction is that it is (still) a button, not a textbox. it's just the old <code>reply</code> button, with new placement and a new, dynamic label</p>",
        "id": 1174265,
        "sender_full_name": "Ken Clary",
        "timestamp": 1620215765
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14517\">@Thomas Fini Hansen</span> For context, we've had some back and forth on whether a regular button or a button that looks like a fake text box is a better approach. The first version we tested out on this server was closer to what you suggest. See this thread for discussion: <a href=\"#narrow/stream/101-design/topic/bottom.20row.20design/near/1163796\">https://chat.zulip.org/#narrow/stream/101-design/topic/bottom.20row.20design/near/1163796</a></p>",
        "id": 1174284,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1620217521
    }
]