[
    {
        "content": "<p>Hey! I was looking at the missed message email, and it wasn't immediately clear to me what would happen if I replied to the email. I.e. I wasn't sure whether it would send a reply in Zulip (which is indeed the case), or if my email would go into the void, or what.</p>\n<p>Currently, the footer says: <code>Reply to this email directly, view it in Zulip, or manage email preferences.</code> This is copied  directly from Github, but of course not all of our users also use Github.</p>\n<p>If you click 'Reply', for a missed PM, the <code>to</code> field says <code>Zulip ([long random string]@[Zulip domain, e.g. chat.zulip.org])</code>.</p>\n<p>Chatting with <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> , a couple of ways we could try to address this might be:</p>\n<ol>\n<li>Changing the <code>to</code> name to be something like <code>Tim Abbott (via Zulip)</code> to make it more clear that a reply would got to Tim. (Or a list of names for group PMs?)</li>\n<li>Expanding the help center to describe this behavior (probably by adding a section <a href=\"help/message-a-stream-by-email\">here</a>), and potentially including a \"Help\" link in the footer.</li>\n</ol>\n<p>What do other folks think about whether this is a problem, and if so, how we should tackle it?</p>",
        "id": 1148015,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1617147181
    },
    {
        "content": "<p>Also, I'm not sure how exactly the email looks for missed stream messages; I don't think I have any in my inbox.</p>",
        "id": 1148017,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1617147229
    },
    {
        "content": "<p>With regards to point 1 for the group pms, anti-spam systems may not take kindly to a list of names, as they could interpret it as suspicious.</p>",
        "id": 1148019,
        "sender_full_name": "Adam Birds",
        "timestamp": 1617147403
    },
    {
        "content": "<p>Would certainly work well for single PMs, similar to the way ebay/amazon do some of their 3rd party seller emails with the name being the name of the seller/customer.</p>",
        "id": 1148024,
        "sender_full_name": "Adam Birds",
        "timestamp": 1617147490
    },
    {
        "content": "<p>Mm, interesting. Do you know how we would research/test the list of names spam filtering concern?</p>",
        "id": 1148035,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1617148129
    },
    {
        "content": "<p>We could test it with test emails, but the issue is it could be accepted fine by office 365, proofpoint to name two, but could be denied by gmail for example, as they all use their own different algorithms to identify suspicious and spam messages. There's also the issue of, what limit of names would we use when a group pm includes 10+ people, it wouldn't be reasonable to put all 10 names as wouldn't be easy readable in an email client. And even if we did do it because the tests using <a href=\"http://zulipchat.com\">zulipchat.com</a> or <a href=\"http://chat.zulip.org\">chat.zulip.org</a> filters through fine (because they are established domains so therefore have more trust naturally). But for a new installer of xulip, whose domain may be new, or doesn't get much traffic, it can be hard enough to get the zulip emails to not be classed as Junk even with the current format of Name of sender in the from header.</p>",
        "id": 1148042,
        "sender_full_name": "Adam Birds",
        "timestamp": 1617148873
    },
    {
        "content": "<p>Yeah, I think we could treat group PMs more like streams for this purpose -- I'm not sure my email client with display \"Full Name 1, Full Name 2, and Full Name 3 (via zulip)\" nicely anyway.</p>",
        "id": 1148063,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1617150094
    }
]