[
    {
        "content": "<p>There has been a very detailed discussion already about whether we should include a font within the mobile app in various mediums (in <a href=\"https://github.com/zulip/zulip-mobile/pull/2447\" target=\"_blank\" title=\"https://github.com/zulip/zulip-mobile/pull/2447\">#M2447</a>, and in CZO at <a href=\"#narrow/stream/48-mobile/subject/input.20height.20discrepancy/near/572286\" title=\"#narrow/stream/48-mobile/subject/input.20height.20discrepancy/near/572286\">#mobile &gt; input height discrepancy</a> -- please go through those if possible). I wanted to shift the discussion to here to get the opinions of the entire community and partially also to revive it. There is another point I would like to add before starting this discussion -<br>\n- As I mentioned in <a href=\"https://github.com/zulip/zulip-mobile/pull/3533\" target=\"_blank\" title=\"https://github.com/zulip/zulip-mobile/pull/3533\">#M3533</a>,</p>\n<blockquote>\n<p>I think [it] is a very good thing to do because of other reasons as well -- primarily because every messaging app now-a-days has a unique font, which adds a certain unique flavor to it, although what font to choose might be a huge debate in itself.</p>\n</blockquote>\n<p>For example, Discord and Slack.</p>\n<p>Here's an overview of the other reasons which can be found in the provided links as well.<br>\n- There are several bugs which exist with react native itself, where custom fonts provided by the device doesn't scale properly to fit the boxes the app provides for the text to be placed.<br>\n- </p>\n<blockquote>\n<p>Fonts differ in how much vertical padding they build in -- for the sake of ascenders and descenders in Latin letters, or more so for some other scripts like देवनागरी that use more vertical space -- and that can cause the same text widget, with all the same properties right down to the font size, to lay out with a different height when given a different font. That in turn makes it quite difficult to design a layout that consistently looks right.</p>\n</blockquote>\n<p>-</p>\n<blockquote>\n<p>An extreme example is <a href=\"https://github.com/zulip/zulip/pull/2365\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/2365\">#2365</a> -- a component we get from one of our dependencies comes out completely broken with the default font on certain devices.</p>\n</blockquote>",
        "id": 762932,
        "sender_full_name": "Isham Mahajan",
        "timestamp": 1562159564
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"11657\">@Isham Mahajan</span> we're very happy with the SourceSans Pro font we have used in the webapp since the early days.  If the mobile app isn't consistently using that, it probably should switch to that for consistency.</p>",
        "id": 763217,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1562212190
    },
    {
        "content": "<p>That makes sense. I'll look into switching to SourceSans Pro. Do you agree with the need and that the extra size of the app is worth adding the font?</p>",
        "id": 763274,
        "sender_full_name": "Isham Mahajan",
        "timestamp": 1562218243
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"11657\">@Isham Mahajan</span> I definitely would not worry about app size for adding the single font we use everywhere.</p>",
        "id": 763898,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1562284690
    },
    {
        "content": "<p>(It's small enough to be reasonable to include in the webapp)</p>",
        "id": 763899,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1562284706
    }
]