[
    {
        "content": "<p>How about we put a working mockup in home page rather than keeping a screenshot? Users can play with Zulip in <a href=\"http://zulipchat.com\" target=\"_blank\" title=\"http://zulipchat.com\">zulipchat.com</a> home page and get a feel of Zulip. <br>\nWe don't have to keep the entire UI(probably just the stream sidebar and message viewport. )</p>",
        "id": 567755,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1524381762
    },
    {
        "content": "<p>Kind of like <a href=\"https://quilljs.com\" target=\"_blank\" title=\"https://quilljs.com\">https://quilljs.com</a>.</p>",
        "id": 567756,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1524381897
    },
    {
        "content": "<p>Also we can make use of the hotspots to explain what exactly the UI is.</p>",
        "id": 567757,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1524382145
    },
    {
        "content": "<p>Oh interesting, you mean this, but just have the stream and topic links in the left sidebar work?</p>",
        "id": 567758,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1524382188
    },
    {
        "content": "<p>Yup. A mockup the same as the screenshot you created but users should be able to interact with it.</p>",
        "id": 567759,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1524382286
    },
    {
        "content": "<p>cool, that's a great idea. Will work on a draft of it.</p>",
        "id": 567760,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1524382510
    },
    {
        "content": "<p>I really like that idea. Having said that I do feel that <em>requiring</em> interaction may be more than what is necessary for a user to get the relevant information out of it. I would more favor a 3 - 5 second animated loop showcasing the benefits of the threading model and in the process also showcasing the UI.  In general, from a non-demo page, we should aim to minimize the effort it requires for a user to capture the maximum possible information.</p>\n<p>On a related note -- I really think there should be a link on the top nav that says <em>Demo</em>. Thats almost immediately the first link I look for when going to a product website and when I don't find one it almost always means I mark that as a negative in my head.</p>",
        "id": 567764,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1524388791
    },
    {
        "content": "<p>I guess to be more clear the main problem is I have no idea how to demo the product. On slack it clearly guides you to \"Create a workspace\" or \"Find workspaces you can join\" .... on <a href=\"http://zulipchat.com\" target=\"_blank\" title=\"http://zulipchat.com\">zulipchat.com</a> it says \"Find Accounts\" which on entering the site for the first time makes no sense to me instead of something like a Try ZulipChat link to <a href=\"http://chat.zulip.org\" target=\"_blank\" title=\"http://chat.zulip.org\">chat.zulip.org</a> or another realm that serves Demoing customers.</p>",
        "id": 567765,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1524390141
    },
    {
        "content": "<p>That's true; our CTA is see plans and pricing, which we should reconsider.</p>",
        "id": 567808,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1524416406
    },
    {
        "content": "<p>and yeah, I think starting with a gif loop makes sense, since that's a pre-req for the interaction in any case :).</p>",
        "id": 567809,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1524416453
    }
]