[
    {
        "content": "<p>We recently changed the loading spinner in couple of modals, like delete-message modal and the modal that appears when the user deactivates own account. The spinner is shown in the GIF <a href=\"/user_uploads/2/cb/27ohBYojovm3lhajuPl4k1Fu/deactivate.gif\">deactivate.gif</a>.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/cb/27ohBYojovm3lhajuPl4k1Fu/deactivate.gif\" title=\"deactivate.gif\"><img src=\"/user_uploads/2/cb/27ohBYojovm3lhajuPl4k1Fu/deactivate.gif\"></a></div><p>In the previous loading spinner design, both the cancel and confirm buttons were hidden to show the spinner. In the current modal, if the request is processing we disable the <code>Confirm</code> button to avoid user clicking more than once but the <code>Cancel</code> button is enabled. If the user clicks <code>Cancel</code> button, only modal closes but the actual action still completes, which might confuse the user that clicking on <code>Cancel</code> means stop the requested action.</p>\n<p>What we should do to handle this case? Do we want to disable the Cancel button also or we can hide the cancel button. And in case the request fails, the button can be enabled/displayed again.</p>",
        "id": 1219079,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1624607580
    },
    {
        "content": "<p>For \"deactivate\" we should grey out both buttons, IMO. There's not much you'd want to do while the modal is going if you just deactivated your account.</p>",
        "id": 1219234,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1624638923
    },
    {
        "content": "<p>There's also the \"x\" button, which is probably a better choice for closing the box while continuing the action that was started</p>",
        "id": 1219235,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1624638972
    },
    {
        "content": "<p>In some cases, the best thing might be to close the box and continue doing the action in the background by default. (This makes reporting errors a bit trickier, though)</p>",
        "id": 1219236,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1624639036
    },
    {
        "content": "<p>There are only two modals as of now for which we keep waiting till the request is completed, and they are delete message and deactivate own account modal and they are also pretty quick so we actually do not show the indicator for long.</p>",
        "id": 1219273,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1624646420
    }
]