[
    {
        "content": "<p>Hey folks! We have a few things that happen automatically when messages get moved, which depend on how the user selected what messages to move.</p>\n<p><a href=\"/user_uploads/2/bf/E1pVsIcuCujRnhShFsj0_mtG/Screen-Shot-2022-10-18-at-11.22.40-AM.png\">Screen-Shot-2022-10-18-at-11.22.40-AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/bf/E1pVsIcuCujRnhShFsj0_mtG/Screen-Shot-2022-10-18-at-11.22.40-AM.png\" title=\"Screen-Shot-2022-10-18-at-11.22.40-AM.png\"><img src=\"/user_uploads/2/bf/E1pVsIcuCujRnhShFsj0_mtG/Screen-Shot-2022-10-18-at-11.22.40-AM.png\"></a></div><p>If you move all messages in a topic (whether via the message menu or the \"move topic\" menu), we move muted topics to the new topic.</p>\n<p>If you move all messages or \"this and all following messages\", we:</p>\n<ol>\n<li>Move saved drafts to the new topic.</li>\n<li>For anyone who has the compose box open to the old topic, automatically change their compose topic to the new onw.</li>\n<li>Renarrow users viewing the old topic to the new topic.</li>\n</ol>",
        "id": 1451905,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1666117557
    },
    {
        "content": "<p>All three of these behaviors are probably good defaults when all messages are moved, but this is less clear when only \"this and all following messages\" are moved.</p>",
        "id": 1451908,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1666117635
    },
    {
        "content": "<p>For example, if there is an ongoing discussion, a new community member accidentally mis-posts to the topic, and someone moves their message, it's more likely that 1/2/3 above should <em>not</em> happen. Because the default option for moving messages is \"move this and following\", that option is likely to be used even if there's just one message to move.</p>",
        "id": 1451913,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1666117930
    },
    {
        "content": "<p>If there is a conversation that went off on a tangent, and someone is splitting the topics, we really don't know what the user intent was for where they want to post.</p>",
        "id": 1451914,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1666117978
    },
    {
        "content": "<p>If the original conversation has mostly died down, and just the tangent is being actively discussed, it's likely that users are actually trying to engage with the new topic.</p>",
        "id": 1451915,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1666118061
    },
    {
        "content": "<p>(Note also that \"move this and all following messages\" is currently the action performed by editing the topic name in the message header bar, but we should probably just change it to move all messages after <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/time.20restrictions.20on.20topic.20editing\">#design &gt; time restrictions on topic editing</a> is figured out.)</p>",
        "id": 1451916,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1666118132
    },
    {
        "content": "<p>So... are there things we should change about how all this works? Some options include:</p>\n<ul>\n<li>Being more conservative with any of 1/2/3, and only applying it when all messages are moved.</li>\n<li>Changing the default for moving messages, e.g. defaulting to \"Move only this message\" when moving the last message in a topic, to try to have the right thing happen more often in the mis-post case. (Of course, this won't help if there are a handful of mis-posted messages at the end of the topic.)</li>\n<li>Asking more explicitly what the user's intent is, either the user who is moving messages, or the user who is interacting with the topic that had messages moved. E.g. we could ask whether to redirect your draft to the new topic when you open it (but this would be a bunch of work to implement).</li>\n</ul>",
        "id": 1451918,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1666118490
    },
    {
        "content": "<p>There is tension here between \"it's nice when the app magically does the right thing\", \"the app should have predictable behavior\", and \"don't ask me too many questions\".</p>",
        "id": 1451924,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1666118557
    },
    {
        "content": "<p>I would expect that if only some messages are moved, a draft I haven't sent yet won't be moved. It feels like \"move this and later\" is just a shortcut for \"move only this message\" several times. I'd feel similarly about 2 and 3. If I expected a message to stay in a topic and it got moved, that would feel like a bug. </p>\n<p>I'm curious to hear a perspective from someone who would find keeping drafts/composebox/narrows with the old topic not only inconvenient but surprising (or \"buggy\").</p>",
        "id": 1451972,
        "sender_full_name": "Evy",
        "timestamp": 1666123872
    },
    {
        "content": "<p>I'm also curious why <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/time.20restrictions.20on.20topic.20editing\">#design &gt; time restrictions on topic editing</a> is a blocker. We could update <code>propagate_mode: \"change_later\"</code> to <code>\"change_all\"</code> in <code>save_inline_topic_edit</code> -- it feels like the time restrictions could work around that and probably should in its design.</p>",
        "id": 1452021,
        "sender_full_name": "Evy",
        "timestamp": 1666131032
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/343-kandra-errors/topic/JS.20error.3A.20drafts.20error.20with.20new.20topic/near/1451838\">said</a>:</p>\n<blockquote>\n<p>But if we figure out a general confirmation dialog pattern for when the user is trying to move some messages that are too old to move (see <a href=\"#narrow/stream/101-design/topic/time.20restrictions.20on.20topic.20editing/near/1449227\">here</a>), we could make the recipient bar topic-edit widget try to move all the messages in the topic, and pop up a confirmation when appropriate.</p>\n</blockquote>\n<p>Ah, maybe this is relevant.</p>",
        "id": 1452022,
        "sender_full_name": "Evy",
        "timestamp": 1666131097
    },
    {
        "content": "<p>I have a pretty consistent opinion that \"rename topic\" should act as if there was a topic table with ids, and the topic's name simply changed. I think it would be confusing for a user to try to rename a topic and get a popup about moving messages -- I believe fairly strongly that most users don't really connect these two ideas (though I don't have data to back this up, it's just my own biased intuition). </p>\n<p>My take is: if they're able to move all messages then the edit button should be there, and if not then it's hidden. That feels simplest. Trying to fix a typo in the topic name by moving only some of your messages feels like it would be pretty annoying/confusing.</p>",
        "id": 1452024,
        "sender_full_name": "Evy",
        "timestamp": 1666131230
    },
    {
        "content": "<blockquote>\n<p>Ah, maybe this is relevant.</p>\n</blockquote>\n<p>Our enforcement of moving permissions is currently buggy, and changing that button to \"change_all\" would exacerbate how often the bugginess affects users.</p>",
        "id": 1452051,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1666134584
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"21453\">Evy</span> <a href=\"#narrow/stream/101-design/topic/moving.20messages.20automatic.20behavior/near/1452024\">said</a>:</p>\n<blockquote>\n<p>My take is: if they're able to move all messages then the edit button should be there, and if not then it's hidden. That feels simplest.</p>\n</blockquote>\n<p>Yes, I agree. :) That was my original proposal <a href=\"#narrow/stream/101-design/topic/time.20restrictions.20on.20topic.20editing/near/1448750\">here</a> in the linked thread, but this turns out to be quite difficult from a technical perspective.</p>",
        "id": 1452052,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1666134714
    },
    {
        "content": "<p>So we're moving forward with a solution that fixes the permissions bugs and disentangles message editing from topic editing, even though it's not perfect.</p>",
        "id": 1452054,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1666134802
    },
    {
        "content": "<p>Ah okay, that makes sense! Thanks for letting me know.</p>",
        "id": 1452068,
        "sender_full_name": "Evy",
        "timestamp": 1666135544
    },
    {
        "content": "<p>So first the bug fix, so that this doesn't cause more issues, then this fix goes on top of that. Sounds good!</p>",
        "id": 1452069,
        "sender_full_name": "Evy",
        "timestamp": 1666135566
    }
]