[
    {
        "content": "<p>There's been some talk about this in <a class=\"stream\" data-stream-id=\"3\" href=\"/#narrow/stream/backend\">#backend</a>, but moving the discussion here.<br>\nWith the \"emails can be used in multiple realms\" feature, our current system for how we do non-subdomains login and registration is not going to work. Two proposals:<br>\n1. You log-in and register at links like domain.tld/login/realm_str and domain.tld/register/realm_str.<br>\n2. Remove the \"multiple realms without subdomains\" feature.</p>\n<p>Pros of 1</p>\n<ul>\n<li>Less of a breaking migration for existing installations that use multiple realms without subdomains.</li>\n<li>Faster installation process for multi-realm installations (don't need to register subdomains)</li>\n<li>Logged-in URL is slightly nicer (no subdomain).</li>\n</ul>\n<p>Pros of 2</p>\n<ul>\n<li>multi-realm non-subdomains seems like a misfeature to me. The fact that you can only log in to one realm at a time is going to feel permanently broken to anyone in more than 1 realm. I can't think of a multi-realm situation where I would recommend using non-subdomains.</li>\n<li>The faster installation is in itself a misfeature, I think, in that it'll tempt people to do non-subdomains, which is the wrong state to be in long term.</li>\n<li>There's a decent amount of work needed to make (1) work: new login url route, making sure all the weird login paths work with the new url routes, changing the old login and registration templates to do the right thing, making sure find my team does the right thing, making the registration page explain the subdomain field properly, etc. </li>\n<li>For non-subdomains installations, bot emails are nicer in the single-realm case, since the bot emails can look like <a href=\"mailto:bot@chat.zulip.org\" title=\"mailto:bot@chat.zulip.org\">bot@chat.zulip.org</a>, instead of <a href=\"mailto:bot@realm_str.chat.zulip.org\" title=\"mailto:bot@realm_str.chat.zulip.org\">bot@realm_str.chat.zulip.org</a>.</li>\n<li>The installation process for single-realm, non-subdomains can be completely streamlined for the single-realm case. E.g. we can stop requiring email confirmation for the first-in-realm in this case, which would allow you to try out zulip even before you get your outgoing email working. </li>\n</ul>\n<p>I do have some fondness for the multi-realm non-subdomains case; it's unique to zulip, and we've invested a ton of effort in writing and maintaining it. But as is probably clear from the above, I'm in favor of (2), despite the potentially awkward migration. (I also wouldn't be surprised if there are only something like 0-5 active organizations using the multi-realm non-subdomains feature.)</p>\n<p>Thoughts?</p>",
        "id": 257020,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1501006462
    },
    {
        "content": "<p>This seems like the main issue:</p>\n<blockquote>\n<p>multi-realm non-subdomains seems like a misfeature to me. The fact that you can only log in to one realm at a time is going to feel permanently broken to anyone in more than 1 realm. I can't think of a multi-realm situation where I would recommend using non-subdomains.</p>\n</blockquote>",
        "id": 257023,
        "sender_full_name": "Greg Price",
        "timestamp": 1501006829
    },
    {
        "content": "<p>I agree that only being able to log into one realm at a time is going to feel pretty broken to anyone in more than 1 realm.</p>\n<p>I think if we were to continue to support multi-realm non-subdomain installs, in a future (which is the near future) where it'll be a lot of work to do so and not a matter of inertia, it'd have to be with a plan for that to be a good experience in the future. Which I think would mean some way to be logged into multiple realms at once.</p>",
        "id": 257024,
        "sender_full_name": "Greg Price",
        "timestamp": 1501007142
    },
    {
        "content": "<p>That's not impossible -- witness Google accounts, and also Dropbox.</p>\n<p>It's also pretty hard to get right -- ditto.</p>",
        "id": 257025,
        "sender_full_name": "Greg Price",
        "timestamp": 1501007175
    }
]