[
    {
        "content": "<p>When I want to see all the (public) messages that another user has send, I use a pull-down next to the other user's name, and then select \"View messages sent\".</p>\n<p>If I want to see all the messages I have sent, I either have to:</p>\n<p>1. Enter the search string \"sender:me\" in the appropriate stream (or home).<br>\n2. Click on my own name in any message I've sent, then select \"View messages sent\".</p>\n<p>Both methods are not all intuitive. It took quite a while to figure this out. It would be much more obvious and consistent to include either my own name, or \"me\" in the list of users so that the same approach is used across all users, to find private messages, sent messages, etc.</p>",
        "id": 229403,
        "sender_full_name": "Edmund Lian",
        "timestamp": 1497572083
    },
    {
        "content": "<p>Interesting!</p>\n<p>I think it'd be reasonable to include the user's own name in the list of users on the right -- it'd provide a nice and obviously-parallel way to do those things and also see how your own profile box (with profile picture, etc.) appears to other users.</p>",
        "id": 229404,
        "sender_full_name": "Greg Price",
        "timestamp": 1497572379
    },
    {
        "content": "<p>Thanks for the feedback!<br>\nFor viewing the messages sent by another user, I think the fastest method is probably <code>/</code> to get to the search bar, and then start typing the first few characters of the users name. <br>\nTo see all the messages you've sent, you can hit <code>/</code> to get to the search bar, and then start typing \"sent\".</p>\n<p>Regardless, I think there are possibly plans to put some sort of popover related to the user's own name in the user list, once we've implemented things like \"away status\" that you could set.</p>",
        "id": 229405,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1497572486
    },
    {
        "content": "<p>Another way to get to the messages you yourself sent, which I find the easiest: hit <code>/</code> to start searching, then start typing \"sent\", then hit down-enter to pick \"Sent by me\" from the dropdown.</p>",
        "id": 229406,
        "sender_full_name": "Greg Price",
        "timestamp": 1497572495
    },
    {
        "content": "<p>Ah, much like Rishi just said. :-)</p>",
        "id": 229407,
        "sender_full_name": "Greg Price",
        "timestamp": 1497572505
    },
    {
        "content": "<p>The original thought process behind removing the user from their own buddy list was this:</p>\n<ul>\n<li>It was a slight waste of space, since you already knew you were online.</li>\n<li>We were planning to have a special widget for the user to do \"me\" kind of things (Rishi gave a good example, which is setting your away status, plus maybe show your avatar).</li>\n</ul>\n<p>We haven't gotten around to having the special widget.  I don't think the space savings is that big a concern.  So it's possible we should do either of the following:</p>\n<ul>\n<li>Just add the user back to the buddy list (it's about 15 lines of easy code to change, including tests, I'm guessing).</li>\n<li>Build a nice widget for the user, showing their avatar, having a dropdown to view messages they sent, and then have room to build out future bells and whistles like setting away statuses, etc.)</li>\n</ul>",
        "id": 229408,
        "sender_full_name": "Steve Howell",
        "timestamp": 1497572928
    },
    {
        "content": "<p>We'll also want to add \"yourself\" somewhere to support things like \"setting do not disturb mode\"</p>",
        "id": 229433,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1497575821
    }
]