[
    {
        "content": "<p>One unfortunate thing I've noticed is that <code>n</code> followed by <code>s</code> will often mark a ton of stuff as read, especially when <code>n</code> goes to a topic in a new stream. So that's one argument for having <code>n</code> (or our general navigation) go to the \"last read\" message, rather than the first unread.</p>\n<p>I know this is a tricky change, so just putting it out there.</p>",
        "id": 366095,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1512503058
    },
    {
        "content": "<p>I just experienced this also :/</p>",
        "id": 366103,
        "sender_full_name": "Joshua Pan",
        "timestamp": 1512503189
    },
    {
        "content": "<p>oh cool, I thought it was just me. That increases my estimate on whether we should work on this, especially given the upcoming <a href=\"https://github.com/zulip/zulip/pull/7555\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/7555\">#7555</a>.</p>",
        "id": 366127,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1512503662
    },
    {
        "content": "<p>What?</p>",
        "id": 366197,
        "sender_full_name": "Linas etc.",
        "timestamp": 1512507312
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"rishig@zulipchat.com\" data-user-id=\"131\">@Rishi Gupta</span> Fortunately, I think only one half of this tricky.  The \"n\" logic is complicated, but it shouldn't be affected by this change, except for the one line it calls into <code>narrow.js</code>.  We just need to tell the narrowing code go to last-read.  I don't know hard that is off the top of my head.</p>",
        "id": 366357,
        "sender_full_name": "Steve Howell",
        "timestamp": 1512516949
    },
    {
        "content": "<p>I seem to remember some discussion about more generally making all renarrows go to last unread, and there being some worry about various corner cases. But it's possible the discussion was more around it being \"one day hard\" rather than \"one hour hard\".</p>",
        "id": 366359,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1512517030
    },
    {
        "content": "<p>It's possible this is a prerequisite for <a href=\"https://github.com/zulip/zulip/pull/7555\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/7555\">#7555</a> essentially, at least for topic narrows.</p>",
        "id": 366362,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1512517134
    },
    {
        "content": "<p>I guess another possibility here is that when you \"widen\" with \"s\", we should just go the first unread for the stream, rather than keeping your pointer on the same message.</p>",
        "id": 366376,
        "sender_full_name": "Steve Howell",
        "timestamp": 1512517522
    },
    {
        "content": "<p>oh, interesting. yeah, that might be a good change regardless, and similar for Esc'ing to home view.</p>",
        "id": 366386,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1512517748
    },
    {
        "content": "<p>I almost never widen, but when I just tried it, as I scrolled up, I still saw some unread messages (they become read as soon as they come into view, but I could see the green bar before it faded).</p>",
        "id": 366395,
        "sender_full_name": "Steve Howell",
        "timestamp": 1512518015
    },
    {
        "content": "<p>For me it's super important sometimes that widening with something like <code>s</code> stays on the same message. Especially when coming from a search.</p>",
        "id": 366570,
        "sender_full_name": "Greg Price",
        "timestamp": 1512526145
    },
    {
        "content": "<p>Yeah, that's fair, <span class=\"user-mention\" data-user-email=\"greg@zulipchat.com\" data-user-id=\"2187\">@Greg Price</span>.  I think our unread logic just may have a bug, or the mechanism of making things become read (and the quick fade that may be too subtle) as people page up is also possibly just confusing, since they will feel like all the messages above were unread.</p>",
        "id": 367513,
        "sender_full_name": "Steve Howell",
        "timestamp": 1512570190
    },
    {
        "content": "<p>Not totally sure, but I think the cases where it marks everything as read for me is when <code>s</code> takes me to ~the end of the stream narrow. (vs when there are still lots of messages \"below the fold\")</p>",
        "id": 368341,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1512585005
    },
    {
        "content": "<p>Hmm, that seems plausible -- because we do have some special logic for if you're so close to the end that what's left should all be in view. (Or something like that.)</p>",
        "id": 368559,
        "sender_full_name": "Greg Price",
        "timestamp": 1512590154
    },
    {
        "content": "<p>I don't think I've actually seen the case you mentioned in the OP -- where hitting <code>s</code> after <code>n</code> causes everything else to be marked read. I definitely see the opposite, where I do that and there are unread messages both right before and after the one with my cursor, and they stay unread unless I start moving the cursor over them.</p>",
        "id": 368561,
        "sender_full_name": "Greg Price",
        "timestamp": 1512590227
    },
    {
        "content": "<p>okay, I am more confident in the assessment from my last message. </p>\n<ul>\n<li>If there is nothing \"below the fold\", everything is marked as read</li>\n<li>else, it does correct-seeming behavior</li>\n</ul>\n<p>To repro, hit <code>n</code> into a stream where the most recent topic has only 1 unread message. In that case, that message is also guaranteed to be the most recent one in the stream. Hit <code>s</code>. For me, it will mark everything in the stream as read.</p>",
        "id": 371882,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1512718433
    },
    {
        "content": "<p>Ouch. Yeah, that sounds really annoying.</p>",
        "id": 374230,
        "sender_full_name": "Greg Price",
        "timestamp": 1512762041
    },
    {
        "content": "<p>Did this discussion end up with any action?  .</p>",
        "id": 462388,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1516744400
    },
    {
        "content": "<p>It did not. I suspect the right solution here is to have things like our current <code>A</code> or <code>D</code> (or keyboard navigation of the left sidebar) where <code>n</code> followed by \"go one row/stream up\" does the desired thing</p>",
        "id": 462414,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1516744852
    }
]