[
    {
        "content": "<p>When I click with the mouse in the left column to select a different stream which has a new message count, all topics for that stream are listed but all new message counts for the various topics in that stream disappear (in my Linux desktop client , and in my windows Firefox web client, on my own server and on this Zulip Community server). I can not see which topics had new messages. </p>\n<p>Is this by design? </p>\n<p>It seems to me that the new message count for a topic should only disappear if I have opened the topic. I should at the least be able to see which topics have new messages when I select a stream: one of the main Zulip features I thought. Have I missed something, or a setting?</p>",
        "id": 804942,
        "sender_full_name": "Tom Welter",
        "timestamp": 1577634079
    },
    {
        "content": "<p>That is definitely not by design; something is going wrong.</p>",
        "id": 805006,
        "sender_full_name": "Cyphase",
        "timestamp": 1577686818
    },
    {
        "content": "<p>Something very strange.</p>",
        "id": 805007,
        "sender_full_name": "Cyphase",
        "timestamp": 1577686868
    },
    {
        "content": "<p>Perhaps I have hit a bug or a weird design consequence. I just installed the windows client: same problem but not always, really confusing. I will  'report an issue'  (in the help menu)</p>",
        "id": 805013,
        "sender_full_name": "Tom Welter",
        "timestamp": 1577704015
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14319\">@Tom Welter</span> is this happening when there's &lt;5 unread messages?  One possible explanation is that you're marking the messages as read because they are all appearing onscreen after you click.</p>",
        "id": 805237,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1577755415
    },
    {
        "content": "<p>I was not aware of this '&lt; 5' rule. I just checked and that seems to be it. In addition, if there are fewer than 5 new messages but a  long message is blocking the view of some of these new messages, than these invisible are not subtracted from the new message count.  In that case the &lt;5 rule does not apply.</p>\n<p>So It is a ' weird' design consequence, not a bug..<br>\nI am worried that this design will confuse new users (i.e. my colleagues) starting to use Zulip, and not just me. This is true especially in a  test period when there are few new (short, test) messages, and  when they are focused on the new message count in a stream because that is 'the new thing', rather than on reading the messages .</p>\n<p>People will sooner say \"I don't get it, this software does not work\" than \"Geee, what an unexpected design consequence, I will change my behavior\"</p>\n<p>Consider the following work flow:</p>\n<ul>\n<li>user has one topic open in stream A</li>\n<li>affer a while notices that new messages have come in for stream B</li>\n<li>user selects stream B to see for which topics new messages have come in.</li>\n<li>user decides not to read these topics (yet) and switches back to stream A</li>\n</ul>\n<p>When stream B was opened , the new message count was decreased by at least one. However the user did not necassarily see  the message(s).</p>\n<p>The entire new message count (and all  the benefits) may be gone before you know it If you do this a few times. It is also immediately gone if here is just a few single messages in separate topics.</p>\n<p>Suggestion:<br>\nMake a settings option to disable automatic 'message is read' marking when selecting a stream (or  'all messages' for that matter). This would only mark messages as read when you 'blue box' it while using the keyboard (arrow of 'n') or mouse, and after selecting a topic. </p>\n<p>There would be two modes for marking messages in an entire stream as read, depending on user preference:</p>\n<ul>\n<li>Traditional way of reading messages by stream : mark all messages in a stream as read when you open the stream </li>\n<li>Zulip way of reading messages by topic : restrict marking messages read to those which you have actually (actively) seen in the stream, and to those that are under a topic that was selected.</li>\n</ul>\n<p>Does this make sense?</p>",
        "id": 805309,
        "sender_full_name": "Tom Welter",
        "timestamp": 1577791710
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14319\">@Tom Welter</span> I am totally with you on disliking our unread behavior when you open a stream.  I have always wanted making a message be unread require some stronger form of consent from the user than just clicking on a stream.</p>\n<p>I don't think the rule is actually \"&lt; 5\", though.  I think Tim was just using 5 as a small-ish number, and he was really just asking if all your unread messages would have been onscreen.  At least, I hope that's the case.</p>",
        "id": 805315,
        "sender_full_name": "Steve Howell",
        "timestamp": 1577793160
    },
    {
        "content": "<p>We actually tried disabling this feature as an experiment as a couple years ago, and people complained.  Which isn't to say we have given up on improving the experience.  As you suggest, this might be a situation where we need a user setting to accommodate different user preferences.</p>",
        "id": 805316,
        "sender_full_name": "Steve Howell",
        "timestamp": 1577793266
    },
    {
        "content": "<p>You are right  about the 5, it also removes 6  messages if they are small enough to be on screen.</p>\n<p>It is indeed a matter of preference when to mark messages read. But if I am confused my co-workers certainly will be as well. They (and I) would like to treat unread topics (or messages when viewed in a stream) just like unread mails: keep them unread as a kind of to do list. For that they should remain unread until the topic (or specific message)  is visited.</p>\n<p>Complains about disabling the feature seems like people where still hanging on to the traditional way of chat, not really embracing the Zulip way <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> <br>\nIt is really not easy to accommodate to ways  of doing things at the same time.</p>",
        "id": 805317,
        "sender_full_name": "Tom Welter",
        "timestamp": 1577794504
    },
    {
        "content": "<p>For simplicity we have this with Zulip-terminal right now, though you'd need to use the development version to get the topics list implemented over the Summer. Personally I find it easier to track, but ZT is (more) keyboard focused which perhaps changes the feel of the UI.</p>",
        "id": 805793,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1577898484
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"2406\">@Neil Pilgrim</span>  I did not fully  understand your message but I installed the zulip terminal which looks like a console version of the Zulip desktop client with basically the same behavior.  Did you mean that the dev version of ZT in addition to that also has a list of topics per stream without opening the stream itself (and as a consequence marking messages as read) ?</p>",
        "id": 805795,
        "sender_full_name": "Tom Welter",
        "timestamp": 1577903523
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"58\">@Steve Howell</span>  <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>  Best wishes for 2020! </p>\n<p>I tested with the android app on a tablet. The experience was not good: about 15 messages from 4 diferent topics were marked  'read'  when opening the stream (small characters on relatively big screen). This obscured  the topics with new messages.</p>\n<p>As a result of this design users are regularly forced to find their new messages in the 'stream view' in stead of by topic. Users may even miss messages altogether.<br>\nIt seems really strange that a Zulip feature would cause this.</p>\n<p>Do you think my <a href=\"#narrow/stream/101-design/topic/new.20message.20count.20disappearance/near/805309\" title=\"#narrow/stream/101-design/topic/new.20message.20count.20disappearance/near/805309\">suggestion</a>  to make it optional to mark messages as read when opening a stream has any chance of being implemented? </p>\n<p>I looked into the development version but it seems a stretch for me to alter the code to achieve this.</p>",
        "id": 805798,
        "sender_full_name": "Tom Welter",
        "timestamp": 1577907384
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14319\">@Tom Welter</span> To clarify, l use the dev version of ZT day to day, and it marks one message read when selecting a stream/topic/user (ie. a zulip narrow). However unreads are unaffected by showing list of topics.</p>",
        "id": 805804,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1577912285
    },
    {
        "content": "<p>(we have a few outstanding unreads bugs, but it is usable as is)</p>",
        "id": 805805,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1577912354
    },
    {
        "content": "<p>FYI <a href=\"https://github.com/zulip/zulip/pull/10886\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/10886\">#10886</a> tracks the broader issue here.</p>",
        "id": 805813,
        "sender_full_name": "Steve Howell",
        "timestamp": 1577913771
    },
    {
        "content": "<p>thanks, it is clear it is on the radar.</p>",
        "id": 805822,
        "sender_full_name": "Tom Welter",
        "timestamp": 1577915078
    },
    {
        "content": "<p>It's good to get another data point.  There was a time a couple years ago when I was using Zulip in a particularly busy period (we were doing Google Code-In and supporting a bunch of high school students), and it drove me <strong>nuts</strong> every time I opened a stream.  You can star messages as somewhat of a workaround, but it's not really practical when streams are really busy.</p>\n<p>A much better workaround (that didn't exist a couple years ago) is to use the <code>n</code> hotkey.  Do you and your team know about this?</p>",
        "id": 805823,
        "sender_full_name": "Steve Howell",
        "timestamp": 1577915378
    },
    {
        "content": "<p>(The <code>n</code> keys goes directly to the \"next\" topic that has unread messages.  It's not a perfect workaround--it doesn't let you dictate which order you read messages--but it does allow you to clear your inbox one topic at a time.  I tend to use this, try to deal with things immediately if possible, and then star messages I can't deal with.)</p>",
        "id": 805825,
        "sender_full_name": "Steve Howell",
        "timestamp": 1577915527
    },
    {
        "content": "<p>I noticed earlier that  keyboard 'n' does not have the  the 'mark as read' problem so explicitly. but did  not want to clutter my message with too much text, which is difficult for me.</p>\n<p>However,  most (Windows) users will navigate with the mouse from one topic to the other and will not listen to my advice to use a keyboard. workaround  <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> <br>\nThey will also shutdown the client regularly so that is starts up in 'all messages' the next time they use it......</p>\n<p>I can personally live with these workarounds. The point is that I have to  'sell' a solution like Zulip in our organisation. At the moment they use Yammer but there are enough complaints and we can not integrate Yammer in our software stack. To sell Zulip I must make a smooth and simple presentation and this issue  is standing in the way of that.  I would also like  some ' house style' colors or the interface but that is an entirely different topic.</p>\n<p>It's a shame: (so) close, but no cigar (yet)</p>",
        "id": 805845,
        "sender_full_name": "Tom Welter",
        "timestamp": 1577917423
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"2406\">@Neil Pilgrim</span>  Yes, I  noticed that that ZT marks one message read when opening a stream just like the desktop client. If you do that a few times you loose the unread messages counts for that stream. I like a console version but i have to use it a little to see what happens when walking along the list of topics before making a selection.</p>\n<p>BTW: color is a somewhat strange, the selected/active message in the main column is light grey text surrounded by a sea of bright white text. It does not stand out, I have to look carefully to find the active message.</p>",
        "id": 805846,
        "sender_full_name": "Tom Welter",
        "timestamp": 1577918256
    },
    {
        "content": "<blockquote>\n<p>I would also like some ' house style' colors or the interface.</p>\n</blockquote>\n<p>We do offer customizing the logo on the top left, but if you want to use some custom colors, modifying them is easy if you're self-hosting.</p>",
        "id": 805847,
        "sender_full_name": "Rohitt Vashishtha",
        "timestamp": 1577918357
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14319\">@Tom Welter</span> That happens if you just enter a stream, but if you use the <code>t</code> key when on a stream then it toggles into a topics list.</p>",
        "id": 805848,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1577918588
    },
    {
        "content": "<p>Re ZT colors, this can depend upon the colors you have in your terminal, particularly if they are customized. If you are interested in discussing this, I'd recommend joining the <a class=\"stream\" data-stream-id=\"206\" href=\"/#narrow/stream/206-zulip-terminal\">#zulip-terminal</a> stream.</p>",
        "id": 805849,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1577918660
    },
    {
        "content": "<p>I think we do need to do something better here, but I'm not sure what the right model is.  We'll need to do some experiments, I think.</p>",
        "id": 806245,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1578090863
    },
    {
        "content": "<p>FWIW I want exactly what Tom is proposing here.  Please don’t mark my messages as read when I am clicking on a stream in the left sidebar.  I don’t know what the right solution is, but hopefully the problem statement is clear.</p>",
        "id": 806255,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578091853
    },
    {
        "content": "<p>I think potentially the direction we want to go for mouse users is something along these lines:<br>\n(1) Integrating your \"All unreads\" view user experience.<br>\n(2) Making the behavior for clicking on a stream in the sidebar just open the list of topics for that stream (without changing the narrow), while preserving the behavior for what happens if you end up in a <code>stream:foo</code> narrow.<br>\n(3) Maybe something similar to (2) for clicking on \"Private messages\"</p>",
        "id": 806256,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1578091990
    },
    {
        "content": "<p>I'm not sure how to sequence these things and am a bit backlogged, but I think that would avoid creating an inconsistent experience about when scrolling through messages marks them as read by just directing users away from <code>stream:foo</code> narrows when catching up on message history.</p>",
        "id": 806257,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1578092057
    },
    {
        "content": "<p>I really don’t think #1 is the answer.</p>",
        "id": 806258,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578092178
    },
    {
        "content": "<p>#1 solves some problems but not this one.</p>",
        "id": 806259,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578092236
    },
    {
        "content": "<p>It is really as simple as allowing users to navigate to topics from the sidebar without unwanted side effects.  Whether or not the topic you care about has unread messages.</p>",
        "id": 806261,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578092346
    },
    {
        "content": "<p>I think #1 would make the problem less important (by moving reading of unread messages to another view), but I agree it doesn't actually fix the problem.</p>",
        "id": 806263,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1578092395
    },
    {
        "content": "<p>#2 is closer to the solution</p>",
        "id": 806266,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578092559
    },
    {
        "content": "<p>Great to see you all discussing this topic!</p>\n<p>I agree with Steve on the 'simple solution' which is no side effects when opening/viewing  a stream.  I consider a stream as a place where topics are grouped together( Go Zulip!). This is in contrast, i think , to what traditional or 'stream view' readers see in a stream: a collection or stream of messages, possibly with a handy topic to get related messages together . <br>\nFor me, topics are the prime 'go to'  place to read messages, and the stream can sometimes be convenient to go to a topic but should not be the main place to automatically mark messages as read. That would be convenient when i have selected a topic.</p>\n<p>However, this is a user  preference. Zulip does both, but the two preferences seem incompatible sometimes. I am not sure if both preferences can be accommodated within one model for reading the messages.  Until that is sorted out,  a user preference setting for this specific issue would help.</p>",
        "id": 806271,
        "sender_full_name": "Tom Welter",
        "timestamp": 1578093906
    },
    {
        "content": "<p>regarding (2): why would you not change the narrow if a stream is selected? I think clicking on it indicates that the stream is important enough to show its' messages. But do not assume the user is reading the messages that are  on screen because in that situation there may be further (or no) topic selection following.</p>",
        "id": 806273,
        "sender_full_name": "Tom Welter",
        "timestamp": 1578094318
    },
    {
        "content": "<p>I am also fine with the interleaved view.  Just don’t mark messages as read. 😔</p>",
        "id": 806275,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578094490
    },
    {
        "content": "<p>And to Tim’s point #3, same thing applies for private messages.</p>",
        "id": 806276,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578094563
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"1406\">@Rohitt Vashishtha</span> <span class=\"user-mention\" data-user-id=\"58\">@Steve Howell</span> <br>\nI made a new version of the routine  <code>can_mark_messages_read</code> in <code>static/js/filter.js</code><br>\nThanks Rohitt for guiding me in the right direction! This routine works for me sofar but is probably not production ready.<br>\nThe nice thing is that I can now decide to only mark messages as read when suficiently zoomed in to a topic or person (for private messages). All of the 'topic interleaved' views can now allow cursory scanning of messages without altering the unread message count. The message count remains intact as a sort of todo list.  You can select in which 'view' messages can be marked as read.</p>\n<ul>\n<li>specific sets of parameter values allow to deduce which selection was made in the left side-bar (stream, topic, mentions, all messages etc) I do not now if I have used the best method because I do not know if this routine is used in other situations for which my version is not suited.</li>\n<li>5 booleans are used to configure which left-sidebar selection will allow mark-as-read to occur. I suppose these booleans should be configurable in per-user settings screen.</li>\n<li>take care to not lock yourself out of marking messages as read.</li>\n<li>I use the length of the <code>operators</code> array to seperate streams from topics, which seems a very  ugly hack to  me.  </li>\n<li>there is a reference to <code>`elem.operand === 'all'</code> which I never encountered when testing for possible parameter value combinations. It was already in the original code. I ussumed  it refers to a selection of 'all messages' </li>\n<li>I probably messed up with the boolean negation, but it is bed time now :)</li>\n</ul>\n<div class=\"codehilite\"><pre><span></span>can_mark_messages_read: function () {\n    // These booleans decide which message listing allow mark-as-read\n    let mark_read_in_all_messages = false;      // all messages\n    let mark_read_in_priv_messages = false;     // all private messages\n    let mark_read_in_person_messages = true;    // private messages from one person\n    let mark_read_in_stream = false;        // topic interleaved messages in a stream\n    let mark_read_in_topic = true;          // messages in a topic\n        let is_a_topic = this._operators.length &gt; 1;    // most probably a topic selection\n\n        return !(_.every(this._operators, function (elem) {\n          return !(  (elem.operator === &#39;is&#39; &amp;&amp; elem.operand === &#39;private&#39; &amp;&amp; mark_read_in_priv_messages )\n                  || (elem.operator === &#39;in&#39; &amp;&amp; elem.operand === &#39;all&#39; &amp;&amp; mark_read_in_all_messages )\n                  || (elem.operator === &#39;in&#39; &amp;&amp; elem.operand === &#39;home&#39;  &amp;&amp; mark_read_in_all_messages )\n                  || (elem.operator === &#39;is&#39; &amp;&amp; elem.operand === &#39;private&#39;  &amp;&amp; mark_read_in_priv_messages )\n                  || (elem.operator === &#39;pm-with&#39; &amp;&amp; mark_read_in_person_messages )\n          || (elem.operator === &#39;stream&#39; &amp;&amp; !is_a_topic &amp;&amp; mark_read_in_stream )\n          || (elem.operator === &#39;stream&#39; &amp;&amp; is_a_topic &amp;&amp; mark_read_in_topic )\n                  &amp;&amp; !elem.negated )\n        }) )\n    },\n</pre></div>",
        "id": 807129,
        "sender_full_name": "Tom Welter",
        "timestamp": 1578444957
    },
    {
        "content": "<p>We can probably simplify the code so that it checks for one condition at a time.</p>",
        "id": 807184,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578478371
    },
    {
        "content": "<p>Basically, almost all narrows where we would mark messages read should have 0, 1, or 2 operators.  The original <code>every</code> loop just checks to see if there are any additional operators that make it a non-standard narrow.</p>",
        "id": 807185,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578478521
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14319\">@Tom Welter</span> I am submitting the following PR: <a href=\"https://github.com/zulip/zulip/pull/13631\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/13631\">#13631</a>.  If you look at it, you will hopefully see an easier way to hack <code>can_mark_messages_read</code> for your use case.  I think you can basically have one boolean here that will make most people happy.  I'll let you look at the patch before elaborating.</p>",
        "id": 807196,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578485844
    },
    {
        "content": "<p>I like the simplified version a lot.</p>\n<p>In addition to early-exiting, we also need to mark messages as read when we move our pointer manually, say, by using the up-and-down arrows in the interleaved views. This was an issue that Tom pointed out in his first run of the code.</p>",
        "id": 807197,
        "sender_full_name": "Rohitt Vashishtha",
        "timestamp": 1578487416
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"1406\">@Rohitt Vashishtha</span> Do you have time to investigate the code paths a little further here?  We have a couple functions that dictate whether or not messages are read by the current filter, but it's not completely clear which contexts they apply in.  We could probably either give the functions more precise names or just add some comments to the code.  For example, we also have <code>is_reading_mode</code>.</p>",
        "id": 807200,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578487973
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"58\">@Steve Howell</span> It certainly reads a lot easier. I wondered if the every loop had to do with some code optimization so I  made now radical changes.</p>\n<p>One boolean in stead of 5 would work for me. However, with 5 you could let users choose more precisely in which views they would like to mark messages read. </p>\n<p>While testing the no-mark-as-read in interleaved views setting , I found it surprisingly convenient to be able to browse through a stream with mouse <strong>and keys</strong>  without worrying about mark-as-read. If I really wanted to mark a message the topic (or the person in case of PM's) was only one mouse click away. <br>\n<span class=\"user-mention\" data-user-id=\"1406\">@Rohitt Vashishtha</span>  When we were testing in the first run it initially seemed inconvenient perhaps mainly because there was now way to mark as read at all at that time. Later I started to appreciate reading messages in two modes, with and without marking. <br>\nThis is a design decision that may have more implications than I am aware of so I would gladly leave it up to you all.</p>",
        "id": 807416,
        "sender_full_name": "Tom Welter",
        "timestamp": 1578518683
    },
    {
        "content": "<p>I think we will learn a lot from your experiment, Tom!  I am curious to see how your team reacts to the changes you made.</p>",
        "id": 807489,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578520111
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"58\">@Steve Howell</span>  What was the objective behind <a href=\"https://github.com/zulip/zulip/commit/c407ba517582a1af0bcd5fe080d870897c948511\" target=\"_blank\" title=\"https://github.com/zulip/zulip/commit/c407ba517582a1af0bcd5fe080d870897c948511\">c407ba517582a1af0bcd5fe080d870897c948511</a>? It looks like nothing is calling these two functions except the tests.</p>",
        "id": 808286,
        "sender_full_name": "Rohitt Vashishtha",
        "timestamp": 1578757854
    },
    {
        "content": "<p>I assume there was a commit after that?</p>",
        "id": 808287,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578757951
    },
    {
        "content": "<p>There is <a href=\"https://github.com/zulip/zulip/commit/bec40af6144231795ce97b219c25691c1b62ec41\" target=\"_blank\" title=\"https://github.com/zulip/zulip/commit/bec40af6144231795ce97b219c25691c1b62ec41\">bec40af6144231795ce97b219c25691c1b62ec41</a> as the parent commit, and these two are the only commits by you in that series.</p>",
        "id": 808288,
        "sender_full_name": "Rohitt Vashishtha",
        "timestamp": 1578758200
    },
    {
        "content": "<p>I think Tim might have done some work on this.  Is it dead code now?</p>",
        "id": 808289,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578758277
    },
    {
        "content": "<p>You can do searches with git log.</p>",
        "id": 808290,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578758303
    },
    {
        "content": "<p>Okay, this looks like it was deadcode from the start.</p>\n<div class=\"codehilite\"><pre><span></span>$ git log -Sis_reading_mode\ncommit c407ba517582a1af0bcd5fe080d870897c948511\nAuthor: Steve Howell &lt;showell@zulipchat.com&gt;\nDate:   Sat Jul 7 13:47:45 2018 +0000\n\n    Add narrow_state.is_reading_mode().\n</pre></div>",
        "id": 808291,
        "sender_full_name": "Rohitt Vashishtha",
        "timestamp": 1578758305
    },
    {
        "content": "<p>It’s possible we deployed something to czo and then aborted the experiment.</p>",
        "id": 808292,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578758375
    },
    {
        "content": "<p>Yeah, that's what I was wondering. I couldn't find any context on it.</p>",
        "id": 808293,
        "sender_full_name": "Rohitt Vashishtha",
        "timestamp": 1578758402
    },
    {
        "content": "<p>No PRs link back to mine?</p>",
        "id": 808294,
        "sender_full_name": "Steve Howell",
        "timestamp": 1578758452
    },
    {
        "content": "<p><a href=\"#narrow/stream/2-general/topic/un-narrow.20view\" title=\"#narrow/stream/2-general/topic/un-narrow.20view\">https://chat.zulip.org/#narrow/stream/2-general/topic/un-narrow.20view</a></p>",
        "id": 808295,
        "sender_full_name": "Rohitt Vashishtha",
        "timestamp": 1578758504
    },
    {
        "content": "<p>Hah, this looks eerily similar to what we are trying to add here again. <code>is_reading_mode</code> could have been used as an early-exit condition in <code>can_mark_messages_read</code> and we did do an experiment here, but maybe that wasn't merged and this preparatory commit got merged.</p>",
        "id": 808296,
        "sender_full_name": "Rohitt Vashishtha",
        "timestamp": 1578758675
    },
    {
        "content": "<p>How about how discord behaves? If you have unreads in a stream it shows a banner which you can click on to jump to your first unread?</p>\n<p>So, here, if you have above a certain threshold of unreads, in an interleaved view, don't mark unreads and show the latest messages, but have a way to jump the scroll up to the first unread and start marking as read if they're starting from the first unread of that view...</p>\n<p>(How often do you read a conversation backwards and don't need to review it?)</p>",
        "id": 810012,
        "sender_full_name": "Yash RE",
        "timestamp": 1579330894
    },
    {
        "content": "<p>We'd surely need to tune some parameters, but I think something along those lines could be nice.</p>",
        "id": 811056,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1579732029
    },
    {
        "content": "<p>In the current setup that <span class=\"user-mention silent\" data-user-id=\"14319\">Tom Welter</span> has, we do not mark messages read at all in interleaved views. A minor improvement could be to have an additional check of whether the interleaved view <em>appears</em> as an interleaved view or a narrowed view? For example, if all the messages I'm seeing are from the same user in PMs, I would forget that I'm in an interleaved view and would be expecting the messages to be marked as read.</p>\n<p>Perhaps something like:</p>\n<div class=\"codehilite\"><pre><span></span><span class=\"k\">if</span> <span class=\"p\">(</span><span class=\"nx\">interleaved</span><span class=\"p\">)</span> <span class=\"p\">{</span>\n    <span class=\"nx\">msgs</span> <span class=\"o\">=</span> <span class=\"nx\">get_unread_messages_in_current_view</span><span class=\"p\">();</span>\n    <span class=\"k\">if</span> <span class=\"p\">(</span><span class=\"nx\">can_fit_into_a_narrower_narrow</span><span class=\"p\">(</span><span class=\"nx\">msgs</span><span class=\"p\">))</span> <span class=\"p\">{</span>\n        <span class=\"nx\">allow_mark_as_read</span> <span class=\"o\">=</span> <span class=\"kc\">true</span><span class=\"p\">;</span>\n    <span class=\"p\">}</span>\n<span class=\"p\">}</span>\n</pre></div>",
        "id": 811176,
        "sender_full_name": "Rohitt Vashishtha",
        "timestamp": 1579764976
    },
    {
        "content": "<blockquote>\n<p>For example, if all the messages I'm seeing are from the same user in PMs, I would forget that I'm in an interleaved view and would be expecting the messages to be marked as read.</p>\n</blockquote>\n<p>I'm not sure this would be intuitive, and it might be the wrong behavior if the PMs are with a person whose messages I don't want to mark read yet.  I would prefer solutions here that either:</p>\n<ul>\n<li>make it more obvious than I'm in a non-reading view (visual cues, etc.)</li>\n<li>enable some <strong>explicit</strong> action by the user to change reading mode</li>\n</ul>",
        "id": 811223,
        "sender_full_name": "Steve Howell",
        "timestamp": 1579786717
    },
    {
        "content": "<blockquote>\n<ul>\n<li>make it more obvious than I'm in a non-reading view (visual cues, etc.)</li>\n</ul>\n</blockquote>\n<p>While using the setup on our site there are already visual queues present which are sufficient for me<br>\n * there is a whole block of topics marked in a color on the left sidebar when in interleaved view (= do mot mark mode)<br>\n * there are messages from other topics in view with different colors. On a small screen this may not be the case<br>\nI could be more than average perceptive in this regard. However, the clue that marks a message as unread (thick left message border) is also small but once you get used to it, it is enough.<br>\nYou could change the color of the blue box to grey in non-marking view to indicate that you are not in the usual reading- and marking mode,</p>",
        "id": 811316,
        "sender_full_name": "Tom Welter",
        "timestamp": 1579806261
    },
    {
        "content": "<blockquote>\n<ul>\n<li>enable some <strong>explicit</strong> action by the user to change reading mode</li>\n</ul>\n</blockquote>\n<p>The explicit action I use now is to click the topic name which places me in the topic view where messages are marked as read. Jumping back goes to interleaved view again (non-marking mode). I had not anticipated this but it works well for me.</p>",
        "id": 811317,
        "sender_full_name": "Tom Welter",
        "timestamp": 1579806555
    },
    {
        "content": "<p>I'd been saving up like ~2k unreads, I did something stupid and tried to scroll down to see the latest message activity and I lost everything, sigh...<br>\nYou know how you can just stockpile emails and read them when available? Of all the email-like behaviors we can accustom, that's really something we should keep viable at all narrows... and interleaved views, as they are, just aren't compatible with that behavior.</p>",
        "id": 818376,
        "sender_full_name": "Yash RE",
        "timestamp": 1582087974
    },
    {
        "content": "<p>which is kinda frustrating cause ultimately interleaved views are just like non-threaded chat... and there must be some way to improve our behavior in an intuitive way... I mentioned above how discord facilitates back-reading, how does slack do it?</p>",
        "id": 818377,
        "sender_full_name": "Yash RE",
        "timestamp": 1582088289
    },
    {
        "content": "<p>for reference, the stupid thing I did was that I used the scroll bar on the right hand side (as opposed to scrolling from the mouse) and tried to jump to the bottom of \"All\", I don't know why I expected that to let me see the bottom of \"All\" without marking unread... is behavior like that something that would be intuitive to other people?</p>",
        "id": 818379,
        "sender_full_name": "Yash RE",
        "timestamp": 1582092251
    },
    {
        "content": "<p>I think the solution for this sort of thing is an \"undo mark as read\" feature, which is likely not easy to implement.  It's good for it to be convenient to mark everything in the current view as read -- that's a thing active users do all the time.</p>",
        "id": 818517,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1582137043
    },
    {
        "content": "<p>I think an undo mark as read would be hard to implement.</p>\n<p>I did some research into how other chats manage unreads in their channels and my conclusion is that I think it's worth experimenting with what I described above. (The discord type thing).</p>",
        "id": 818603,
        "sender_full_name": "Yash RE",
        "timestamp": 1582144520
    },
    {
        "content": "<p>I've not looked into the server recently, but is the 'mark unread' a server or client/design issue?</p>",
        "id": 819263,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1582248405
    },
    {
        "content": "<p>Both.  We currently have an invariant that messages are never changed from read to unread, and there's a lot of things that would need to change to allow that in a non-buggy way.</p>",
        "id": 819560,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1582306557
    },
    {
        "content": "<p>Hi guys, is something going to be done about this, we recently switched from rocketchat to zulip and we miss a lot of messages this way. Its 2 years since last post. What seems best for me is to be able to turn off read marking in global views (all, private..) and in those views just mark messages as read when you have blue border around messages. Maybe it has been implemented since, but cant find functionality?</p>",
        "id": 1308794,
        "sender_full_name": "Mathew Stafurik",
        "timestamp": 1641981722
    },
    {
        "content": "<p>I used to have a <code>violent monkey</code> script that let me toggle whether to mark messages as read or not, by just hacking and changing <code>can_mark_messages_read</code> since that used to be exposed to the console (and hence the script), but we changed how we configure things and now I don't believe that kind of hacking into module internals is possible? (Which is a shame because it was a cool power user thing to do.)</p>",
        "id": 1308809,
        "sender_full_name": "Yash RE",
        "timestamp": 1641988043
    },
    {
        "content": "<p>I am able to locate place where to change can_mark_messages_read, but in order to put that into action I need to fork/build zulip myself, as far as I understand. Would be nice to have those settings in UI somewhere.</p>",
        "id": 1308812,
        "sender_full_name": "Mathew Stafurik",
        "timestamp": 1641988308
    },
    {
        "content": "<p>I personally would be happy not to have messages marked as read in interleaved views. I occasionally accidentally click on \"All messages\", and then get worried because I probably accidentally marked some messages as read. In the rare situations when I'm skimming through a stream without going through topic by topic, it would be fine to use the \"Mark all messages as read\" feature. (If we add the option being discussed, I wonder if we should also have  \"Mark all messages as read\" available for PMs?)</p>\n<p>I think a simplification from <span class=\"user-mention silent\" data-user-id=\"22809\">Mathew Stafurik</span> 's proposal would be to never mark messages as read in these contexts. In my All messages situation, I don't want the selected message to be marked as read either.</p>\n<p>Thoughts?</p>",
        "id": 1308938,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642010572
    },
    {
        "content": "<p>I primarily read messages through <code>all messages</code> so I guess I'd need to manually hit <code>mark all messages as read</code> as a routine?</p>",
        "id": 1308940,
        "sender_full_name": "Ken Clary",
        "timestamp": 1642010661
    },
    {
        "content": "<p>If it's implemented as a setting, you just wouldn't turn that setting on.</p>",
        "id": 1308943,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642010822
    },
    {
        "content": "<p>&lt;nod&gt;</p>",
        "id": 1308946,
        "sender_full_name": "Ken Clary",
        "timestamp": 1642010922
    },
    {
        "content": "<p>We could make it without a setting. Or by doing such setting dynamically. As I understand there is a flow when a user don't want things to be marked as read even after fast view on them. So the focus rectangle could visually store such setting per narrower and be in 2 possible modes: mark as read and don't mark as read with an easy switch between them in any stream/narrower. It would be also ok if such setting is dynamic but has a global value, as long as it easy to switch it.</p>",
        "id": 1308975,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1642014342
    },
    {
        "content": "<p>it could be simply be as an eye (open or closed) icon inside the focus ring <a href=\"/user_uploads/2/3f/C8-xUAAEbpHNNT2BqM3-jqNR/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/3f/C8-xUAAEbpHNNT2BqM3-jqNR/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/3f/C8-xUAAEbpHNNT2BqM3-jqNR/image.png\"></a></div>",
        "id": 1308978,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1642014703
    },
    {
        "content": "<p>Some of the decisions here will be influenced by us allowing folks to mark messages as unread.</p>",
        "id": 1308979,
        "sender_full_name": "Steve Howell",
        "timestamp": 1642014868
    },
    {
        "content": "<p>sure</p>",
        "id": 1309002,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1642016404
    },
    {
        "content": "<p>Yeah, there are currently a few contexts where messages don't get marked as read, as described in <a href=\"https://github.com/zulip/zulip/pull/18768\">#18768</a>. The basic plan was to show a banner in those cases, which lets the user switch to marking messages as read. Making that switch wouldn't affect anything globally / in future interactions.</p>",
        "id": 1309019,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642017479
    },
    {
        "content": "<p>I'd be interested in having a good solution for a subtle visual indicator when messages aren't being marked as read. (I recall having some discussion involving a line on the left side in the context of <span class=\"user-mention\" data-user-id=\"58\">@Steve Howell (showell)</span> 's work on marking messages as unread.) I don't think we'd want to show anything in the case when messages are being marked as read.</p>",
        "id": 1309021,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642017605
    },
    {
        "content": "<p>It doesn't seem intuitive to me to tie the indicator specifically to the focus rectangle, as marking messages as read is not explicitly connected to the focus rectangle.</p>",
        "id": 1309025,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642017666
    },
    {
        "content": "<blockquote>\n<p>marking messages as read is not explicitly connected to the focus rectangle</p>\n</blockquote>\n<p>Oh, sorry, I din't think that this is a case. So what is actually making messages as read if not a focus rectangle?</p>",
        "id": 1309037,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1642018406
    },
    {
        "content": "<p>Oh, I was partially wrong myself. :) According to <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> , messages get marked read with the blue box (so that's a common case), or if you scroll down far enough to see a certain amount of white space below the last message, even if the blue box is still higher on the page at that point.</p>",
        "id": 1309103,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642021711
    },
    {
        "content": "<p>Is it possible to simplify that and force the blue box to be a single source of read status?<br>\nI guess on mobile we don't have any blue box and things are working fine there but the problem remains</p>",
        "id": 1309163,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1642023262
    },
    {
        "content": "<p>Not really.  There really are two separate concepts at play here.</p>",
        "id": 1309449,
        "sender_full_name": "Steve Howell",
        "timestamp": 1642031957
    },
    {
        "content": "<p>As an example, you may scroll up to select a message to reply to.</p>",
        "id": 1309451,
        "sender_full_name": "Steve Howell",
        "timestamp": 1642032095
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/new.20message.20count.20disappearance/near/1309103\">said</a>:</p>\n<blockquote>\n<p>According to <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> , messages get marked read with the blue box (so that's a common case), or if you scroll down far enough to see a certain amount of white space below the last message, even if the blue box is still higher on the page at that point.</p>\n</blockquote>\n<p>Hm, playing around with it, I don't think that description is quite right. For example, when I went to <a href=\"#narrow/stream/7-test-here/topic/loading.20icon.20on.20mobile\">https://chat.zulip.org/#narrow/stream/7-test-here/topic/loading.20icon.20on.20mobile</a>, which has a bunch of short messages, they all got marked as read without scrolling, even though there was no white space below. (You can try it by following the link, making sure your window is not particularly tall.)</p>",
        "id": 1309580,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642058014
    },
    {
        "content": "<p>(The point about the blue box still holds, since I never moved it at all.)</p>",
        "id": 1309581,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642058038
    },
    {
        "content": "<p>For normal views (i.e. not search results), I almost always see that all my messages on the screen get marked as unread.</p>",
        "id": 1309643,
        "sender_full_name": "Steve Howell",
        "timestamp": 1642083079
    },
    {
        "content": "<p>I was thinking -- can we have some property of the unread marker line itself subtly encode when messages are not being marked as read? E.g. the unread line could be darker/lighter, wider/narrower, or have some other effect on it.</p>",
        "id": 1309841,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642107486
    },
    {
        "content": "<p>We could still explicitly show a banner in certain situations, but it would provide a subtle visual cue.</p>",
        "id": 1309843,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642107536
    },
    {
        "content": "<blockquote>\n<p>encode when messages are not being marked as read</p>\n</blockquote>\n<p>sure, for example grey line is indicating that message is new but you are not changing its status... like disabled button, which you can't click.</p>",
        "id": 1309849,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1642107676
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/new.20message.20count.20disappearance/near/1309580\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/new.20message.20count.20disappearance/near/1309103\">said</a>:</p>\n<blockquote>\n<p>According to <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> , messages get marked read with the blue box (so that's a common case), or if you scroll down far enough to see a certain amount of white space below the last message, even if the blue box is still higher on the page at that point.</p>\n</blockquote>\n<p>Hm, playing around with it, I don't think that description is quite right. For example, when I went to <a href=\"#narrow/stream/7-test-here/topic/loading.20icon.20on.20mobile\">https://chat.zulip.org/#narrow/stream/7-test-here/topic/loading.20icon.20on.20mobile</a>, which has a bunch of short messages, they all got marked as read without scrolling, even though there was no white space below. (You can try it by following the link, making sure your window is not particularly tall.)</p>\n</blockquote>\n<p>Perhaps that \"certain amount of white space\" is just very small (perhaps practically zero)?</p>\n<p>I regularly notice this behavior. I don't think I've ever seen it when the messages in question weren't all shown on the screen. I think of it as \"if you scroll down far enough to see the last message\", rather than \"a certain amount of white space below the last message\".</p>",
        "id": 1309851,
        "sender_full_name": "Greg Price",
        "timestamp": 1642107760
    },
    {
        "content": "<p>If we were to use an explicit icon rather than a border effect, I think things would be more clear.</p>",
        "id": 1309852,
        "sender_full_name": "Steve Howell",
        "timestamp": 1642108145
    },
    {
        "content": "<p>For an icon, do you have thoughts on where it would go? Would we need it on every unread message the user sees?</p>",
        "id": 1309856,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642108245
    },
    {
        "content": "<p>No strong preference on the location of the icon.</p>",
        "id": 1309860,
        "sender_full_name": "Steve Howell",
        "timestamp": 1642108405
    },
    {
        "content": "<p>It would be there for every unread message.</p>",
        "id": 1309864,
        "sender_full_name": "Steve Howell",
        "timestamp": 1642108458
    },
    {
        "content": "<p>I have been able to deploy forked version of zulip with modified filter. While it works (all view and stream view do not mark messages read) its still not ideal. </p>\n<p>I dont know about icon. </p>\n<p>I think blue bar is enough if possible to implement that way (idk about mobile though I dont use mobile app). You move with arrows between messages, that only mark them as read. I would change behavior of moving blue rectangle to it can be moved with click directly to messages and arrows only. Or something like that. Sometimes scroll wheel on mouse jumps a little and blue rectangle has to stay in view so it might have to mark messages rear without intention. And this is main problem, when something is marked read without you reading it, you can hardly come back.</p>",
        "id": 1310292,
        "sender_full_name": "Mathew Stafurik",
        "timestamp": 1642154675
    },
    {
        "content": "<p>Once we have the feature to mark messages as unread, there will be some benefits with showing icons for every message, where the icon indicates either \"read\" or \"unread\".  We can let users toggle the unread status by clicking the icon.</p>\n<p>Our biggest shortcoming right now is that you can't put a message back into unread status, which forces workarounds like starring messages so that folks can act upon whatever is actionable in the message when they're ready to do it in the future.  But there is also the converse problem--sometimes you are in a view where messages don't get \"read\", but you clearly want to mark the message as read because you don't need to see it again.</p>",
        "id": 1310384,
        "sender_full_name": "Steve Howell",
        "timestamp": 1642169592
    },
    {
        "content": "<p>If I had to vote, the icon would be just to the left of the date.  I know folks have raised legitimate reasons to put the icon more toward the left of the message (since folks read left to right in English and many other languages), but I would still prefer it on the right.  Most of the time you don't really care, and when you do care, I think you're scanning toward the right anyhow.</p>",
        "id": 1310385,
        "sender_full_name": "Steve Howell",
        "timestamp": 1642169759
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> <a href=\"#narrow/stream/101-design/topic/new.20message.20count.20disappearance/near/1309851\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/new.20message.20count.20disappearance/near/1309580\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/new.20message.20count.20disappearance/near/1309103\">said</a>:</p>\n<blockquote>\n<p>According to <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> , messages get marked read with the blue box (so that's a common case), or if you scroll down far enough to see a certain amount of white space below the last message, even if the blue box is still higher on the page at that point.</p>\n</blockquote>\n<p>Hm, playing around with it, I don't think that description is quite right. For example, when I went to <a href=\"#narrow/stream/7-test-here/topic/loading.20icon.20on.20mobile\">https://chat.zulip.org/#narrow/stream/7-test-here/topic/loading.20icon.20on.20mobile</a>, which has a bunch of short messages, they all got marked as read without scrolling, even though there was no white space below. (You can try it by following the link, making sure your window is not particularly tall.)</p>\n</blockquote>\n<p>Perhaps that \"certain amount of white space\" is just very small (perhaps practically zero)?</p>\n</blockquote>\n<p>Yeah, the test is whether the <code>bottom_whitespace</code> element is visible in the DOM, so even 5 pixels of it being visible is enough for the entire thread to be onscreen and thus messages to be marked as read.</p>",
        "id": 1312444,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1642643255
    },
    {
        "content": "<p>There's a design tradeoff here, basically because the intent of the human reader is not possible to determine.</p>",
        "id": 1312445,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1642643313
    },
    {
        "content": "<p>If you're browsing topics you're unlikely to reply to, and click on a topic with a few messages and skim them with your eyes, you'd like to be able to just move on to the next topic without having do anything special and have the messages be marked as read.</p>",
        "id": 1312447,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1642643362
    },
    {
        "content": "<p>In other settings, you might prefer that the messages not be marked as read.</p>",
        "id": 1312448,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1642643373
    },
    {
        "content": "<p>What Zulip does today is guess based on whether you saw all the messages in the topic onscreen -- if so, you at least had the opportunity to read them.</p>",
        "id": 1312449,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1642643408
    },
    {
        "content": "<p>I think it's reasonable to have an algorithm of this form that guesses in this sort of fast-paced workflow, as long as there's a way to override the guess decision (by marking the thread as unread before leaving).</p>",
        "id": 1312450,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1642643457
    },
    {
        "content": "<p>But I think it's important for anyone thinking about this design detail to understand that it's actually quite subtle/challenging.</p>",
        "id": 1312452,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1642643551
    },
    {
        "content": "<p>There is one place where we are certainly not at a local optimum from a design perspective: Ideally, we'd have the selection land on the message just before the first unread message, rather than the first unread message; this, in turn, would mean that we don't eat an unread message every time one visits a conversation.</p>",
        "id": 1312455,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1642643626
    },
    {
        "content": "<p>Changing that is stuck in implementation challenges -- basically around how precisely to deal with situations where all of the messages in the target view are unread, and thus you can't place the selected message box on any message.</p>",
        "id": 1312456,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1642643662
    },
    {
        "content": "<p>As workaround solution would work well if those filter.js settings, you have to fork zulip because of them. Would be nice to have them per user in GUI selectable. My current conf is org wide to have All messages and Stream narrow to never mark messages read.</p>",
        "id": 1312572,
        "sender_full_name": "Mathew Stafurik",
        "timestamp": 1642673987
    },
    {
        "content": "<p>Just started trialling Zulip at work this week and automatically marking messages as read when clicking on a stream has already become quite an annoyance even with a small number of streams and topics. From reading through this thread and some of the GitHub issues it seems like there is no solution to this yet?</p>\n<p>A thought I've had in looking at this is why not just add a clickable arrow to the left of the stream name/icon that lets you expand the topics under the stream without actually selecting the stream? Similar to file explorer on Windows for example. That way you can view which topics have unread messages and navigate to them without clicking on the parent stream itself and unintentionally marking messages as read. The way I see it this would solve at least part of the problem without needing to change the mark as read behaviour at all.<br>\n<a href=\"/user_uploads/2/2/tV2nvhQkkRx4KREb8rSd4UCJ/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/2/tV2nvhQkkRx4KREb8rSd4UCJ/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/2/tV2nvhQkkRx4KREb8rSd4UCJ/image.png\"></a></div>",
        "id": 1509057,
        "sender_full_name": "Donald Bailey",
        "timestamp": 1676593395
    },
    {
        "content": "<p>Good point <span class=\"user-mention\" data-user-id=\"26064\">@Donald Bailey</span></p>",
        "id": 1509106,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1676607212
    }
]