[
    {
        "content": "<p>Zulip has the feature of marking the messages as starred if they are important so that users can go back and refer to  it. But if a user thinks that a particular conversation in a stream that they had was important, then is there a feature to mark (star) the whole conversation. If not I think that would be a useful feature in Zulip that needs to be implemented.</p>",
        "id": 175644,
        "sender_full_name": "Tejas Kasetty",
        "timestamp": 1490097689
    },
    {
        "content": "<p>This would implicitly mark all the individuals messages in that conversation as starred. Instead of user manually marking them one by one.</p>",
        "id": 175645,
        "sender_full_name": "Tejas Kasetty",
        "timestamp": 1490097780
    },
    {
        "content": "<p>If the conversation is so active that people keep discussing. Then there should be feature to star only a portion of the conversation.</p>",
        "id": 175647,
        "sender_full_name": "Tejas Kasetty",
        "timestamp": 1490097858
    },
    {
        "content": "<p>If you find that a particular stream (aka channel) is especially interesting, you can it to the top of the left sidebar using the popup menus in the left sidebar.  We don't currently have any features to pin/start topics yet, though.</p>\n<p>It probably wouldn't be super hard to have a way to star topics.</p>",
        "id": 175650,
        "sender_full_name": "Steve Howell",
        "timestamp": 1490098685
    },
    {
        "content": "<p>Is there a shortcut to star a messages? I'm sure that would work quite quickly to mark many messages with alternating the keys to star a msg and arrow up or down</p>",
        "id": 175651,
        "sender_full_name": "Matthias",
        "timestamp": 1490098782
    },
    {
        "content": "<p>ah yes. use <code>*</code></p>",
        "id": 175653,
        "sender_full_name": "Matthias",
        "timestamp": 1490098824
    },
    {
        "content": "<p>ok, <span class=\"user-mention\" data-user-email=\"tejaskasetty@gmail.com\" data-user-id=\"1640\">@Tejas Kasetty</span>  if you use keyboard shortcuts you can quickly mark many messages. I can't imagine though that you want to do that too often otherwise the star loses it's value.<br>\nHowever, <span class=\"user-mention\" data-user-email=\"showell30@yahoo.com\" data-user-id=\"58\">@Steve Howell</span> there used to be a gmail lab addon that added different colour stars, <code>!</code> etc which you circled through by clicking the one star button in Gmail. <br>\nMaybe in the future Zulip could support multiple kinds of stars so that people can differentiate between things like important, to do, info, come back to etc.</p>",
        "id": 175654,
        "sender_full_name": "Matthias",
        "timestamp": 1490099055
    },
    {
        "content": "<p><a href=\"/user_uploads/2/cd/91CixxsTZH8fqvJzAx7fEdoG/2017-03-21_13-24-01-gmail-star.gif\" target=\"_blank\" title=\"2017-03-21_13-24-01-gmail-star.gif\">gmail-star.gif</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/cd/91CixxsTZH8fqvJzAx7fEdoG/2017-03-21_13-24-01-gmail-star.gif\" target=\"_blank\" title=\"gmail-star.gif\"><img src=\"/user_uploads/2/cd/91CixxsTZH8fqvJzAx7fEdoG/2017-03-21_13-24-01-gmail-star.gif\"></a></div>",
        "id": 175655,
        "sender_full_name": "Matthias",
        "timestamp": 1490099148
    },
    {
        "content": "<p>(I forgot that you can pin streams until Steve pointed it out earlier today, and now I've done so - thanks for the reminder, Steve!)</p>",
        "id": 175668,
        "sender_full_name": "Sumana Harihareswara",
        "timestamp": 1490106357
    }
]