[
    {
        "content": "<p>Would it be possible to hide the URL link if it's pointing to a <code>.gif</code>, <code>.webp</code> or other image files? Our users are very font of sending gifs and it would look more natural and less cluttered if the blue URL wasn't showing in those cases.</p>",
        "id": 314504,
        "sender_full_name": "Matthias",
        "timestamp": 1510132953
    },
    {
        "content": "<p><a href=\"https://github.com/zulip/zulip/pull/7324\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/7324\">#7324</a></p>",
        "id": 314790,
        "sender_full_name": "Matthias",
        "timestamp": 1510149736
    },
    {
        "content": "<p>So, I think it probably only makes sense to do this if the entire message is the link</p>",
        "id": 315125,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1510164506
    },
    {
        "content": "<p>Since if you're using the link in a sentence, it'll look wrong if we remove the link.</p>",
        "id": 315126,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1510164523
    },
    {
        "content": "<p>I think it rarely looks good with the actual link embedded.</p>",
        "id": 315132,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1510164641
    },
    {
        "content": "<p>Rarely = kinda never ;)</p>",
        "id": 315133,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1510164651
    },
    {
        "content": "<p>Improving the styling of the image embed is one of the high-value tasks that are easy and quick.</p>",
        "id": 315134,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1510164694
    },
    {
        "content": "<p>alternatively, the image URL that is posted together with other text could be shortened to just the image name rather the entire link.</p>",
        "id": 315178,
        "sender_full_name": "Matthias",
        "timestamp": 1510165509
    },
    {
        "content": "<p>Yeah, usually when people use it in a sentence they use the markdown syntax.</p>",
        "id": 315182,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1510165569
    },
    {
        "content": "<p>I guess we could be a bit more aggressive and do it as the image is on a line by itself at the end of a message.</p>",
        "id": 315183,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1510165595
    },
    {
        "content": "<p>Agreed this is probably a quick win, though it will require a bit of markdown trickyness to get right :)</p>",
        "id": 315185,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1510165623
    },
    {
        "content": "<p>I think other chat apps basically force a new line.</p>",
        "id": 315186,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1510165633
    },
    {
        "content": "<p>I guess actually one thing we should discuss while we're thinking about this is the current model for how we do these inline image previews.</p>",
        "id": 315224,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1510166171
    },
    {
        "content": "<p>Currently, if you have a message that looks like this:</p>\n<div class=\"codehilite\"><pre><span></span>Some text\n\nhttps://some/link.png\n\nMore text\n</pre></div>\n\n\n<p>We always render the previews at the end.</p>\n<p>It would likely not be super hard to modify the structure for the relevant markdown TreeProcessor to do the replacement in place if the link is on a line on its own.  I think it still makes sense for text more like <code>check out [this link](https://some/link.png); it's really cool!</code> to not put the image right there and line-break (also, where would you put the text), but replacing URLs with the image inline seems pretty reasonable.</p>",
        "id": 315232,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1510166294
    },
    {
        "content": "<p>interesting. I would basically always prefer/expect it to be inline, adding linebreaks where needed.</p>",
        "id": 315276,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1510166650
    },
    {
        "content": "<p>Well, the current behavior of just putting them at the end is there just for implementation simplicity, but if you have a labeled link as text in the middle of a paragraph, you probably don't expect the preview to break the paragraph (you might want it just after the paragraph).</p>",
        "id": 315342,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1510167969
    },
    {
        "content": "<p>hm, for pasted images, I basically always want them inline, but I guess I can see a case where you're linking to something external and wouldn't want it inline. <br>\nIn any case, if images on a newline show inline, that would solve my frustrations at least, and that would be compatible with showing images at the end of the current paragraph.</p>",
        "id": 315379,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1510168384
    }
]