[
    {
        "content": "<p>At present, if you are composing a PM with some valid recipients and also an invalid recipient, clicking \"Send\" just sends it to the valid recipients, without notifying you that anything is wrong.</p>\n<p>That doesn't seem like the right behavior... Thoughts on what we should do in this situation?</p>\n<p>I'm thinking putting up a banner and blocking you from sending might be reasonable:</p>\n<blockquote>\n<p>Your message was not sent because a recipient you entered (\"flskajfv\") does not exist.</p>\n</blockquote>",
        "id": 1478654,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1670894288
    },
    {
        "content": "<p>We could also potentially offer to send to the valid users (the current behavior, but with explicit approval), but that might be more confusing than useful.</p>",
        "id": 1478655,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1670894330
    },
    {
        "content": "<p>Yeah, I think making you remove invalid recipients is the correct/expected behavior.</p>",
        "id": 1479589,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1670982647
    },
    {
        "content": "<p>I would likely go with simpler text: \"Invalid recipient: {invalid_recipient}\" ... or maybe something like displaying it in red and having it flash/flicker. Would be worth looking at how other compose elements (gmail, say) do this.</p>",
        "id": 1479590,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1670982673
    },
    {
        "content": "<p>Gmail gives you a pop-up after you click \"Send\", which I wouldn't say is ideal. There's also a red underline under the name in the \"To\" field.</p>\n<p><a href=\"/user_uploads/2/88/CCY44URleqxTrcOEulDuC3BM/Screen-Shot-2022-12-13-at-9.43.58-PM.png\">Screen-Shot-2022-12-13-at-9.43.58-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/88/CCY44URleqxTrcOEulDuC3BM/Screen-Shot-2022-12-13-at-9.43.58-PM.png\" title=\"Screen-Shot-2022-12-13-at-9.43.58-PM.png\"><img src=\"/user_uploads/2/88/CCY44URleqxTrcOEulDuC3BM/Screen-Shot-2022-12-13-at-9.43.58-PM.png\"></a></div>",
        "id": 1479694,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1670996819
    },
    {
        "content": "<p>Slack just doesn't let you leave the addressee area in an invalid state. Similarly for FB messenger.</p>",
        "id": 1479695,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1670996835
    },
    {
        "content": "<p>I kinda hate things that don't let you click on something else, but I suppose we could, say, just remove any extra/invalid items when focus leaves the input.</p>",
        "id": 1480359,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1671068673
    },
    {
        "content": "<p>That's annoying in its own way, right? If you had a letter off and didn't notice, and now you have to retype the whole thing?</p>",
        "id": 1480376,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1671069037
    },
    {
        "content": "<p>I like the banner idea. I'm feeling that we can have something similar to \"Sent! Your message is outside your current narrow. <a href=\"http://\">Narrow to private messages with xxxx</a>\"? With something to click on to quickly remove all the invalid recipients.</p>",
        "id": 1480462,
        "sender_full_name": "Zixuan James Li",
        "timestamp": 1671082132
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/non-existent.20PM.20recipient/near/1479694\">said</a>:</p>\n<blockquote>\n<p>Gmail gives you a pop-up after you click \"Send\", which I wouldn't say is ideal. There's also a red underline under the name in the \"To\" field.</p>\n</blockquote>\n<p>This sounds pretty good to me, actually — as long as that red underline succeeds at clearly indicating that something is wrong, anyway. (Perhaps something other than a red underline would be better at that.)</p>\n<p>With that design:</p>\n<ul>\n<li>as soon as you leave the addressee area with things in an invalid state, you get a clear indication that it's invalid;</li>\n<li>but there's no rush or pressure — you can go deal with something else first and come back;</li>\n<li>and if you had like one letter off, you can fix that one letter and not retype the whole thing.</li>\n</ul>",
        "id": 1480719,
        "sender_full_name": "Greg Price",
        "timestamp": 1671134584
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/non-existent.20PM.20recipient/near/1480376\">said</a>:</p>\n<blockquote>\n<p>That's annoying in its own way, right? If you had a letter off and didn't notice, and now you have to retype the whole thing?</p>\n</blockquote>\n<p>I think that'd be a more important consideration if the model was one where you might introduce a new user to the tool by typing it in, like with an email client. But in Zulip, you're doing autocomplete of users from a known set of possible users, and I think a partial autocompletion of a user identity is much lower value.</p>",
        "id": 1480978,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1671150774
    },
    {
        "content": "<p>In particular, the sequence would be \"fixing one letter\" and then selecting the actual user pill from the typeahead who matched your search.</p>",
        "id": 1480980,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1671150962
    },
    {
        "content": "<p>I think the pop-up option is potentially a fine user experience, but I'm not sure it's the most suitable design given the constraints here. </p>\n<p>My main thought is that I think this is pretty low importance; I don't believe having incomplete text in that box has been a likely situation to end up in ever since we migrated to the pills model for the private message recipients.</p>",
        "id": 1480981,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1671151249
    }
]