[
    {
        "content": "<p>Watching <span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> 's most recent video reminded me of a UX problem I'd love for us to solve in this redesign, if not before.</p>\n<p>If you are in a view that shows only a subset of messages in a sequence, like @-mentions or a search (e.g. \"from:me\" is a good one to experience this with), messages in the same topic get glued together, even when they are not actually consecutive. For example, I've been tripped up a number of times where I forgot that I was looking at a \"from:X\" search rather than PMs with X, and was very confused about why a message I remembered sending wasn't showing up.</p>\n<p>So I'd love to find a way to make it clear in the UI that there are actually messages in between the ones you're seeing. I could imagine a dateline-style indicator that says how many messages are missing, or showing the header bar any time the messages are non-consecutive, or I'm sure there are other ways we can think of as well.</p>",
        "id": 1326765,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1644563747
    },
    {
        "content": "<p>I like the idea of a dateline-style indicator for this, ideally as a link/button that would allow you to expand out the context.</p>",
        "id": 1326768,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1644563858
    },
    {
        "content": "<p>Something like \" [ 6 messages not shown... ] \"</p>",
        "id": 1326771,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1644563886
    },
    {
        "content": "<p>To start with, it could be implemented as a link that just takes you to the narrow where those messages are visible, and if we want in the future we could have it expand the messages inline (although that's quite different from the current navigation model, so maybe we wouldn't want to do that)</p>",
        "id": 1326772,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1644563974
    },
    {
        "content": "<p>I don't think we will know how many messages are missing in most cases.</p>",
        "id": 1327313,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1644625000
    },
    {
        "content": "<p>The simplest solution would be to always generate a new recipient header in search views when you're seeing non-consecutive content; I would have thought we already did that.</p>",
        "id": 1327316,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1644625025
    },
    {
        "content": "<p>Yeah, we implemented that in 2013: <a href=\"https://github.com/zulip/zulip/commit/bc8bc8567b648d8a7297bba2ecf8d977525b6d04\">bc8bc8567b648d8a7297bba2ecf8d977525b6d04</a>.  It appears something went awry and resulted in the <code>collapse_messages</code> parameter always being true.</p>",
        "id": 1327319,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1644625337
    },
    {
        "content": "<p>Heh, I'd be happy with a quick fix to add the header bars back in, and we can think about fancier styling in a separate pass.</p>",
        "id": 1327327,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1644626154
    },
    {
        "content": "<p>Fixed in <a href=\"https://github.com/zulip/zulip/pull/21110\">#21110</a>; deploying that here so we can start getting QA on it.</p>",
        "id": 1327359,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1644629503
    }
]