[
    {
        "content": "<p>coming here from <a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/Trick.20to.20see.20messages.20without.20marking.20them.20as.20read\">#feedback &gt; Trick to see messages without marking them as read</a> , given that we've implemented a \"can mark as read\", we should also add something to the UI to make it explicitly clear to a user whether scrolling through a list of messages will mark them as read or not, it could be something pretty simple like, just changing the \"unread\" marker to eg grey or red to show that the view you're in will behave differently from the \"typical\" stream&gt;topic view.</p>",
        "id": 850118,
        "sender_full_name": "Yash RE",
        "timestamp": 1586406664
    },
    {
        "content": "<p>Yeah, I completely agree.  Not sure what this should be, but I do think it's important.</p>",
        "id": 850341,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1586440310
    },
    {
        "content": "<p>I've test-deployed here <a href=\"https://github.com/zulip/zulip/pull/19462\">#19462</a>, which causes Zulip to display a banner at the bottom when in a view where messages are not automatically marked as read.  There are two classes of search views, though the behavior for this feature is identical:</p>\n<ul>\n<li>Search views, where you may be seeing a mix of read/unread messages.</li>\n<li>\"Link to this conversation\" views, where you may be following a direct link to a specific point within a topic, and we want to take you to that message (which would normally potentially mark it as read) without disturbing your ability to later read the topic in order / preserve which messages you've read.</li>\n</ul>\n<p>Here's a sample screenshot:</p>\n<p><a href=\"/user_uploads/2/9f/DoneaLq_m4B25S1IfuHprKaY/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/9f/DoneaLq_m4B25S1IfuHprKaY/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/9f/DoneaLq_m4B25S1IfuHprKaY/image.png\"></a></div><p>We may want to do some work on the notice visuals.  I'll note it shared styling with the existing above-compose-box warnings, so the right way to do that project would be to propose a new design for those elements altogether.</p>",
        "id": 1329547,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1644972549
    },
    {
        "content": "<p>One problem: If you're linked to somewhere with a lot of messages, the banner might be off screen until you scroll to the bottom of the view. I think it should probably be sticky?</p>",
        "id": 1329713,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1644984473
    },
    {
        "content": "<p>I'm not entirely sure about that detail -- when you're not at the end of the topic it may be more distracting than helpful.</p>",
        "id": 1330418,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1645055170
    },
    {
        "content": "<p>(I feel like it's rare for someone to be notice that things aren't being marked as read until they've made it to the bottom)</p>",
        "id": 1330420,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1645055198
    }
]