[
    {
        "content": "<p>I'm working on <a href=\"https://github.com/zulip/zulip/pull/23470\">#23470</a>, where we want to show a banner when messages from unsubscribed streams are not marked as unread after clicking 'Mark as unread from here' in an interleaved view.</p>\n<p>Just want to confirm, does the design and placement of the banner below look good?</p>",
        "id": 1627530,
        "sender_full_name": "Hemant Umre",
        "timestamp": 1692375601
    },
    {
        "content": "<p><a href=\"/user_uploads/2/aa/EZL-Rn53PeKja5r2SbECRW8x/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/aa/EZL-Rn53PeKja5r2SbECRW8x/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/aa/EZL-Rn53PeKja5r2SbECRW8x/image.png\"></a></div>",
        "id": 1627531,
        "sender_full_name": "Hemant Umre",
        "timestamp": 1692375632
    },
    {
        "content": "<p><a href=\"/user_uploads/2/db/YWT1p7CreAX92GUxS_tIj0FU/image.png\">light.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/db/YWT1p7CreAX92GUxS_tIj0FU/image.png\" title=\"light.png\"><img src=\"/user_uploads/2/db/YWT1p7CreAX92GUxS_tIj0FU/image.png\"></a></div>",
        "id": 1627536,
        "sender_full_name": "Hemant Umre",
        "timestamp": 1692376068
    },
    {
        "content": "<p>Placement looks okay, but I could see users getting headaches from trying to understand that banner's contents alongside the mark-as-read one below it. Maybe it makes more sense when the mark-unread action has been taken though.</p>",
        "id": 1627539,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1692376288
    },
    {
        "content": "<p>I would imagine the other banner should disappear when this new one shows up?</p>",
        "id": 1627647,
        "sender_full_name": "Evy",
        "timestamp": 1692386085
    },
    {
        "content": "<p>I'm also a bit nervous about how readable the banner would be when it lists e.g. 10 streams</p>",
        "id": 1627648,
        "sender_full_name": "Evy",
        "timestamp": 1692386110
    },
    {
        "content": "<p>I guess it is hard to test but I suggest to don’t show banner 1 for people who has banner 2</p>",
        "id": 1627791,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1692399443
    },
    {
        "content": "<p>Or if banner 2 wouldn’t mark them at all to not show it</p>",
        "id": 1627793,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1692399472
    },
    {
        "content": "<p>I think we should definitely show the \"this view doesn't mark messages as read\" always for this view because it's true always.</p>",
        "id": 1627805,
        "sender_full_name": "Evy",
        "timestamp": 1692400293
    },
    {
        "content": "<p>When they click \"mark as read\" is when the other banner shows up to explain that it only marked some of the visible messages as read.</p>",
        "id": 1627807,
        "sender_full_name": "Evy",
        "timestamp": 1692400332
    },
    {
        "content": "<p>Ok, anyway lets figure out how to not show 2 banners...</p>",
        "id": 1628173,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1692477363
    },
    {
        "content": "<p>I think this might be a case where popping up a modal is reasonable. It's a rare error-like condition, and that I expect even power users to like only have a 10% chance of every seeing. But I'd also do like a \"warning\" banner type for it, since it's basically \"we mostly did what you asked, but not quite for this corner case you probably didn't realize existed and probably don't super care about\".</p>",
        "id": 1629072,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692665078
    },
    {
        "content": "<p>Well if it is a warning can we make another banner a warning for now?</p>",
        "id": 1629082,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1692665488
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"21453\">@Evy</span> what do you think about using the <code>feedback_widget</code> that pops up when we mute a stream for this? We might want to turn off the auto-hide timer, and I kinda hate that view's unique visual design so we might want to replace that as a follow-up, but this seems like the exact use case for that and maybe we should be able to use that code path for this?</p>",
        "id": 1629764,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692752164
    },
    {
        "content": "<p>I don't super like popups, but for a very rare case that seems fine? I'm not totally sure what you're talking about and can't trigger it when I try muting a stream (it just mutes and that's it).</p>",
        "id": 1629819,
        "sender_full_name": "Evy",
        "timestamp": 1692764549
    },
    {
        "content": "<p>My preferred strategy still is just to disappear the first banner and replace it with the second one.</p>",
        "id": 1629820,
        "sender_full_name": "Evy",
        "timestamp": 1692764562
    },
    {
        "content": "<p>If we're worried about the list of streams being too long, we can also say something like \"Some messages were from streams you're not subscribed to, and those messages were not marked as read.\"</p>",
        "id": 1629821,
        "sender_full_name": "Evy",
        "timestamp": 1692764598
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"21453\">@Evy</span> use the <code>M</code> keyboard shortcut -- I think we only use it there (and also for maybe the <code>Ctrl+*</code> deprecated keyboard shortcut, and a few other code paths). Just <code>git grep feedback_widget</code> and you'll see the handful of callers.</p>",
        "id": 1630256,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692820928
    },
    {
        "content": "<p>I don't think it will feel at all natural that an action you picked a <code>\\vdots</code> menu will give feedback in the form of a banner at the bottom of the message feed -- that will be invisible to the user without a LOT of scrolling 99% of the time that this unusual corner case in \"mark as unread\" comes up -- which is basically when users with a like 5% frequency history did \"Mark as unread\" from the \"All messages\" view to mark a few thousand messages unread.</p>",
        "id": 1630261,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692821008
    },
    {
        "content": "<p>I like the idea of using <code>feedback_widget</code> because it seems very easy and this is very much a \"We need to communicate with the user because otherwise we're lying to them, but basically this isn't going to come up.\"</p>",
        "id": 1630266,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692821065
    },
    {
        "content": "<p>Oh I'm confused -- I thought the feedback we're giving only happens when you click the button on the banner at the bottom of the narrow. Is this a different use case?</p>",
        "id": 1630322,
        "sender_full_name": "Evy",
        "timestamp": 1692823762
    },
    {
        "content": "<p>From the issue:</p>\n<blockquote>\n<p>In Zulip, a stream message can be in the \"unread\" state only if the user is subscribed to the stream is it was sent to -- Zulip does not keep track of read/unread messages in unsubscribed streams.</p>\n<p>This can cause some confusion if a user chooses the \"Mark as unread from here\" message option in an interleaved view (e.g., search results that include all messages sent to public streams), when messages in unsubscribed streams do not get marked as unread (see <a href=\"https://github.com/zulip/zulip/pull/23455\">#23455</a>).</p>\n<p>We should therefore display a banner notifying the user when the \"Mark as unread from here\" action fails to mark some messages (in unsubscribed streams) as unread.</p>\n</blockquote>",
        "id": 1630506,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692833480
    },
    {
        "content": "<p>Ah I see, yeah I had mistaken what was going. A popup seems very reasonable then :)</p>",
        "id": 1630508,
        "sender_full_name": "Evy",
        "timestamp": 1692833525
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"25140\">@Hemant Umre</span> FYI, hopefully this unblocks further work on this issue.</p>",
        "id": 1630554,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692834571
    },
    {
        "content": "<p>I'm mostly done with this. There are some minor questions I want feedback on:</p>\n<ul>\n<li>Currently, we have a 4-second timeout before the <code>feedback_widget</code> auto-hides. Do we want to increase this time, or should we disable auto-hide for this use case? If we go with the latter, do we want to hide it when the narrow is changed or when any other modal or popover opens?</li>\n<li>Does <code>Skipped unsubscribed streams</code> sound good as the title for the popover?</li>\n<li>I think we don't want any undo action from this popover. Just want to confirm before hiding the undo button.</li>\n</ul>\n<p><a href=\"/user_uploads/2/4d/hiquHPq6MK-He-fdO98Q8eFl/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/4d/hiquHPq6MK-He-fdO98Q8eFl/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/4d/hiquHPq6MK-He-fdO98Q8eFl/image.png\"></a></div>",
        "id": 1632027,
        "sender_full_name": "Hemant Umre",
        "timestamp": 1693076443
    },
    {
        "content": "<ul>\n<li>I don’t see the user benefit to increasing the timeout; 4 seconds is already pretty long. Disabling entirely creates more work for users, too.</li>\n<li>I’m not sure about the popover title, but I’m not coming up with a viable replacement just offhand, either.</li>\n<li>Hiding Undo sounds right to me, as it’s ambiguous what would be undone here—especially with the current modal title</li>\n</ul>",
        "id": 1632316,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1693226496
    },
    {
        "content": "<p>I think that seems fine but probably would just disable the timeout for this one... it's not something I expect anyone to see regularly, so giving all the time they want to read it makes sense.</p>\n<p>Would do it all as new options to the feedback widget component.</p>",
        "id": 1644929,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695328346
    },
    {
        "content": "<p>Sounds like a good plan; I updated the issue accordingly.</p>",
        "id": 1644958,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695330322
    },
    {
        "content": "<p>For the heading, maybe we can try to keep it short, since the body conveys the full info? \"Messages skipped\", perhaps?</p>",
        "id": 1645008,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695330630
    },
    {
        "content": "<p>Yeah, that heading is probably OK as a first pass, might have a better idea when playing with it.</p>",
        "id": 1646969,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695682688
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"25140\">@Hemant Umre</span> just a quick mention so you see the last decisions here.</p>",
        "id": 1646970,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695682695
    }
]