[
    {
        "content": "<p>Just a thought, but have we considered UI alternatives to \"reply\" for streams/topics? Or maybe also for PMs too?</p>\n<p>When considering Zulip \"threaded\", then some people appear to take \"replies\" as having some context of the replied-to message (like HN or reddit, or nested email replies by ID?), whereas it is in reality just a reply to the user/group/stream/topic.</p>\n<p>The compose area should already make it obvious enough who/where one is \"replying to\" (there is no other context), but I wondered if a different term  here could make this clearer.</p>\n<p>Other systems perhaps avoid this through implicit narrow context, with the compose box always open and only pointing to the that narrow, so where a message goes is \"right here\" ^</p>",
        "id": 1101387,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1611015287
    },
    {
        "content": "<p>Interesting question.  I do think it's valuable that we support posting to a different place than one's looking at (I use this e.g. to send PMs to the sender of a message on a thread for private feedback on something, as well as various other use cases).  That is of course a rare corner case -- probably 1% of messages are sent that way.</p>",
        "id": 1102135,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1611096395
    },
    {
        "content": "<p>What terminology would you use instead -- just \"Compose to stream/topic\"?</p>",
        "id": 1102136,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1611096417
    },
    {
        "content": "<p>On originally writing this I was wondering about \"respond\", but that seems too broad after looking into it.</p>",
        "id": 1102183,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1611100646
    },
    {
        "content": "<p>That was simply to avoid having to have a \"... to ...\" lengthier form.</p>",
        "id": 1102184,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1611100671
    },
    {
        "content": "<p>I think \"reply\" would be ok with context, and distinct from \"compose\" for a new context.</p>",
        "id": 1102185,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1611100796
    },
    {
        "content": "<p>So \"Reply to topic\" would have less suggestion of a response to a specific message.</p>",
        "id": 1102186,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1611100889
    },
    {
        "content": "<p>It makes it more complex perhaps, but I also enjoy the possibility for different compose contexts. One alternative longer-term solution is multiple active narrows, which has the advantage of seeing previous topic/PM context before replying.</p>",
        "id": 1102188,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1611101086
    }
]