[
    {
        "content": "<p>I think we should open compose message box by default, when a stream is selected instead when user click on new topic. Also change wording of \"new topic\" to \"send message\" or something like that ? New users find it difficult to send messages.</p>",
        "id": 848868,
        "sender_full_name": "Mohit Gupta",
        "timestamp": 1586272182
    },
    {
        "content": "<p>Or maybe highlight the compose box a bit more in some way. I don't have a design in mind but i think there is a need for this</p>",
        "id": 848873,
        "sender_full_name": "Mohit Gupta",
        "timestamp": 1586272315
    },
    {
        "content": "<p>Your grammar is confusing me here: \"when a stream is selected instead when user click on new topic\".</p>",
        "id": 848886,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586273014
    },
    {
        "content": "<p>There are two ways to open compose box.</p>\n<ul>\n<li>One to click on a message</li>\n<li>Another is on clicking on \"New Topic\" button.</li>\n</ul>\n<p>I suggest we should open compose box by default (no need of clicking new topic button or clicking the message ) when a user is in a single stream narrow. For \"All messages\" or in any view where there are multiple stream messages being displayed we can hide the compose box.<br>\nAlso wording for \"New topic\" button can be changes to \"New message\" maybe?</p>",
        "id": 848892,
        "sender_full_name": "Mohit Gupta",
        "timestamp": 1586273218
    },
    {
        "content": "<p>The main tradeoff with opening the compose box automatically is that keys like <code>n</code> stop working.  We've had many iterations of changing this behavior, so I don't we're likely to change it at this point.</p>\n<p>I think the reason we say \"New topic\" is to encourage using that button only when you really are starting a new topic.  The rest of the time we want people to be more in reply-to-message mode.</p>",
        "id": 848897,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586273786
    },
    {
        "content": "<p>And we have a \"Reply\" button.</p>",
        "id": 848898,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586273798
    },
    {
        "content": "<p>I wish we made the \"Reply\" button more prominent.</p>",
        "id": 848900,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586273861
    },
    {
        "content": "<p>Yeah, there's a big downside for hotkeys of having the compose box open (well, we could have it open but not focused, but that would feel pretty annoying as well)</p>",
        "id": 848996,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1586281273
    }
]