[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> Right now if you click on the whitespace after \"STREAMS\" or \"USERS\" there is a side effect.  I'm not sure this is what users actually expect.  I generally feel whitespace should be safe to click on without side effects.  For places where we do want big click targets (like topic lists), we generally change the background of the whitespace when you hover.  What are your thought here?  (This has some minor impact on my upcoming PR for unread lists.)</p>",
        "id": 724399,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553621979
    },
    {
        "content": "<p>you mean whitespace between STREAMS and the first stream, or something else?</p>",
        "id": 724405,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1553622044
    },
    {
        "content": "<p>oh, like to the right of STREAMS</p>",
        "id": 724408,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1553622074
    },
    {
        "content": "<p>Actually I have made a PR that corrects that such that search box opens only on clicking the search icon <a href=\"https://github.com/zulip/zulip/pull/11947\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/11947\">#11947</a></p>",
        "id": 724409,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1553622100
    },
    {
        "content": "<p>good question. it's certainly useful, but I agree a bit strange</p>",
        "id": 724415,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1553622197
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"10242\">@Sahil Batra</span> Interesting.  So you eliminate it altogether (being able to click on \"STREAMS\").</p>",
        "id": 724419,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553622350
    },
    {
        "content": "<p>Yeah. with that it opens only on clicking on search icon and not anywhere else neither on white space and neither on 'STREAMS'.<br>\nIt was an already opened issue so I made the PR.</p>",
        "id": 724420,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1553622514
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> Can you make a ruling on <a href=\"https://github.com/zulip/zulip/pull/11494\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/11494\">#11494</a>?  I agree with the logic of <span class=\"user-mention\" data-user-id=\"5837\">@Armaan Ahluwalia</span> here--it's awfully confusing to open search by clicking to the <strong>right</strong> of the gear icon.  We have three options, I think:</p>\n<ul>\n<li>status quo (yuck)</li>\n<li>allow click on actual \"STREAMS\" or \"USERS\" to open search</li>\n<li>only respect clicks on actual search icon (In which case we can just merge the PR from <span class=\"user-mention\" data-user-id=\"10242\">@Sahil Batra</span>)</li>\n</ul>",
        "id": 724427,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553622923
    },
    {
        "content": "<p>(Armaan filed the issue.)</p>",
        "id": 724428,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553622939
    },
    {
        "content": "<p>I wonder if on-hover we could darken both STREAMS and the search icon</p>",
        "id": 724431,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1553623092
    },
    {
        "content": "<p>less intense than having a background highlight, but might make it clearer it is intended as a click target</p>",
        "id": 724432,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1553623138
    },
    {
        "content": "<p>Also Armaan suggested that the size of search icon can be increased.</p>",
        "id": 724433,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1553623140
    },
    {
        "content": "<p>Sorry for not replying to you there <span class=\"user-mention\" data-user-id=\"10242\">@Sahil Batra</span> . What I was actually suggesting was increasing the click <strong>target area</strong> of the settings icon since it’s a bit niggly to get to at the moment.</p>\n<p>I’m not sure I like the idea of using the entire title bar as a click target for something you have an icon there. Feels like it’s solving the problem in a confusing way. The real issue is you need bigger buttons. Plus nobody would think to click outside of an icon to get the icons behaviour that’s just a confusing UX model going forward.</p>",
        "id": 724452,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1553623904
    },
    {
        "content": "<blockquote>\n<p>I wonder if on-hover we could darken both STREAMS and the search icon</p>\n</blockquote>\n<p>The key decision is deciding what the click target should actually be.  I would mostly lean toward it being only the search icon.  I'm strongly against having the whitespace be a click target.  I'm only mildly against having the header be a click target for enabling search.</p>",
        "id": 724472,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553624703
    },
    {
        "content": "<p>Once we decide what the click targets are, I'm fully in support of cleaning up hover effects, slightly resizing/re-padding small targets, etc.</p>",
        "id": 724473,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553624777
    },
    {
        "content": "<p>I can do the changes in the PR if any other thing is decided.</p>",
        "id": 724485,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1553625276
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"10242\">@Sahil Batra</span> Sounds good.  I imagine Rishi will weigh in with a final decision during the next few hours.  Your PR looks pretty clean, and I think it's aligned to what I would most like to see, but we'll see.</p>",
        "id": 724500,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553625813
    },
    {
        "content": "<p>I agree that the whitespace being a click target is funny, but I do think it's nice to have a bigger click target there than just an icon. (I also don't think it's so bad to have whitespace be a click target.)</p>\n<p>We can wait on Tim for a second opinion here.</p>",
        "id": 724518,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1553626485
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> UX wise I also think that clicking on the white space and getting the search bar to open is not a bad thing. After all we also use labels for that purpose in other places.</p>",
        "id": 724526,
        "sender_full_name": "Abhinav Singh",
        "timestamp": 1553626680
    },
    {
        "content": "<blockquote>\n<p>I agree that the whitespace being a click target is funny, but I do think it's nice to have a bigger click target there than just an icon. (I also don't think it's so bad to have whitespace be a click target.)</p>\n<p>We can wait on Tim for a second opinion here.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> Do you agree that it's a little strange for the click target to extend beyond the gear, as it does now?  I don't like whitespace as a click target in this context, but could we at least confine it to be between \"STREAMS\" and the magnifying glass?</p>",
        "id": 724528,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553626798
    },
    {
        "content": "<p>yeah, beyond the gear is definitely unintended</p>",
        "id": 724529,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1553626891
    },
    {
        "content": "<p>Clicking in whitespace is still wierd. Can we do something like opening the search box on clicking the icon and also the \"STREAMS\" title?<br>\nThough it is also little wierd but can help us making a bigger click target.</p>",
        "id": 724532,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1553627089
    },
    {
        "content": "<p>I think having safe places to click is an underappreciated thing in an app like Zulip.  You can click on whitespace to dismiss the compose box, popovers, modals, etc.  And it's just strange and unexpected.</p>",
        "id": 724533,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553627118
    },
    {
        "content": "<p>Sorry just to chime in here, I think advocating for click areas to be limited to the exact pixel dimensions of an icon would be a misstep. If anything, short of a redesign that affords more padding or bigger icons, the short term solution is to just afford a few pixels of invisible padding to the click targets themselves.</p>",
        "id": 724555,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1553627891
    },
    {
        "content": "<p>That’s actually a really good thing, specially when it comes to the responsive mobile version.</p>",
        "id": 724558,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1553627946
    },
    {
        "content": "<p>Lastly, I don’t think any special behaviour is needed in addition to what I mentioned above. That would be sufficient.</p>",
        "id": 724559,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1553627985
    },
    {
        "content": "<p>I am fine with increasing the size of the click targets (including small amounts of padding).  I think my main dispute, which <span class=\"user-mention\" data-user-id=\"10242\">@Sahil Batra</span> seems to agree with me on, is the large amount of whitespace to the right of \"STREAMS\".  It's worth noting that the title tip for \"STREAMS\" isn't even accurate (although of course that's an easy fix).</p>",
        "id": 724563,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553628415
    },
    {
        "content": "<p>Yeah. such large space as click target just reduce the importance of having a search icon.</p>",
        "id": 724565,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1553628514
    },
    {
        "content": "<p>It’s bad to train users into that behaviour. They’ll look for it everywhere and find it missing, plus it’s not at all a web standard. So I’d say drop it 🙂</p>",
        "id": 724570,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1553628588
    },
    {
        "content": "<p>another option would be to have that whole area turn into a search bar on hover</p>",
        "id": 724583,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1553629015
    },
    {
        "content": "<blockquote>\n<p>another option would be to have that whole area turn into a search bar on hover</p>\n</blockquote>\n<p>Wouldn't that be kind of distracting if you're trying to click the gear, though?</p>",
        "id": 724584,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553629057
    },
    {
        "content": "<p>yeah, could be, though I could also imagine it being ok</p>",
        "id": 724586,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1553629117
    },
    {
        "content": "<p>Just to be clear on what I think is best here IMHO:</p>\n<ul>\n<li>STREAMS, USERS, and GROUP PMs should <strong>not</strong> be a click target (already true for GROUP PMs)</li>\n<li>whitespace should not be a click target</li>\n<li>search icons should be a slightly bigger click target</li>\n<li>gear icon should be a slightly bigger click target</li>\n</ul>\n<p>I feel this still allows users to do searches, if they desire, while respecting the user in terms of not bombarding them with hover effects and unwanted click side effects.</p>",
        "id": 724589,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553629281
    },
    {
        "content": "<p>Also normally a user won't try clicking in a white space or would expect some hover behavior if there is already a search icon. </p>\n<p>I was also using search sometimes but never noticed this behavior till I saw the opened issue. </p>\n<p>So maybe increase the padding around search and gear icon could be used for making bigger click targets.</p>",
        "id": 724599,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1553629718
    },
    {
        "content": "<p>I agree with everything <span class=\"user-mention\" data-user-id=\"58\">@Steve Howell</span> and <span class=\"user-mention\" data-user-id=\"10242\">@Sahil Batra</span> said. In addition, steve pointed out that the tooltip hovers are very inconsistent. Like hovering over the search icon says \"filter streams\", whereas on clicking the placeholder says \"search streams\". Kind of confusing.</p>",
        "id": 724602,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1553630196
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"10242\">@Sahil Batra</span> A really quick PR might be to just clean up some of the wording here, as <span class=\"user-mention\" data-user-id=\"5837\">@Armaan Ahluwalia</span> alludes to above.  I think we want all the hovers and all the placeholders to prefer \"search\" to \"filter\".  And the hover for \"STREAMS\" is just outright wrong now.</p>",
        "id": 724611,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553630657
    },
    {
        "content": "<p><code>search</code> is a bit tricky, since it could connote searching stream content. But I guess we already use it as the placeholder.</p>",
        "id": 724658,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1553633615
    },
    {
        "content": "<p>I'm fine with \"filter\" too.  (That was my initial verbiage.)  I just think we need a decision either way, and then we can be consistent.  I feel like I've gotten pushback on \"filter\" over the years, but nothing super strong.</p>",
        "id": 724665,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553633796
    },
    {
        "content": "<p>I definitely regard it as more of a \"filter\" than a \"search,\" but I understand the opposite viewpoint here.</p>",
        "id": 724667,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553633856
    },
    {
        "content": "<p>My two cents: hovering over the magnifying glass and seeing the 'Filter streams' popup, then clicking it and seeing the input box placeholder 'Search streams,' is a bit funny.</p>",
        "id": 724678,
        "sender_full_name": "Wyatt Hoodes",
        "timestamp": 1553634044
    },
    {
        "content": "<blockquote>\n<p>My two cents: hovering over the magnifying glass and seeing the 'Filter streams' popup, then clicking it and seeing the input box placeholder 'Search streams,' is a bit funny.</p>\n</blockquote>\n<p>Yeah, I don't think there's any controversy about making them consistent.  Do you think of it as \"search\" or \"filter\"?</p>",
        "id": 724684,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553634152
    },
    {
        "content": "<p>I'd lean more to filter, actually.  The reason being, typically there aren't an overwhelming number of subscribed streams to cause an explicit search to find the target, the first letter or two usually suffices.</p>",
        "id": 724696,
        "sender_full_name": "Wyatt Hoodes",
        "timestamp": 1553634383
    },
    {
        "content": "<p>So should I replace placeholder with filter streams?</p>",
        "id": 724871,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1553654050
    },
    {
        "content": "<p>As a user i would prefer hovering on the <strong>search icon</strong> making the whole 'STREAMS' label a text box with placeholder filter streams and hovering out from the <strong>label</strong> to reset it.</p>",
        "id": 724874,
        "sender_full_name": "Priyanshu Singh",
        "timestamp": 1553656744
    },
    {
        "content": "<p>That would solve the whitespace problem when the intent is to not search there and also provide for a bigger search element contrary to the small magnifying glass when search is required.</p>",
        "id": 724875,
        "sender_full_name": "Priyanshu Singh",
        "timestamp": 1553657028
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"10242\">@Sahil Batra</span> since you are working on this issue may I know your views?</p>",
        "id": 724878,
        "sender_full_name": "Priyanshu Singh",
        "timestamp": 1553657261
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"11104\">@Priyanshu Singh</span>  We can also have the hover behavior that you suggested but I am bit more inclined towards having only search icon as a click target with some increased padding.</p>",
        "id": 724886,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1553664970
    },
    {
        "content": "<p>That's nice.</p>",
        "id": 724892,
        "sender_full_name": "Priyanshu Singh",
        "timestamp": 1553666835
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"58\">@Steve Howell</span> <span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> What is final decision regarding \"search\" or \"filter\" for placeholders and tooltip?</p>",
        "id": 725061,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1553705293
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell</span> <span class=\"user-mention silent\" data-user-id=\"131\">Rishi Gupta</span> What is final decision regarding \"search\" or \"filter\" for placeholders and tooltip?</p>\n</blockquote>\n<p>Any decision on this?</p>",
        "id": 726003,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1553962117
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> ^^</p>",
        "id": 726025,
        "sender_full_name": "Steve Howell",
        "timestamp": 1553981461
    },
    {
        "content": "<p>I wanted to wait to talk about it with Tim (unless this is blocking progress on a bigger project?)</p>",
        "id": 726033,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1553986648
    },
    {
        "content": "<p>Okay. I will wait.</p>",
        "id": 726077,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1554001613
    },
    {
        "content": "<p>I think the behavior that the whitespace between STREAMS and the magnifying glass is positive; the larger click target makes life easier for clicking on it.  I just checked and Slack does the same thing with their click targets on similar titles, which confirms our choice is not an unusual one here.  I think the main issue here is that we don't indicate that's what going on with the click target via the hover behavior in that area -- we should darken the magnifying glass and \"STREAMS\" label when you hover over this click target as well.  (Which I think was what Rishi was suggesting above)</p>",
        "id": 728770,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1554495988
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> what are your thoughts about changing the text in tooltips and placeholders as discussed above?</p>",
        "id": 728964,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1554518492
    },
    {
        "content": "<p>I think \"Search streams (q)\" is probably reasonable, as a js popover for the whole click target. I would omit the triangle from the js popover.</p>",
        "id": 728984,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1554527163
    },
    {
        "content": "<p>and on the right side we can do the same thing, with \"Search users (w)\", and also change the placeholder text from \"Search people\" to \"Search users\"</p>",
        "id": 728985,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1554527197
    },
    {
        "content": "<p>even if someone is confused the first time, they'll figure out what we mean by search pretty fast</p>",
        "id": 728986,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1554527214
    },
    {
        "content": "<p>So we need the whole click target including white space and just need to change the popover text to search instead of filter.</p>",
        "id": 728995,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1554529730
    },
    {
        "content": "<p>yup! And also:</p>\n<ul>\n<li>make it so that the click target doesn't extend to the right of the gear</li>\n<li>hovering anywhere over the click target should darken both <code>STREAMS</code> and the search icon</li>\n</ul>",
        "id": 728997,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1554530976
    },
    {
        "content": "<p>Should I make changes in that PR or make a new PR?</p>",
        "id": 729008,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1554533649
    },
    {
        "content": "<p>changes in that PR</p>",
        "id": 729014,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1554535786
    },
    {
        "content": "<p>this is <a href=\"https://github.com/zulip/zulip/pull/11947\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/11947\">#11947</a>, for others coming by</p>",
        "id": 729017,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1554535870
    },
    {
        "content": "<p>There are some related conversations here: <a href=\"#narrow/stream/101-design/topic/global_filters/near/729767\" title=\"#narrow/stream/101-design/topic/global_filters/near/729767\">https://chat.zulip.org/#narrow/stream/101-design/topic/global_filters/near/729767</a></p>",
        "id": 729768,
        "sender_full_name": "Steve Howell",
        "timestamp": 1554666193
    },
    {
        "content": "<p>I think that darkening of <code>STREAMS</code> and search icon on hovering and the gear icon remaining as it is would look a bit odd.<br>\nJust a suggestion!!!</p>",
        "id": 730077,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1554742207
    },
    {
        "content": "<p><a href=\"/user_uploads/2/c7/xIDt7fnd1Rc4LauR_rZfE0Yn/Peek-2019-04-08-10-12.gif\" target=\"_blank\" title=\"Peek-2019-04-08-10-12.gif\">Peek-2019-04-08-10-12.gif</a> <br>\nHow does this look?<br>\n(regarding darkening on hover)</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/c7/xIDt7fnd1Rc4LauR_rZfE0Yn/Peek-2019-04-08-10-12.gif\" target=\"_blank\" title=\"Peek-2019-04-08-10-12.gif\"><img src=\"/user_uploads/2/c7/xIDt7fnd1Rc4LauR_rZfE0Yn/Peek-2019-04-08-10-12.gif\"></a></div>",
        "id": 730092,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1554743698
    },
    {
        "content": "<p>I agree it looks a bit odd, but I do think it's an improvement.</p>",
        "id": 730096,
        "sender_full_name": "Steve Howell",
        "timestamp": 1554744002
    },
    {
        "content": "<p>I think darkening just those two is fine. The darkening should be done by changing the opacity, though, not by becoming bold. You can copy how we darken the compose icons<br>\n<a href=\"/user_uploads/2/a1/VBd3Lji0R5iEZ34U9z7jgJyj/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/a1/VBd3Lji0R5iEZ34U9z7jgJyj/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/2/a1/VBd3Lji0R5iEZ34U9z7jgJyj/pasted_image.png\"></a></div>",
        "id": 730097,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1554744054
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> I am changing opacity of Icon but opacity of <code>Streams</code> is already 1.</p>",
        "id": 730152,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1554748835
    },
    {
        "content": "<p>It would be nice to come up with a better color for those headings.  I still feel they're washed out (in day mode).</p>",
        "id": 730154,
        "sender_full_name": "Steve Howell",
        "timestamp": 1554749094
    },
    {
        "content": "<p>Yeah it should be a bit  more darker.</p>",
        "id": 730156,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1554749358
    },
    {
        "content": "<p>they are meant to not draw attention on themselves. For the hover question, you can replace the color to match the on-hover color of the mag icon (e.g. <a href=\"https://github.com/zulip/zulip/pull/333\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/333\">#333</a> or <a href=\"https://github.com/zulip/zulip/pull/000\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/000\">#000</a>, whichever it is)</p>",
        "id": 730157,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1554749418
    },
    {
        "content": "<p>Should there be click target till end of search icon or till the end of settings gear icon?</p>",
        "id": 730593,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1554826521
    },
    {
        "content": "<p>till end of search icon -- clicking on the gear icon goes somewhere else</p>",
        "id": 730625,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1554832903
    },
    {
        "content": "<p>And hover From streams to search icon should display a popover with search streams.</p>",
        "id": 730627,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1554833030
    },
    {
        "content": "<p>yup! <code>Search streams (q)</code>, and the popover should just be a rectangle (i.e. no triangle/arrow)</p>",
        "id": 730634,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1554833529
    },
    {
        "content": "<p>Sorry, I know its bit late, but I am busy doing my course project right now.<br>\nI have made changes for this to both night mode and normal mode.<br>\nJust wanted to show the designs once before making the PR.<br>\n<a href=\"/user_uploads/2/5e/CsYSJ3Vuekob1IeQ1kUo8UWx/normal.gif\" target=\"_blank\" title=\"normal.gif\">normal.gif</a> <a href=\"/user_uploads/2/34/2DE96Q6p-sWyM1GiKLB8xW6W/night.gif\" target=\"_blank\" title=\"night.gif\">night.gif</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/5e/CsYSJ3Vuekob1IeQ1kUo8UWx/normal.gif\" target=\"_blank\" title=\"normal.gif\"><img src=\"/user_uploads/2/5e/CsYSJ3Vuekob1IeQ1kUo8UWx/normal.gif\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/34/2DE96Q6p-sWyM1GiKLB8xW6W/night.gif\" target=\"_blank\" title=\"night.gif\"><img src=\"/user_uploads/2/34/2DE96Q6p-sWyM1GiKLB8xW6W/night.gif\"></a></div>",
        "id": 731449,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1555009691
    },
    {
        "content": "<p>awesome, looks great!</p>",
        "id": 731457,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1555009940
    },
    {
        "content": "<p>Just need to clean up some part and correct the tests.<br>\nWill make the PR soon.</p>",
        "id": 731458,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1555009995
    },
    {
        "content": "<p>Updated the PR <a href=\"https://github.com/zulip/zulip/pull/11947\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/11947\">#11947</a>.</p>",
        "id": 732014,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1555098323
    }
]