[
    {
        "content": "<p>The owner of a new Zulip organization is immediately shown a banner at the top of the app that says:</p>\n<blockquote>\n<p>Complete the organization profile to brand and explain the purpose of this Zulip organization.</p>\n</blockquote>\n<p>I think there are a couple of things we should change about this:</p>\n<ol>\n<li>The banner is shown too early. At the beginning, unless you happen to be an experienced Zulip user, you're probably just checking our the app to see how if works and whether you like it. There's no reason to configure org settings  before you've had a chance to, e.g. try sending a message or reading a topic.</li>\n</ol>\n<p>If we think it's important to strongly encourage orgs to configure their profile, I think we should delay when we do so. E.g., show the banner if the profile has not been configured (no description and/or org profile picture) after:</p>\n<ul>\n<li>N days (N = 30?)</li>\n<li>N users have joined (N = 5? 10?). This means that some small orgs will never get the reminder, but it might not actually be that important to configure if it's just you and your two collaborators.</li>\n</ul>",
        "id": 1489812,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673493753
    },
    {
        "content": "<ol start=\"2\">\n<li>The explanation of \"why\" seems off to me. I think <a href=\"https://zulip.com/help/create-your-organization-profile\">https://zulip.com/help/create-your-organization-profile</a>, which explains what the profile actually is, is a lot more helpful:</li>\n</ol>\n<blockquote>\n<p>The information in your organization profile is displayed on your organization's registration and login pages, and (optionally) in the communities directory. Your organization profile picture is also used for switching between organizations in the Desktop app.</p>\n</blockquote>\n<p>Should we change it to something like this?</p>\n<blockquote>\n<p>Complete your organization's profile, which is displayed on your organization's registration and login pages.</p>\n</blockquote>",
        "id": 1489815,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673493869
    },
    {
        "content": "<p>I think that banner text is definitely an improvement.</p>",
        "id": 1490045,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1673540155
    },
    {
        "content": "<p>And delaying showing the banner makes sense as well. I'm not sure if it should be based on length of time since creating the organization or the number of users.</p>",
        "id": 1490046,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1673540197
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"21836\">Lauryn Menard</span> <a href=\"#narrow/stream/101-design/topic/organization.20profile.20banner/near/1490046\">said</a>:</p>\n<blockquote>\n<p>And delaying showing the banner makes sense as well. I'm not sure if it should be based on length of time since creating the organization or the number of users.</p>\n</blockquote>\n<p>Anyone else have thoughts on this one?</p>",
        "id": 1493282,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674165999
    },
    {
        "content": "<p>Because the org profile picture is used for switching between organizations, it seems like it's useful to configure even with a very small number of users.</p>",
        "id": 1493377,
        "sender_full_name": "Greg Price",
        "timestamp": 1674175651
    },
    {
        "content": "<p>Cool, I filed <strong>Improve \"Complete the organization profile\" banner</strong> <a href=\"https://github.com/zulip/zulip/pull/24122\">#24122</a> with N=15, since it's very easy to update that number if we have a better idea for what it should be.</p>",
        "id": 1493394,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674177581
    }
]