[
    {
        "content": "<p>I would like to redesign the Organization Profile Page. I felt like the User profile is well structured and elements arranged properly but in Organization profile elements are not well structured <br>\nI did some design <a href=\"https://www.figma.com/file/GLG0AuCS3gVWBIHCI0IeG7/new-project?node-id=0%3A1\">figma Design</a><br>\nchanges <br>\n1) Org Profile picture is in the right corner exactly like user Profile Picture and gets rid of button and upload triggered by clicking on the widget itself, deletion using X icon exactly like User Avatar deletion<br>\n2)Organization Description box size decreased since it occupies more space even the description in very less which can be an auto-increment in size based on the length of the description<br>\n3) Separated Day Mode and night mode Organization logo<br>\n4) Removed logo upload button and delete logo button.upload logo triggered by clicking on the logo respectively and  deletion using \"X\" icon</p>",
        "id": 875615,
        "sender_full_name": "Jagan S",
        "timestamp": 1589332732
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>  Your opinion about this?</p>",
        "id": 876619,
        "sender_full_name": "Jagan S",
        "timestamp": 1589391228
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14329\">@Jagan S</span> interesting thoughts!  A few thoughts:</p>\n<ul>\n<li>I'm not sure about the organization icon idea; the thing is, organization icons are never displayed at a large size like the user avatar is, and we expect a resolution of ~100x100; so I think it will basically always look bad/pixelated.  </li>\n<li>The organization logo stuff is nice, but we'll need to make sure it falls back properly in the event that the window is narrow</li>\n<li>For \"organization description\", what I'd really like to do is show the rendered-markdown description by default, and only if the user clicks an edit widget should it switch to an editable mode (which could be in a modal or something).</li>\n</ul>",
        "id": 876663,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1589392490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>   for organization icon, I mainly cared about the position of the organization icon we could reduce the size. is it ok to place the organization icon widget in the right corner?</p>",
        "id": 876705,
        "sender_full_name": "Jagan S",
        "timestamp": 1589393564
    },
    {
        "content": "<p>We can try it; I'd want to look at a screenshot for whether it looks broken.</p>",
        "id": 876746,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1589395166
    },
    {
        "content": "<p>Also, I think having a larger description box is a good idea, because it encourages longer descriptions... But I don't think it's a hard requirement.</p>",
        "id": 876841,
        "sender_full_name": "Yash RE",
        "timestamp": 1589396652
    },
    {
        "content": "<p>With my proposed change, the sizing of the description box would be driven mainly by how it looks when displayed on the login page.</p>",
        "id": 876861,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1589397078
    },
    {
        "content": "<p>(This is <a href=\"https://github.com/zulip/zulip/pull/15070\">#15070</a>)</p>",
        "id": 896097,
        "sender_full_name": "Rohitt Vashishtha",
        "timestamp": 1591384767
    }
]