[
    {
        "content": "<p>Just wanted to make a topic, to move the tanget from <a href=\"#narrow/stream/9-issues/topic/lost.20draft/near/849228\" title=\"#narrow/stream/9-issues/topic/lost.20draft/near/849228\">https://chat.zulip.org/#narrow/stream/9-issues/topic/lost.20draft/near/849228</a> here. <em>I</em> don't want to present any ideas right now, but I wouldn't want this to get lost.</p>",
        "id": 849546,
        "sender_full_name": "Yash RE",
        "timestamp": 1586345781
    },
    {
        "content": "<p>So the context back there was we were talking about composing messages and saving drafts.  When composing long messages, you might want to have multiple drafts (back on the old topic, <span class=\"user-mention\" data-user-id=\"2187\">@Greg Price</span> gave a great example of a similar workflow in barnowl).</p>\n<p>This led to my tangent about how it would be nice for Zulip to think about some use cases that are kind of hacks now.</p>",
        "id": 849554,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586346091
    },
    {
        "content": "<p>For example, we don't really limit how long your posts to Zulip are, but things like saving-only-one-draft emphasize the \"chat\" paradigm over something more akin to an old-school mailing list thread or a Discourse thread.  I think there's room for both paradigms.</p>",
        "id": 849555,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586346181
    },
    {
        "content": "<p>People use Zulip to manage todos, and you can fake it 90% of the way with starred message views and PMs to yourself, but it's still kinda hacky.</p>",
        "id": 849557,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586346219
    },
    {
        "content": "<p>So, there's the old thing about cow paths (<a href=\"https://en.wikipedia.org/wiki/Desire_path\" title=\"https://en.wikipedia.org/wiki/Desire_path\">https://en.wikipedia.org/wiki/Desire_path</a>).  If we see people inventing workflows in Zulip that aren't really the main intention of the app, we can either tell folks to walk on the pavement, or we can try to embrace some of the behaviors at the edges.</p>",
        "id": 849558,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586346310
    }
]