[
    {
        "content": "<p>Both at present and after <a href=\"https://github.com/zulip/zulip/pull/21739\">#21739</a>, it's possible to have a topic where you can move messages after a certain point in time, but not before. There is a question of exactly how to communicate this in the UI. I'll split this into a few separate questions.</p>",
        "id": 1363221,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649461882
    },
    {
        "content": "<ol>\n<li>What should we do with the \"Change previous and following messages to this topic\" option in the three-dot UI menu, when some previous messages cannot be moved. </li>\n</ol>\n<p>At the moment, this is buggy, and we just move those messages.</p>",
        "id": 1363223,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649461962
    },
    {
        "content": "<p>I think ideally we would show some kind of warning to say that not all messages can be moved?</p>",
        "id": 1363226,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649461991
    },
    {
        "content": "<ol start=\"2\">\n<li>How should topic editing via the message header bar pencil icon work?</li>\n</ol>\n<p>At present, as far as I can tell from manual testing (perhaps someone should check the code), this always edits the topic of the messages <em>below</em> the current header bar, even if the user has permission to edit the topic of the messages above. I think this is not super intuitive as a model, but it does interact cleanly with permissions after <a href=\"https://github.com/zulip/zulip/pull/21739\">#21739</a>. We can show the pencil only when you have permissions to move all the messages below. (This UI is currently buggy in terms of respecting permissions as well.)</p>",
        "id": 1363240,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649462316
    },
    {
        "content": "<ol start=\"3\">\n<li>How should topic editing via the left sidebar work? </li>\n</ol>\n<p>My proposal is to hide the option when not all messages in the topic can be moved, but come back to this for a refinement after <strong>Make it possible to move messages by recency</strong> <a href=\"https://github.com/zulip/zulip/pull/20502\">#20502</a>.</p>",
        "id": 1363246,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649462446
    },
    {
        "content": "<p>OK, after thinking about it more and chatting with <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> , my proposal for topic editing via the message header bar is:</p>\n<ol>\n<li>If permissions allow, it should edit <em>all</em> the messages in the topic, not just the ones below.</li>\n<li>If permissions don't allow this:<br>\n     a) If the client knows this, we wouldn't show the pencil button.<br>\n     b) If the client doesn't know this, we would give an error. The error banner could have a button to let the user just move the messages that they are allowed to.</li>\n</ol>\n<p>Thoughts?</p>",
        "id": 1366148,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649883414
    },
    {
        "content": "<p>I agree, with the right permissions it’s better to allowing editing of all the messages, and if the client doesn’t have permissions, then there is no need for the pencil</p>",
        "id": 1367541,
        "sender_full_name": "Emily Burda",
        "timestamp": 1650036638
    },
    {
        "content": "<p>I filed <strong>Topic editing via message header bar should rename entire topic</strong> <a href=\"https://github.com/zulip/zulip/pull/21817\">#21817</a> for the proposal above.</p>",
        "id": 1367586,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1650043693
    },
    {
        "content": "<p>Also filed <strong>Enforce topic editing permissions when moving messages via message menu</strong> <a href=\"https://github.com/zulip/zulip/pull/21818\">#21818</a>.</p>",
        "id": 1367601,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1650044487
    }
]