[
    {
        "content": "<p>This may be intentional, but the participants (list/icons) shown in Recent conversations include at least myself, even if I've not sent a message to that PM-conversation, which is not the case for topics?</p>",
        "id": 1462867,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1668192542
    },
    {
        "content": "<p>Hm, it seems like it should have the same behavior as topics -- include yourself only if you've sent a message.</p>",
        "id": 1463664,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668455378
    },
    {
        "content": "<p>It looks like the <code>recent_senders</code> module doesn't currently track the data of which users have sent messages in private message conversations, so it'd be a nontrivial project to fix.</p>",
        "id": 1463808,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668461162
    },
    {
        "content": "<p>We use that module also for things like contextual typeahead sorting, but we don't need to track it for a private message context, since the set of users in the conversation is known and small.</p>",
        "id": 1463810,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668461225
    },
    {
        "content": "<p>There's an argument we should just not show you rather than always showing you, I guess? If we don't think it's worth fixing.</p>",
        "id": 1463811,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668461246
    },
    {
        "content": "<p>Oh, that probably means it's also not faithfully showing the latest sender first, followed by the next-latest, etc. -- the way all the other rows in that table do.</p>",
        "id": 1463857,
        "sender_full_name": "Greg Price",
        "timestamp": 1668462565
    },
    {
        "content": "<p>I think I've run into that behavior and it felt pretty buggy. It's giving me untruthful information -- it's telling me that so-and-so was the one who sent that last message I haven't seen yet, but in reality it was someone else.</p>",
        "id": 1463865,
        "sender_full_name": "Greg Price",
        "timestamp": 1668462668
    },
    {
        "content": "<p>If we don't have the data structures to fill in that area with truthful information, I think it'd be better to just leave it blank.</p>",
        "id": 1463868,
        "sender_full_name": "Greg Price",
        "timestamp": 1668462709
    },
    {
        "content": "<p>Hm, it sounds like in the current implementation, the \"Participants\" section for PMs does not provide any additional information on top of the list of PM recipients under \"Topic\".</p>",
        "id": 1463879,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668463184
    },
    {
        "content": "<p>Yeah.</p>",
        "id": 1463881,
        "sender_full_name": "Greg Price",
        "timestamp": 1668463200
    },
    {
        "content": "<p>Dropping the participants seems a bit confusing (does it somehow imply that there are no participants?), but less confusing than showing data that breaks the general paradigm.</p>",
        "id": 1463891,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668463591
    },
    {
        "content": "<p>I filed <strong>Drop participants info from PM lines in Recent conversations</strong> <a href=\"https://github.com/zulip/zulip/pull/23561\">#23561</a>. It's marked as release goal, but I don't think it should be considered a release blocker.</p>\n<p><span class=\"user-mention\" data-user-id=\"5140\">@Aman (amanagr)</span> would you be up for taking this one?</p>",
        "id": 1463903,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668464010
    },
    {
        "content": "<p>I also filed A<strong>dd participants info for PMs in Recent conversations</strong> <a href=\"https://github.com/zulip/zulip/pull/23563\">#23563</a> for the long-term fix. Currently not marked as high-priority, though maybe it should be? Probably depends on how hard it is.</p>\n<p>Definitely not a release goal, in any case.</p>",
        "id": 1463908,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668464257
    },
    {
        "content": "<p>One downside of removing the participants section for private messages would be that you can't click on the avatars to get more information about those users. Probably not a big deal, and of course something that would be fixed with this long term plan anyway.</p>",
        "id": 1463983,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668469090
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/Participants.20in.20Recent.20conversations/near/1463983\">said</a>:</p>\n<blockquote>\n<p>One downside of removing the participants section for private messages would be that you can't click on the avatars to get more information about those users. Probably not a big deal</p>\n</blockquote>\n<p>Yeah, I think that's fine. You can always click through to the conversation, and then click on either a sender avatar (for anyone in the conversation who's sent a message recently) or use the \"Private messages\" section of the left sidebar.</p>",
        "id": 1464026,
        "sender_full_name": "Greg Price",
        "timestamp": 1668471592
    },
    {
        "content": "<p>Opened <a href=\"https://github.com/zulip/zulip/pull/23590\">#23590</a></p>",
        "id": 1465343,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1668595130
    },
    {
        "content": "<p>Here's the screenshot of that implementation:</p>\n<p><a href=\"/user_uploads/2/d6/YxT3VvbKcuAN03eQvLxWHD7d/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/d6/YxT3VvbKcuAN03eQvLxWHD7d/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/d6/YxT3VvbKcuAN03eQvLxWHD7d/image.png\"></a></div>",
        "id": 1465616,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668627839
    },
    {
        "content": "<p>I'm feeling a bit reluctant about integrating that this close to the 6.0 release, mainly because it feels like a somewhat risky UI change. A few notes:</p>\n<ul>\n<li>That screenshot has all the private messages at the top, but interleaved I think it'll just feel buggy/visually choppy to have that column be empty sometimes with no apparent explanation.</li>\n<li>The column at present does provide useful information -- I used it to quickly find a thread with a specific pair of other people without having to read. There's probably another solution, but the avatars of the other users in a PM thread are useful.</li>\n</ul>\n<p>I don't like that the definition we have is \"For stream messages: The set of users who have recently sent a message, sorted by recency; for private messages: The set of users who received the message in random order.\" But I also am not convinced this local tweak to avoid that is actually an improvement; it might be better to just do the work to be able to sort correctly. (Though it may still be useful to show all the avatars even for users who haven't sent a message? Idunno). </p>\n<p>Since we don't have time to iterate on this on <a href=\"http://chat.zulip.org\">chat.zulip.org</a>, and it's I think a fairly minor/subtle issue, I think we should just plan to address this after 6.0.</p>",
        "id": 1465621,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668628139
    },
    {
        "content": "<p>It's your call, but FWIW I disagree.</p>\n<p>The existing behavior is flatly buggy: it lies to the user.</p>\n<p>I've been puzzled several times by it. I regularly look at the \"participants\" column to see who the author was, or authors were, of the unread messages in a conversation when I've previously participated in the conversation and recognize it. I spot my avatar, and then the avatars found to the left are people who've said things since I last replied there.</p>",
        "id": 1465820,
        "sender_full_name": "Greg Price",
        "timestamp": 1668636963
    },
    {
        "content": "<p>Several times, I've had new messages come into a PM conversation, looked over at the \"participants\" column, and thought:</p>\n<ul>\n<li>\"hmm, wait, how can there be two new senders when there's only one unread? I sure thought I'd sent a reply the last time I looked at that thread…\"</li>\n<li>\"hmm, wait, how are there <em>no</em> new senders when there's supposedly an unread?\"</li>\n<li>etc.</li>\n</ul>",
        "id": 1465821,
        "sender_full_name": "Greg Price",
        "timestamp": 1668636997
    },
    {
        "content": "<p>I regret that I didn't report the bug earlier. I knew that the PM rows in Recent Conversations were new, it felt like they were rapidly changing and unstable, and I figured that such obviously-broken behavior was something that would get fixed among the people working on the feature before it was considered ready.</p>",
        "id": 1465824,
        "sender_full_name": "Greg Price",
        "timestamp": 1668637220
    },
    {
        "content": "<p>That's helpful context on the trade-off between the options. </p>\n<p>I think regardless of what we do for tomorrow, we should plan to backport a change to just add a data structure in <code>recent_senders.js</code> to support displaying the exact same definition of participants we display for other items.</p>",
        "id": 1465838,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668637853
    },
    {
        "content": "<p>I'll test-deploy <a href=\"https://github.com/zulip/zulip/pull/23590\">#23590</a> here, since it's pretty localized and will let us get feedback on how not having those feels, and thus whether we'd prefer that as our temporary state.</p>",
        "id": 1465851,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668638585
    },
    {
        "content": "<p>What do folks think about the test-deployment? It would be great to get some feedback today.</p>",
        "id": 1465875,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668639558
    },
    {
        "content": "<p>I opened <a href=\"https://github.com/zulip/zulip/pull/23596\">#23596</a> <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> FYI</p>",
        "id": 1466148,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1668656502
    },
    {
        "content": "<p>Oh! Looks like Tim had the commit locally anyway.</p>",
        "id": 1466149,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1668656572
    },
    {
        "content": "<p>I browsed through Recent Conversations with this deployed, and it looked good to me!</p>\n<p>There was a scattering of rows where the right-hand area is empty. To my eye, that looks fine -- if anything, it serves as a visual highlight to mark out the PM rows.</p>",
        "id": 1466571,
        "sender_full_name": "Greg Price",
        "timestamp": 1668704979
    },
    {
        "content": "<p>Yeah, I went ahead and merged that. Let's open a follow-up issue to do the data work in order to support sorting the output exactly how we do it for topics; I don't think it should be hard, just not something worth rushing.</p>",
        "id": 1466611,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668706729
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/Participants.20in.20Recent.20conversations/near/1463908\">said</a>:</p>\n<blockquote>\n<p>I also filed A<strong>dd participants info for PMs in Recent conversations</strong> <a href=\"https://github.com/zulip/zulip/pull/23563\">#23563</a> for the long-term fix. Currently not marked as high-priority, though maybe it should be? Probably depends on how hard it is.</p>\n<p>Definitely not a release goal, in any case.</p>\n</blockquote>",
        "id": 1466644,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668708413
    },
    {
        "content": "<p>I think it's not hard; it's a fairly straightforward data structure to just record for each (conversation, sender) pair the lowest known message ID with taht sender.</p>",
        "id": 1466651,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668709067
    },
    {
        "content": "<p>OK, I'll add the \"high priority\" label.</p>",
        "id": 1466652,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668709109
    },
    {
        "content": "<p>Posted a comment with technical notes that should make it significantly more approachable.</p>",
        "id": 1466654,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668709224
    },
    {
        "content": "<p>Do we want to show the current user in a 1:1 PM?<br>\n<a href=\"/user_uploads/2/8d/AKoKrkHXm8EtCMWD5IFoHnvs/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/8d/AKoKrkHXm8EtCMWD5IFoHnvs/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/8d/AKoKrkHXm8EtCMWD5IFoHnvs/image.png\"></a></div>",
        "id": 1467323,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1668794640
    },
    {
        "content": "<p>We want to show them in the participants column, to be consistent with how it works for stream messages.</p>",
        "id": 1467420,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668800578
    },
    {
        "content": "<p>Okay, thanks!</p>",
        "id": 1467428,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1668800962
    },
    {
        "content": "<p><a href=\"https://github.com/zulip/zulip/pull/23623\">https://github.com/zulip/zulip/pull/23623</a> is open for this; I'm test deploying it here shortly.</p>",
        "id": 1468791,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1669155882
    },
    {
        "content": "<p>We've now merged this; \"Participants\" now have the exact same definition as they have for streams. </p>\n<p><span class=\"user-mention\" data-user-id=\"2187\">@Greg Price</span> FYI.</p>",
        "id": 1472770,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1669946358
    },
    {
        "content": "<p>I think there's a couple follow-ups:</p>\n<ul>\n<li>Is there documentation we should add to the \"Recent conversations\" /help/ page explaining how this works? I think basically \"Everything in recent conversations is based on what history is cached in your browser; participants displays users who have sent messages in that conversation in your browser's cached history ordered by how recently their most recent message was.\"</li>\n<li>Once we've settled that, we can decide if we want to backport this to 6.1/6.2.</li>\n</ul>",
        "id": 1472773,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1669946459
    },
    {
        "content": "<p>Err, can we avoid talking about browser caches in user-facing documentation, please? What would we wrong with just explaining that the \"Participants\" column has the most recent users who've sent messages in the conversation, newest on the left?</p>",
        "id": 1473211,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1670008349
    },
    {
        "content": "<p>Because anything that doesn't hint about that is inaccurate, and it's not easy to change the implementation to be accurate (Though it is a goal for 7.0). See <a class=\"stream-topic\" data-stream-id=\"6\" href=\"/#narrow/stream/6-frontend/topic/fetching.20message.20history\">#frontend &gt; fetching message history</a> for the large project that we need to do at some point if we want to change this definition to something understandable.</p>\n<p>In particular, if a user last sent a message in a topic 6 weeks ago, \"Participants\" will likely not include that user (the same is true for the \"Participated\" filter). I suppose one class of thing we could do that'd be easy is to have \"Recent conversations\" display how far back its knowledge goes, with a button to fetch more.</p>",
        "id": 1473221,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1670008751
    },
    {
        "content": "<p>OK, that still sounds like it has the most recent participants; sometimes there are no recent participants.</p>",
        "id": 1473223,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1670008843
    },
    {
        "content": "<p>We could change \"who've sent messages \" to \"who've recently sent messages\" in your message and that would be accurate.</p>",
        "id": 1473225,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1670008859
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/Participants.20in.20Recent.20conversations/near/1473223\">said</a>:</p>\n<blockquote>\n<p>OK, that still sounds like it has the most recent participants; sometimes there are no recent participants.</p>\n</blockquote>\n<p>Anything appearing in \"Recent conversations\" will have at least one recent participant, because of how it's built. The exception might be if the only recent participants are users you've muted; I'm not sure how that interaction works.</p>",
        "id": 1473227,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1670008908
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/Participants.20in.20Recent.20conversations/near/1473225\">said</a>:</p>\n<blockquote>\n<p>We could change \"who've sent messages \" to \"who've recently sent messages\" in your message and that would be accurate.</p>\n</blockquote>\n<p>Yes, that's fine, of course. Browser caches in user documentation is what I'm objecting to here, not recency.</p>",
        "id": 1473229,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1670009134
    },
    {
        "content": "<blockquote>\n<p>I suppose one class of thing we could do that'd be easy is to have \"Recent conversations\" display how far back its knowledge goes, with a button to fetch more.</p>\n</blockquote>\n<p>Is this somehow easier than auto-fetching more history when you get to the bottom?</p>",
        "id": 1473233,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1670009370
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/Participants.20in.20Recent.20conversations/near/1473229\">said</a>:</p>\n<blockquote>\n<p>Yes, that's fine, of course. Browser caches in user documentation is what I'm objecting to here, not recency.</p>\n</blockquote>\n<p>Yeah, I didn't meant we should use those words, just that we needed to be careful because the naive thing to say here (that it's \"all participants\") is not true; not that we need to use those particular words. Was in a hurry to note that we likely need some follow-ups between other tasks, and not trying to draft language.</p>",
        "id": 1473258,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1670010773
    },
    {
        "content": "<p>PR <a href=\"https://github.com/zulip/zulip/pull/23732\">#23732</a></p>",
        "id": 1473526,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1670018679
    }
]