[
    {
        "content": "<p>In <a href=\"https://github.com/zulip/zulip/pull/20575\">#20575</a>, a user reported that the \"This topic was moved by...\" notification is confusing when only some messages from a topic are moved. I agree that we could use phrasing that makes it more clear what's going on. Thoughts on what wording to use? Suggestions in the GitHub discussion so far (assuming the \"by\" part was left out in the discussion by accident):</p>\n<ol>\n<li>\"Part of this topic was moved by ... to ...\"</li>\n<li>\"3 messages from this topic were moved by ... to ...\"</li>\n<li>\"A conversation was moved by ... to ...\"</li>\n</ol>",
        "id": 1304480,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1641368987
    },
    {
        "content": "<p>Since <code>to</code> is more important than <code>by</code> here, we can place it first.<br>\n<code>Part of the conversation above was moved to ... by ...</code></p>",
        "id": 1304486,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1641370170
    },
    {
        "content": "<p>I like the variation that has a count of the messages. That's helpful for gauging the difference between \"a two-message start of a tangent\" and \"the last week of discussion with 100 messages\". (The latter sounds extreme but has legitimate use cases, like when a complex discussion pivots into a different complex discussion and then you want to continue both of them.)</p>",
        "id": 1304828,
        "sender_full_name": "Greg Price",
        "timestamp": 1641420351
    },
    {
        "content": "<p>Yeah, I would appreciate having a count as well.</p>",
        "id": 1304858,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1641423163
    },
    {
        "content": "<p>I sometimes have to piecemeal pick apart a topic and move only parts of it.  Since we don't have a \"select some\" U Ito move messagfes, that means that in practice I either:</p>\n<ul>\n<li>Move everything below a point, and then move some things back</li>\n<li>Move individual messages one-at-a-time</li>\n</ul>\n<p>While I generally also want a count, either of those is going to be misleading with a count.  Which is probably more of an argument for having a \"move some\" UI than one against having a count on the moved message.</p>",
        "id": 1304865,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1641423447
    },
    {
        "content": "<p>Yeah, I think we should assume we're going to build a move-some feature; the main limitation in doing so is just figuring out a good way to implement the \"Select the messages you want\" experience.</p>",
        "id": 1304879,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1641423884
    },
    {
        "content": "<p>Sounds good; I posted the following comment on the original issue:</p>\n<hr>\n<p>Based on <a href=\"#narrow/stream/101-design/topic/part.20of.20a.20topic.20moved\">discussion on CZO</a>, to solve this issue we should change the text to the following format when only part of the topic is moved:</p>\n<blockquote>\n<p>3 messages from this topic were moved to ... by ... .</p>\n</blockquote>\n<p>When all messages are moved, we should reorder the message to be:</p>\n<blockquote>\n<p>This topic was moved to ... by ... .</p>\n</blockquote>",
        "id": 1304892,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1641424886
    },
    {
        "content": "<p>Hello!<br>\nI would like to work on this issue, could someone help me get started? <br>\nfirst of all, could you help me see an example of this notification when a topic is moved? </p>\n<p>Thanks for the help!</p>",
        "id": 1306903,
        "sender_full_name": "vamshi krishna",
        "timestamp": 1641638824
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span>  <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> <br>\nI have tried moving messages between topics but I'm not able to find the notification mentioned above, Is the option limited to moderators? or am I missing something else here?</p>",
        "id": 1307143,
        "sender_full_name": "vamshi krishna",
        "timestamp": 1641714206
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"22762\">@vamshi krishna</span> you can test this in your <a href=\"https://zulip.readthedocs.io/en/latest/development/index.html\">development environment</a>. Yes, this feature is. limited to moderators / admins.</p>",
        "id": 1307291,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1641788277
    },
    {
        "content": "<p>Oh okay, thanks a lot</p>",
        "id": 1307431,
        "sender_full_name": "vamshi krishna",
        "timestamp": 1641830934
    },
    {
        "content": "<p>Hello, I have been working on this issue for past few days and I have opened a pr too - <a href=\"https://github.com/zulip/zulip/pull/20807\">https://github.com/zulip/zulip/pull/20807</a> . Can you guys review it ?? Thank you.</p>",
        "id": 1310923,
        "sender_full_name": "Shubh Gupta",
        "timestamp": 1642392210
    },
    {
        "content": "<p>Sorry to disturb, I just noticed someone has already reviewed the pr and wrote some changes I need to do. I'll work on those for now.</p>",
        "id": 1310924,
        "sender_full_name": "Shubh Gupta",
        "timestamp": 1642392515
    }
]