[
    {
        "content": "<p>We just deployed for the first time a set of changes that make copy-pasting HTML into the Zulip compose convert that HTML to markdown.  We're using a third-party library called <a href=\"https://github.com/domchristie/to-markdown\" target=\"_blank\" title=\"https://github.com/domchristie/to-markdown\">toMarkdown</a> to do the pasting.  I'd love it if a few folks played around with it and tried to find anything that seems common and wrong.</p>",
        "id": 335296,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1511325313
    },
    {
        "content": "<p>The library is configurable, so it should be possible to ensure it does what we want, but we've done 0 customization so far.</p>",
        "id": 335297,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1511325338
    },
    {
        "content": "<p>pretty neat! One thing I found is that if the text is the same as the href, I would prefer to not have the markdown syntax. So I'd prefer pasting <code>www.google.com</code>, rather than <code>[www.google.com](www.google.com)</code>.</p>\n<p>Another is that I copied something from a webapp that looks like <code>1. text</code> to me on the website, but it gets pasted as <code>1\\. text</code> in Zulip. I'm not sure how to extract the actual contents of the clipboard yet, but I'll take a look.</p>",
        "id": 338921,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1511467262
    },
    {
        "content": "<p>I think what I'd do with examples like this is (1) add a <code>console.log()</code> the the paste handler to log the raw HTML that it got and then (2) add a node test that contains the exact HTML and calls a little wrapper function for <code>toMarkdown</code> (that we'll want to extract so it can be called directly in tests) and checks the output is the wrong, current thing.  And then folks can work on fixing the individual issues.</p>",
        "id": 338931,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1511467526
    },
    {
        "content": "<p>I can take a quick pass at the framework work for that.</p>",
        "id": 338932,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1511467535
    },
    {
        "content": "<p>OK, I've added a test framework that has the \"<a href=\"http://google.com\" target=\"_blank\" title=\"http://google.com\">google.com</a>\" case in a handy test (with the wrong output).</p>",
        "id": 338956,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1511469586
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"rishig@zulipchat.com\" data-user-id=\"131\">@Rishi Gupta</span> you can add a wrong-output  test for the numbered list thing as well.</p>",
        "id": 338967,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1511470633
    },
    {
        "content": "<p>I'm not sure I see it. Added in master?</p>",
        "id": 338968,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1511470638
    },
    {
        "content": "<p>Oh, oops, it's still on a branch, timabbott/copy_paste_fix.</p>",
        "id": 338970,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1511470712
    },
    {
        "content": "<p>Merged now, since it'd passed the tests in CI I was worried about.</p>",
        "id": 338972,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1511470773
    }
]