[
    {
        "content": "<p>I have a few questions about the performance and scaling of the system.  Which scenario allows for the best performance, a zulip instance with thousands of short lived streams that each have a handful of topics, or a zulip instance with a handful of long lived streams each with thousands of topics?</p>",
        "id": 1281422,
        "sender_full_name": "Mark Squires",
        "timestamp": 1636934486
    },
    {
        "content": "<p>What scenarios are known to degrade performance of the system?</p>",
        "id": 1281423,
        "sender_full_name": "Mark Squires",
        "timestamp": 1636934582
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"22167\">@Mark Squires</span> I'd expect the latter to perform better, because many Zulip organizations use large numbers of topics within streams over time (E.g. see how many are in this one).  That said, I'd expect both to work fine from a technical performance perspective (we periodically do optimization testing with a few thousand streams), so it's more a question of what UX arrangement you want.</p>",
        "id": 1281483,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1636945422
    },
    {
        "content": "<p>Can you talk about what you're trying to do?</p>",
        "id": 1281484,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1636945427
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> I can talk about what I'm trying to do, I just haven't decided what I want to do yet.  The short story is I'm build a \"connector\" software to integrate two third party systems. In the most simple implementation I wouldn't need this at all, but I'm still working through my game plan for which problems I want to solve and how I want to solve them.  As part of that I'm looking for synergies between what I need to do and this product.  We can talk more about it, I'm just not prepared to have that discussion yet.</p>",
        "id": 1281654,
        "sender_full_name": "Mark Squires",
        "timestamp": 1636978811
    }
]