[
    {
        "content": "<p>Hey! As brought up <a href=\"#narrow/stream/137-feedback/topic/usability.3A.20interview.20.232/near/1536300\">here</a>, it's worth thinking about the ordering of search bar suggestions when you search for someone's name.</p>\n<p>Currently, the search suggestions look like this:</p>\n<p><a href=\"/user_uploads/2/d7/DyL9kbGqBHdxd1CQuJvZWYxt/Screen-Shot-2023-03-29-at-12.08.46-PM.png\">Screen-Shot-2023-03-29-at-12.08.46-PM.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/d7/DyL9kbGqBHdxd1CQuJvZWYxt/Screen-Shot-2023-03-29-at-12.08.46-PM.png\" title=\"Screen-Shot-2023-03-29-at-12.08.46-PM.png\"><img src=\"/user_uploads/2/d7/DyL9kbGqBHdxd1CQuJvZWYxt/Screen-Shot-2023-03-29-at-12.08.46-PM.png\"></a></div><p>Without looking at the code, it looks like we do top 5 \"Sent by\" matches, followed by top 5 \"Direct messages with\" matches, and then \"Group direct messages including\". (The available options will be almost the same after <a href=\"https://github.com/zulip/zulip/pull/24806\">#24806</a>.)</p>\n<p>It was brought up in the linked thread that the \"Sent by\" view can be confusing if you forget that you are missing the other participants in the conversation, and the other types of filters may be more commonly useful. What do folks think?</p>",
        "id": 1536620,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1680117629
    },
    {
        "content": "<p>We could also interleave the option types, but that might not be an improvement.</p>",
        "id": 1536623,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1680117676
    },
    {
        "content": "<p>I can't find the topic, but I recall previously suggesting a multi-column (grid) drop-down, so in this case users could be across and operators would go down. I suspect that option was considered requiring too much front-end work for the short term, or with concerns from a UX perspective.</p>\n<p>Taking that idea in a different direction, could we provide something equivalent with something like a multi-level menu? That is, moving onto a user causes a secondary level to pop out, and mouse/keyboard allows picking the search action involving that user? That would provide something similar to the grid, but a more traditional base UI. It may also allow more users or search options to be shown in that drop-down.</p>",
        "id": 1536827,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1680129911
    },
    {
        "content": "<p>I've basically always been unsatisfied with the current arrangement; the \"Sent by\" options are more likely to be what you want IF you know there's other ways to find a user, but I think it's probably more often what folks are looking for.</p>",
        "id": 1536927,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1680138329
    }
]