[
    {
        "content": "<p>This is from some earlier onboarding feedback I got. What would you think of:</p>\n<ul>\n<li>If there is already a PM with someone, autonarrow to that PM after you enter their name(s) into the compose bar</li>\n</ul>\n<p>This is probably what the user wants 90% of the time, and for new users, also makes it clear that the message is going to the same \"thread\" as the previous PMs. <br>\nIt is not a great experience in that remaining 10%. I could imagine a \"return to previous narrow\" link above the compose box (along with a hotkey).</p>\n<p>Alternatively, a smaller change might be to have a hotkey that always narrows you to whatever you're composing to.</p>",
        "id": 275998,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1504367260
    },
    {
        "content": "<p>A similar issue is that when I create a new topic, 99% of the time I just want to auto-narrow to the new topic.</p>\n<p>For the use case of wanting-to-read-old-narrow-to-compose-to-a-new-narrow, I think that's a fairly advanced feature, and we just need to make it possible and non-invasize, without necessarily making it intuitive.</p>",
        "id": 276005,
        "sender_full_name": "Steve Howell",
        "timestamp": 1504368326
    },
    {
        "content": "<p>interesting. For me when I start a new topic, I want to get narrowed to the stream.<br>\nautonarrowing to a new topic would just give you the \"Nothing has been sent to this conversation yet, why not start the conversation\", right?</p>",
        "id": 276011,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1504369835
    },
    {
        "content": "<p>yeah, if you're narrowed to the stream, the current behavior is fine, but I'm usually narrowed to a different topic in the stream and get the ugly you-have-to-renarrow warning.</p>",
        "id": 276035,
        "sender_full_name": "Steve Howell",
        "timestamp": 1504373067
    },
    {
        "content": "<p>as for the \"why not start the conversation\" message, I'd just replace that with something useful once you start to create a new topic</p>",
        "id": 276038,
        "sender_full_name": "Steve Howell",
        "timestamp": 1504373105
    },
    {
        "content": "<p>Idunno, I guess for me personally, I probably send like 50% of my new thread PMs while looking at a stream narrow (because I'm commenting on something that I'm doing), and I'd be sad if that flow got more complicated.</p>",
        "id": 279878,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1505227842
    },
    {
        "content": "<p>interesting! Leaving the current behavior, plus a hotkey that is \"go to the narrow that you are composing to\" would be a fine solution for my usage. Does that seem like a good solution?</p>",
        "id": 279980,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1505230587
    },
    {
        "content": "<p>Yeah, we've discussed such a hotkey a number of times before.</p>",
        "id": 280010,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1505231560
    },
    {
        "content": "<p>cool. Ideas for what the hotkey should be? <span class=\"user-mention\" data-user-email=\"joshuapan8@gmail.com\" data-user-id=\"857\">@Joshua Pan</span>?<br>\nI'm thinking Ctrl+something, though a lot of those are taken up by browsers. Maybe Meta+n?</p>",
        "id": 280317,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1505262518
    },
    {
        "content": "<p>What is Meta?</p>",
        "id": 280319,
        "sender_full_name": "Joshua Pan",
        "timestamp": 1505262579
    },
    {
        "content": "<p>Yea, ctrl+something isn't quite friendly to non-Mac users</p>",
        "id": 280320,
        "sender_full_name": "Joshua Pan",
        "timestamp": 1505262717
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"rishig@zulipchat.com\" data-user-id=\"131\">@Rishi Gupta</span> Can you walk us through how the key would be used?  Would you be able to press any time while composing?</p>",
        "id": 280323,
        "sender_full_name": "Steve Howell",
        "timestamp": 1505262988
    },
    {
        "content": "<p>yeah, let's say I'm looking at this stream, but composing something to the Outreachy stream (e.g. I'm describing this issue, and I forget what the resolution of the conversation was). After noting down what I need from this convo, I would want to hotkey mid-compose to get back to the Outreachy stream.<br>\n(I don't know if that made sense; to concretely answer your question, almost always it's while composing.)</p>",
        "id": 280327,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1505264071
    },
    {
        "content": "<p>Or alternatively, I'm PM'ing to someone, and need to look something up. So I go to the stream, start typing in the (still open) PM compose box, and then want to return to the PM conversation, without leaving the compose box.</p>",
        "id": 280328,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1505264115
    },
    {
        "content": "<p>I think TIm's talking about a slightly different workflow.  I think he is saying he doesn't want compose to leave the original stream in the first place.  I think his scenario is that he's reading the \"issues\" stream view, and then Rishi says something on the \"issues\" stream.  Before he replies to the \"issues\" stream, he wants to send Rishi a quick PM to make sure he's understanding what Rishi says.  And he doesn't want to re-narrow.  (Even if I'm misrepresenting Tim, this is a plausible scenario for me, although I'm mostly in favor of auto-narrow-to-the-compose-target.)</p>",
        "id": 280330,
        "sender_full_name": "Steve Howell",
        "timestamp": 1505264378
    },
    {
        "content": "<p>So there are basically three scenarios:</p>\n<ul>\n<li>You like your current view, but need to send something out-of-band.</li>\n<li>You like your current compose, but you need to look something up real quick.</li>\n<li>You're truly transitioning between narrows.  (what I mostly want to optimize for)</li>\n</ul>",
        "id": 280331,
        "sender_full_name": "Steve Howell",
        "timestamp": 1505264544
    },
    {
        "content": "<p>yeah, I agree Tim's and my scenario are different, though the hope is the current proposal works for both?<br>\nAgreed that the hotkey is for the third scenario; it should truly transition you to the new narrow.</p>",
        "id": 280759,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1505349335
    },
    {
        "content": "<p>Yeah, I think that hotkey concept is reasonable.  We need some sort of modifier character, with care taken to avoid conflicting with built-in browser stuff.</p>",
        "id": 280936,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1505386278
    },
    {
        "content": "<p>How do folks feel about meta+n?</p>",
        "id": 281698,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1505435851
    },
    {
        "content": "<p>We may want to save meta-n for \"next topic.\"  I use \"n\" more than any other non-arrow hotkey now, and it's annoying when the compose box is open.</p>",
        "id": 281699,
        "sender_full_name": "Steve Howell",
        "timestamp": 1505435934
    },
    {
        "content": "<p>good point</p>",
        "id": 281701,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1505436332
    },
    {
        "content": "<p>meta+v might be ok?</p>",
        "id": 281789,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1505463385
    },
    {
        "content": "<p>meta+v feels natural to me as well. Opened as <a href=\"https://github.com/zulip/zulip/pull/6546\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/6546\">#6546</a>.<br>\nPasting here, since there might be other opinions on how the corner cases should be handled (the following is what would work best for me).</p>\n<p>There are a few cases</p>\n<ul>\n<li>stream but no topic (narrow to stream)</li>\n<li>steam and topic, and topic has existing messages (narrow to topic)</li>\n<li>PM with people where there exists a message to that PM (narrow to that PM)</li>\n</ul>\n<p>A few corner cases:</p>\n<ul>\n<li>stream and topic, and topic has no existing messages (narrow to stream)</li>\n<li>PM with people where there doesn't exist a message to that PM (narrow to the \"you have no PMs with these people\" screen)</li>\n<li>PM compose box with no or malformed recipients (narrow to all PMs)</li>\n</ul>\n<p>The hotkey should not make a server call, so \"has existing messages\" just means \"the browser knows about existing messages\".</p>",
        "id": 282148,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1505491483
    },
    {
        "content": "<p>I removed the bite-sized label here.</p>\n<p><a href=\"https://github.com/zulip/zulip/issues/6546#issuecomment-329830565\" target=\"_blank\" title=\"https://github.com/zulip/zulip/issues/6546#issuecomment-329830565\">https://github.com/zulip/zulip/issues/6546#issuecomment-329830565</a></p>\n<p>Anything dealing with compose/narrow requires an experienced developer.</p>",
        "id": 282198,
        "sender_full_name": "Steve Howell",
        "timestamp": 1505492559
    },
    {
        "content": "<p>I also changed it to area:compose, since the hotkey piece of this is actually small compared to all the logic that might come into play.  (I want to keep area:hotkey mostly newbie-friendly, since many hotkey tasks really are just a matter of mapping a key to an existing function.)</p>",
        "id": 282204,
        "sender_full_name": "Steve Howell",
        "timestamp": 1505492686
    }
]