[
    {
        "content": "<p>I started a conversation in <a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/emoji.20symbol.20for.20streams\">#feedback &gt; emoji symbol for streams</a> about UI and UX polish, and how I think that's something Zulip has underinvested in — I think it's worth starting a thread to chat more about that and how we want to think about UI/UX polish work.</p>\n<p>In general, I'm coming at this from a place of believing that Zulip's threading model, commitment to a good experience for power users (keyboard shortcuts, etc), and unique features (LaTeX, linkifiers, etc) make it a much better tool for team collaboration than anything else out there. However, the most common feedback that I hear about Zulip is that it's confusing and difficult to use. It's convenient to blame that on the threading model, but I'm not convinced by that: there are a bunch of things that are idiosyncratic about Zulip's design in 2021 (some for better, some for worse), and most of the things that are idiosyncratic <em>are not fundamental to the design of Zulip</em>.</p>\n<p>Zulip has way, way more features than most of our competitors:</p>\n<ul>\n<li>Timezone-aware dates (like <time datetime=\"2021-06-25T13:00:00Z\">2021-06-25T06:00:00-07:00</time>)</li>\n<li>LaTeX</li>\n<li>Spoilers</li>\n<li>Polls</li>\n<li>Todo lists</li>\n<li>Linkifiers</li>\n<li>Alert words</li>\n<li>Marking topics as resolved</li>\n<li>Silent mentions</li>\n<li>Surely, many more things I'm forgetting</li>\n</ul>\n<p>These are all really great features! However, most of these things could use some love to take them from things that are hard to discover and annoying to use to things that are a joy to use and differentiate Zulip from other team chat apps.</p>\n<p>Let's look at a couple examples. I'll note that while I'm going to be complaining about things here, I really appreciate all the work that <em>has</em> gone into these features — I'm starting this conversation because these are great features, that just need a bit more love to make them more usable and intuitive.</p>\n<h2>Polls</h2>\n<p>Polls are a super useful feature — they're something we had a bunch of requests for, and for good reason. We implemented them, but...</p>\n<ul>\n<li>They still aren't implemented in mobile, years after we released them on web/desktop</li>\n<li>They don't scale up to huge numbers of users, since we display all of the usernames.<ul>\n<li>We don't even display the usernames in a very useful way — they're all in a line of text, so there's no easy way to scan the list and see if a specific person responded.</li>\n</ul>\n</li>\n<li>We don't offer any options, despite plenty of requests for different types of polls.<ul>\n<li>No way to limit the set of responses</li>\n<li>No way to have anonymous polls</li>\n<li>No way to set an end date for a poll</li>\n</ul>\n</li>\n<li>The CSS looks pretty outdated, even relative to the rest of the design of Zulip.</li>\n<li>We don't have a easy way to visually see which option is winning. Check out a <a href=\"https://blog.thesocialms.com/wp-content/uploads/2015/12/Twitter-poll-example-dreckbaerfrau.png\">twitter poll</a> — that gives bars as the background for each option after you vote, so you can see how the options stack up without reading every number.<div class=\"message_inline_image\"><a href=\"https://blog.thesocialms.com/wp-content/uploads/2015/12/Twitter-poll-example-dreckbaerfrau.png\" title=\"twitter poll\"><img src=\"/external_content/6c2f5baea3c1181be7ac907363705ae8dfbb1ac0/68747470733a2f2f626c6f672e746865736f6369616c6d732e636f6d2f77702d636f6e74656e742f75706c6f6164732f323031352f31322f547769747465722d706f6c6c2d6578616d706c652d647265636b62616572667261752e706e67\"></a></div></li>\n<li>There's no easy visual way to make a poll — you have to use the /poll command, which the \"Preview\" option doesn't work on, so there's no way to tell that you've gotten it right except sending it.</li>\n</ul>\n<p>This stuff isn't a lot of work to implement! We could spend a week of work just polishing polls, and implement most of these. But we haven't, several years after we introduced polls. That's sad — I'd love to use polls more, but they have problems that make me often prefer to just do an emoji-reaction-vote.</p>\n<h2>Timezone-aware date mentions</h2>\n<p>Timezone-aware dates are a super, super useful Zulip feature. When was living in Taiwan and interacting a lot with NYC people on Zulip, I really appreciated being able to talk about times without manually converting timezones and mentioning two or three times in every scheduling message. However, there are a few pain points:</p>\n<ul>\n<li>They're <em>super</em> hard to discover. I saw them several times, and had to \"view source\" on a message someone else sent to figure out how to use them. We should have a clock icon next to the smiley face button on the compose box to insert a timezone-aware time.</li>\n<li>The time picker is annoying to interact with<ul>\n<li>It doesn't respect your 12/24 hour setting</li>\n<li>If you put in something like \"15\" for the hour position, it shows up as red, but when you press tab, it converts it to \"03\" (correctly), but <em>doesn't</em> convert the \"AM\" to \"PM\" (incorrectly)</li>\n<li>You can't toggle the \"AM\"/\"PM\" selector with the keyboard</li>\n</ul>\n</li>\n<li>The time picker CSS looks sort of janky — things are aligned strangely, and the arrows for increasing/decreasing numbers overlap strangely.</li>\n<li>On the tooltip, we show the original text, but that isn't actually very useful — we should show it in the timezone that the author specified it in, but parsed and shown in a friendlier way than the format with \"T\", \"Z\", UTC offsets, etc.</li>\n</ul>\n<p>Again, none of this stuff is super hard to fix! Someone could spend a week on this and make it a really nice experience! But we haven't done this.</p>\n<hr>\n<p>It's worth thinking about this as an investment — part of the reason we have so many features is that we don't spend a ton of time on each feature. But given that the main negative feedback we get about Zulip is that it's difficult to figure out how to use, I think it's worth spending more time polishing the features that we do make. I think spending a handful of days or a week looking at an existing feature and figuring out how to polish it and make it nicer and more intuitive to use is a really valuable use of time, and I'd encourage folks who are interested to do that :)</p>\n<p>I'm also curious to hear other folks thoughts here ­— is this something people agree with?</p>",
        "id": 1219486,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1624671714
    },
    {
        "content": "<p>Is the crux of your argument that we should spend more time polishing existing features before creating new features?</p>",
        "id": 1219501,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624674660
    },
    {
        "content": "<p>My perception is that a lot of our current efforts are about solidifying underlying infrastructure, cleaning up the settings system, and improving our permissions model.</p>",
        "id": 1219504,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624674949
    },
    {
        "content": "<p>The crux of my argument is that we should spend more time polishing existing features.</p>\n<p>I don't have a good enough picture of how people are spending their time now to know which slice of the pie that time should come out of, although I certainly think that developing new features is a likely candidate.</p>",
        "id": 1219508,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1624675989
    },
    {
        "content": "<p>I think that the amount of time we spend right now doing user-facing polish on existing features is very very small, and it would likely be worth slowing down some of the (admittedly quite valuable) infrastructure projects we're working on to ensure that we're spending time polishing user-facing features.</p>",
        "id": 1219509,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1624676104
    },
    {
        "content": "<p>(hopefully hiring another frontend-focused engineer will help with this as well)</p>",
        "id": 1219510,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1624676167
    },
    {
        "content": "<p>When it comes to polls, I think there’s an opportunity to lead by example. I know getting polls simply to work on mobile is one of your current priorities.  With zero changes to the backend, I think it’s pretty easy to actually make the mobile experience for polls superior to the webapp.</p>",
        "id": 1219514,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624677423
    },
    {
        "content": "<p>And I imagine the same would be true for the time widget.</p>",
        "id": 1219515,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624677526
    },
    {
        "content": "<p>I think you can do root cause analysis for every feature that hasn’t been polished.  For example, I have never, as a developer, spent a second thinking about how to polish Alert Words.  Ask me why?  It’s because I don’t use them and don’t feel I need them. And I extrapolate that most people either don’t really use them or need them either.</p>",
        "id": 1219516,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624678124
    },
    {
        "content": "<p>Or maybe people that do use them find the feature simple enough and never complain.</p>",
        "id": 1219517,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624678177
    },
    {
        "content": "<p>If you’re wondering why the time widget is unpolished, it’s mostly because it’s a relatively recent feature (so not much time to evolve), and then other things….</p>",
        "id": 1219518,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624678402
    },
    {
        "content": "<p>Time/date issues are notoriously difficult in general.</p>",
        "id": 1219519,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624678429
    },
    {
        "content": "<p>Third party time picker widgets generally suck.</p>",
        "id": 1219520,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624678471
    },
    {
        "content": "<p>The original developer is no longer active.</p>",
        "id": 1219521,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624678489
    },
    {
        "content": "<p>Introducing markdown syntax is always controversial.</p>",
        "id": 1219522,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624678510
    },
    {
        "content": "<p>Typeahead in the compose box is tricky.</p>",
        "id": 1219523,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624678541
    },
    {
        "content": "<p>Etc.</p>",
        "id": 1219524,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624678543
    },
    {
        "content": "<p>And, finally, it just kinda works.  Once you discover it and get over a relatively short learning curve, it’s just kinda awesome and gets the job done.</p>",
        "id": 1219525,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624678649
    },
    {
        "content": "<p>(There has actually been a lot of conversation about the time widget, and there have been recent contributions.)</p>",
        "id": 1219526,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624678738
    },
    {
        "content": "<p>This is great, I agree with a lot of it. Polls could look and function better as you describe, yes.</p>",
        "id": 1219527,
        "sender_full_name": "Jore",
        "timestamp": 1624679874
    },
    {
        "content": "<p>... and how do you mark a topic as solved?</p>",
        "id": 1219530,
        "sender_full_name": "Jore",
        "timestamp": 1624680553
    },
    {
        "content": "<p>Once we support polls on mobile, it will stop being considered an alpha feature.  And then we can start doing things like creating help docs for how to create a poll.  We also need to market the Zulip poll as more of a brainstorming/collaboration device than an “election” or “scientific poll”.  It’s mostly a useful toy to spark conversation or clarify the debate, not to actually decide anything.</p>",
        "id": 1219531,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624681063
    },
    {
        "content": "<p>/poll Which feature of Zulip could use more love?</p>",
        "id": 1219532,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1624681135
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"17945\">Wesley Aptekar-Cassels</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1219486\">said</a>:</p>\n<blockquote>\n<ul>\n<li>We don't have a easy way to visually see which option is winning. Check out a <a href=\"https://blog.thesocialms.com/wp-content/uploads/2015/12/Twitter-poll-example-dreckbaerfrau.png\">twitter poll</a> — that gives bars as the background for each option after you vote, so you can see how the options stack up without reading every number.</li>\n</ul>\n</blockquote>\n<p>My hypothesis about twitter polls is that all the real fun comes in the metaphorical comments section. And, of course, any twitter poll's numbers should be taken with a huge grain of salt, as they reflect the biases of the followees.</p>",
        "id": 1219537,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624682467
    },
    {
        "content": "<p>I will concede that it's fun to see that \"Coffee first\" places me in the 45.7% almost-majority, even if that number is more precise than accurate. <span aria-label=\"coffee\" class=\"emoji emoji-2615\" role=\"img\" title=\"coffee\">:coffee:</span></p>",
        "id": 1219538,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624682599
    },
    {
        "content": "<p>A design suggestion slightly diverged from the topic, I think there should be a people icon at the right of each option clicking which open a modal to show who voted that option, like we are planning for read receipts. This will make polls more usable in situation where there can be so many voters as it will look less cluttered.</p>",
        "id": 1219539,
        "sender_full_name": "Purushottam Tiwari",
        "timestamp": 1624683074
    },
    {
        "content": "<p>It should be a relatively easy change to show avatars instead of names (and have them pop up modals).</p>",
        "id": 1219540,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624683440
    },
    {
        "content": "<p>Like how the \"Recent topics\" page does it with \"Participants\"? Kinda?</p>",
        "id": 1219541,
        "sender_full_name": "Jore",
        "timestamp": 1624683657
    },
    {
        "content": "<p>It could be quite similar, I think, to how Recent Topics shows participants. And probably it would share some code.</p>",
        "id": 1219542,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624683748
    },
    {
        "content": "<blockquote>\n<p>When it comes to polls, I think there’s an opportunity to lead by example.</p>\n</blockquote>\n<p>Yeah, this is what I'm trying to do — I am very excited to get <a href=\"https://github.com/zulip/zulip-mobile/pull/4704\">#M4704</a> merged.</p>\n<blockquote>\n<p>I have never, as a developer, spent a second thinking about how to polish Alert Words. Ask me why? It’s because I don’t use them and don’t feel I need them. And I extrapolate that most people either don’t really use them or need them either.</p>\n</blockquote>\n<p>This is reasonable — not every feature on the list I posted is something that needs polish (or that it makes sense to polish given our resources). We should make sure to identify which things are most impactful when identifying areas for polish.</p>\n<blockquote>\n<p>If you’re wondering why the time widget is unpolished, it’s mostly because it’s a relatively recent feature</p>\n</blockquote>\n<p>Is it? The first commit I can find working on this feature was <a href=\"https://github.com/zulip/zulip/commit/b062e8332f87638e714e35ad045c5cba04075536\">b062e8332</a> on May 20th, 2020. That's more than a year ago! We didn't launch it until a handful of months ago, but even so, a few months is a lot of time to polish a feature. I have seen some recent work on improving the tooltip, and we did go back after it was launched and add a clock icon to it, but other than that I don't think we've put much work into it.</p>\n<blockquote>\n<p>Time/date issues are notoriously difficult in general.</p>\n<p>Third party time picker widgets generally suck.</p>\n<p>The original developer is no longer active.</p>\n<p>Introducing markdown syntax is always controversial.</p>\n<p>Typeahead in the compose box is tricky.</p>\n<p>Etc.</p>\n</blockquote>\n<p>Yeah, I understand that there are reasons that we end up with unpolished features. But do our users care that third-party time picker widgets generally suck?</p>\n<blockquote>\n<p>And, finally, it just kinda works. Once you discover it and get over a relatively short learning curve, it’s just kinda awesome and gets the job done.</p>\n</blockquote>\n<p>I mean, I'm a little frustrated every time I use it, and I think I'm generally more willing to use janky UIs than most people. Sure, it works, but I don't think \"it just kinda works\" should be the thing we're shooting for, especially given that we frequently get the feedback that Zulip is difficult to use, especially for nontechnical users. Little papercuts add up, and I think our product has a lot more papercuts than most of our competitors.</p>\n<blockquote>\n<p>Once we support polls on mobile, it will stop being considered an alpha feature.</p>\n</blockquote>\n<p>This seems like a sort of strange framing to me — do users know that polls are an alpha feature? We don't have any warnings about that anywhere, and given that they've been around for three years now, I think it's reasonable for people to expect them to not be considered alpha.</p>",
        "id": 1219712,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1624728962
    },
    {
        "content": "<p>For the polls-are-alpha point, I really kinda meant it more from the developers perspective.</p>",
        "id": 1219874,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624793237
    },
    {
        "content": "<p>One common element between the poll feature and the time widget feature is that they’re not really essential for newbies.  Once one intermediate user learns how to create a poll or schedule a meeting with the time widget, it introduces either the poll participants or meeting participants to the feature.  And then, ideally the more advanced user teaches other folks.</p>",
        "id": 1219878,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624795074
    },
    {
        "content": "<p>For the time widget we have two fairly recent PRs with broken builds:  <a href=\"https://github.com/zulip/zulip/pull/18826\">#18826</a> and <a href=\"https://github.com/zulip/zulip/pull/18262\">#18262</a></p>",
        "id": 1220123,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624878137
    },
    {
        "content": "<p>See also <a href=\"#narrow/stream/9-issues/topic/Improve.20time.20widget.20text\">https://chat.zulip.org/#narrow/stream/9-issues/topic/Improve.20time.20widget.20text</a>, where the current problem is that we're getting bogged down by timezone naming issues.</p>",
        "id": 1220124,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624878206
    },
    {
        "content": "<p>Here are the top four items that our poll participants thought we should polish (and your observation that we don't have a way to put them in rank order is relevant here, hence my having to summarize):</p>\n<ul>\n<li>General look and feel (8)</li>\n<li>Polls (5)</li>\n<li>Moving a topic (4)</li>\n<li>Composer (3.5) [I am only counting my vote as half, to break the tie]</li>\n</ul>",
        "id": 1220129,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624878356
    },
    {
        "content": "<p>As much as I agree that \"general look and feel\" is an area that we get criticized on and can certainly improve on, it's kind of overly, um, general. Whereas the next two are something where one individual can really do a deep dive.</p>",
        "id": 1220130,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624878479
    },
    {
        "content": "<p>Well, we could start a conversation around look and feel to explore it. In the meantime, I agree, the others are specific and doable and they should probably get attention first.</p>",
        "id": 1220881,
        "sender_full_name": "Jore",
        "timestamp": 1624914665
    },
    {
        "content": "<p>I agree it would be good for us to spend more effort finishing things and polishing features. I also agree with all of <span class=\"user-mention silent\" data-user-id=\"17945\">Wesley Aptekar-Cassels</span>'s specific points at the top about the two examples of polls and times.</p>",
        "id": 1221003,
        "sender_full_name": "Greg Price",
        "timestamp": 1624921570
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell (showell)</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1219878\">said</a>:</p>\n<blockquote>\n<p>One common element between the poll feature and the time widget feature is that they’re not really essential for newbies.  Once one intermediate user learns how to create a poll or schedule a meeting with the time widget, it introduces either the poll participants or meeting participants to the feature.</p>\n</blockquote>\n<p>I don't think this framing works.</p>\n<p>That kind of thing can work for the step of discovering just that Zulip <em>has</em> a given feature. I see people sending polls -- OK, now I know that Zulip has polls somewhere. But now how do I make one myself?</p>\n<p>There's no UI for it.</p>\n<p>It's not in the popup that the \"Help\" button displays -- and there's lots of text there to read through to find that out.</p>\n<p>In the case of polls, it's actually not even in the \"detailed help\" that that popup links to at the bottom:<br>\n<a href=\"help/format-your-message-using-markdown\">https://chat.zulip.org/help/format-your-message-using-markdown</a></p>\n<p>What there is is a link at the bottom of <em>that</em>, tucked into a little bulleted list. It takes you to a page that documents a syntax. The page doesn't have any picture of what the resulting poll might look like.</p>",
        "id": 1221042,
        "sender_full_name": "Greg Price",
        "timestamp": 1624922777
    },
    {
        "content": "<blockquote>\n<p>And then, ideally the more advanced user teaches other folks.</p>\n</blockquote>\n<p>And counting on this is just super unwelcoming. There are a lot of reasons people often have for not wanting to be put in the position of a \"newbie\" who needs to be taught by someone \"more advanced\". There's no reason these features should require arcane knowledge to use. As long as they do, the features are only half-built.</p>",
        "id": 1221043,
        "sender_full_name": "Greg Price",
        "timestamp": 1624922780
    },
    {
        "content": "<p>All I am saying is that these are socially oriented features, so they often benefit from social learning on a social chat app.</p>",
        "id": 1221128,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624927141
    },
    {
        "content": "<p>I don't think that reply engages with the reality of people's experience.</p>\n<p>We're talking here about features that are unnecessarily hard to use, because we just never did the work to properly finish them.</p>\n<p>It's not really OK for us to say \"oh it's fine, users will explain to each other how to deal with it.\" That's a bad experience for a lot of users, and leaves them feeling like Zulip is not for them. And for the great majority of users it just means the feature doesn't exist for them.</p>",
        "id": 1221141,
        "sender_full_name": "Greg Price",
        "timestamp": 1624927750
    },
    {
        "content": "<p>Yup, but the reality is that people often just ask around how to use features.</p>",
        "id": 1221144,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624927871
    },
    {
        "content": "<p>When they do, that is a terrible experience that makes people feel Zulip is a bad product.</p>",
        "id": 1221145,
        "sender_full_name": "Greg Price",
        "timestamp": 1624927916
    },
    {
        "content": "<p>Yup, except sometimes people lighten up and just teach each other cool stuff, and it’s a fun experience.</p>",
        "id": 1221146,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624928011
    },
    {
        "content": "<p>Plus even accepting all the premises of that reply, it only has anything to say about two out of the 15 different things Wesley pointed out about polls and time-mentions. No amount of asking around will fix that polls don't work well for having more than a handful of users reply, and that the time-picker has a completely busted layout and is unusable with the keyboard.</p>",
        "id": 1221147,
        "sender_full_name": "Greg Price",
        "timestamp": 1624928012
    },
    {
        "content": "<p>Great. Let's build our product for more than \"sometimes\".</p>",
        "id": 1221148,
        "sender_full_name": "Greg Price",
        "timestamp": 1624928025
    },
    {
        "content": "<p>And let's let our users spend their time teaching each other <em>cool</em> stuff instead of how to work around the half-built features of their chat product.</p>",
        "id": 1221150,
        "sender_full_name": "Greg Price",
        "timestamp": 1624928050
    },
    {
        "content": "<p>I offered the challenge to have mobile lead the way on polls.</p>",
        "id": 1221151,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624928067
    },
    {
        "content": "<p>I think that may happen! Although some of these can't be addressed by any single client.</p>",
        "id": 1221152,
        "sender_full_name": "Greg Price",
        "timestamp": 1624928135
    },
    {
        "content": "<p>Can mobile provide a cool time picker widget for scheduling meetings?</p>",
        "id": 1221153,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624928191
    },
    {
        "content": "<p>Maybe, but either way, it'd be nice if web had a not-broken one.</p>",
        "id": 1221154,
        "sender_full_name": "Greg Price",
        "timestamp": 1624928215
    },
    {
        "content": "<p>I'm not looking for \"cool\" here.</p>",
        "id": 1221155,
        "sender_full_name": "Greg Price",
        "timestamp": 1624928223
    },
    {
        "content": "<p>Mission accomplished.</p>",
        "id": 1221156,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624928275
    },
    {
        "content": "<p>...</p>",
        "id": 1221157,
        "sender_full_name": "Greg Price",
        "timestamp": 1624928279
    },
    {
        "content": "<p>I agree with Wesley that there is a lot of work to do on our existing features. There's <em>certainly</em> a lot to do on mobile.</p>\n<p>I'm hearing responses from you that I take to be saying \"eh, it's good enough [on web]\". I think it is <em>not</em> good enough. We're not going to do everything overnight, and that's fine, but we should recognize when we have things half-built and we should put some effort into making them into finished features that are good experiences for people to use.</p>",
        "id": 1221160,
        "sender_full_name": "Greg Price",
        "timestamp": 1624928428
    },
    {
        "content": "<p>You’re completely misrepresenting my position here.</p>",
        "id": 1221183,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624938560
    },
    {
        "content": "<p>Let’s aside the poll widget, where I am obviously biased by being the author of a feature that seems to be simultaneously extremely mission critical to the company yet impossible to use.</p>",
        "id": 1221184,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624939315
    },
    {
        "content": "<p>I have no skin in the game with the time widget.</p>",
        "id": 1221185,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624939349
    },
    {
        "content": "<p>I learned how to use the time widget when Rohitt sent me a meeting request with the widget.</p>",
        "id": 1221186,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624939411
    },
    {
        "content": "<p>I don’t claim to be completely unaware of the widget’s history, but I was barely involved.</p>",
        "id": 1221187,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624939456
    },
    {
        "content": "<p>And when Rohitt sent me a message, I was like “that’s cool, how does it work?”  And he taught me how it worked.</p>",
        "id": 1221188,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624939517
    },
    {
        "content": "<p>It didn’t require “arcane knowledge” to use.  I just asked how to use it.</p>",
        "id": 1221189,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624939589
    },
    {
        "content": "<p>It wasn’t an “unwelcoming” or “terrible” experience.</p>",
        "id": 1221190,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624939671
    },
    {
        "content": "<p>Greg is being completely over dramatic about this subject.  Yes, we all have ideas on how to improve things.  We all want things to be better.  That’s all kind of a given, even though Greg doesn’t seem to want to give me the benefit of the doubt here.</p>",
        "id": 1221191,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624939791
    },
    {
        "content": "<p>There are also competing priorities.</p>",
        "id": 1221192,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624939818
    },
    {
        "content": "<p>The best two ways that Greg and Wesley can improve webapp polish are to either submit direct patches to the webapp or show the way on mobile.</p>",
        "id": 1221194,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624939900
    },
    {
        "content": "<p>Do we have a model feature here?  Something super polished that sets a higher bar?</p>",
        "id": 1221201,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624940183
    },
    {
        "content": "<p>If you read back through this thread, you will see that up until Greg entered the thread, all I did was ask questions, make hypotheses, provide historical context, offer solutions, agree with solutions, and occasionally throw out some challenges.</p>",
        "id": 1221205,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624940993
    },
    {
        "content": "<p>Here’s an important motivational concept, by the way.  If you want folks to polish a feature, spend 5x more time talking about how awesome it is than bitching about its shortcomings.</p>",
        "id": 1221208,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624941663
    },
    {
        "content": "<p>(Unless you can fix it yourself, but even then I still stand by the above advice)</p>",
        "id": 1221209,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624941834
    },
    {
        "content": "<p>Hi all, if I may, my read is that nobody is bitching about shortcomings, we're just having a constructive conversation. I hope you don't feel bad Steve cos you've done great work, and thank you! And I can see where you're coming from with the idea that users can ask and sometimes that does happen and it's fine, yes, but I have to agree with Greg, in that my experience (with Rocket Chat), most users <em>don't</em> do this and certainly don't do it often, and hence everyone has a worse time with the software... This is especially true for new people that aren't overly technical that already have a lot to deal with learning a new interface and layout, etc. They may also be overwhelmed as well as nervous about asking... TLDR, to my mind, the goal should be trying to ease people into your great work as easily as practically possible.</p>",
        "id": 1221998,
        "sender_full_name": "Jore",
        "timestamp": 1624950628
    },
    {
        "content": "<p>And if I was to think of something somewhat polished (or was at least very easy to use for a noob) I'd point to the \"Invite more users\" capability. It's kinda off topic to this discussion, but it's something I can think of that worked really well and was easy to use and intuitive. I'm sure there are other examples, I'll chime in when I think of some.</p>",
        "id": 1222000,
        "sender_full_name": "Jore",
        "timestamp": 1624950776
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1221042\">said</a>:</p>\n<blockquote>\n<p>[about poll widget...]</p>\n<p>There's no UI for it.</p>\n<p>It's not in the popup that the \"Help\" button displays -- and there's lots of text there to read through to find that out.</p>\n<p>In the case of polls, it's actually not even in the \"detailed help\" that that popup links to at the bottom:<br>\n<a href=\"help/format-your-message-using-markdown\">https://chat.zulip.org/help/format-your-message-using-markdown</a></p>\n<p>What there is is a link at the bottom of <em>that</em>, tucked into a little bulleted list. It takes you to a page that documents a syntax. The page doesn't have any picture of what the resulting poll might look like.</p>\n</blockquote>\n<p>Why would anybody invest in making a feature more discoverable until mobile actually supports it?</p>",
        "id": 1222307,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624974412
    },
    {
        "content": "<p>Thanks for all the thoughts, folks! The beginning of this thread was really interesting, but it seems to have digressed a bit and had an unfortunate shift in tone, so let me respond to the general discussion.</p>\n<ul>\n<li>I absolutely agree that polish is really important. If I had to guess, a majority of everyone's time goes into things that can be classified as \"polish\", in terms of how users experience it. One thing that is not obvious is just how much work making a polished feeling modern application is. I think we've all used plenty of UIs from extremely well funded companies that are super buggy, look weird, etc.  And most of those companies have like 5x less UI surface are that Zulip does. </li>\n<li>Given that it's possible to spend multiple person-months polishing a single feature (especially if one considers \"implementing all feature requests for polls\" as polish), it's inevitable that we have a lot of features that are not \"fully polished\".</li>\n<li>We're actively working to hire more design/frontend leadership, which should increase our capacity for doing some classes of this work.</li>\n</ul>",
        "id": 1222449,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1624988615
    },
    {
        "content": "<p>As one broader general point, I think talking about alpha/beta/etc. as statuses for features (or complaining that a feature hasn't been fully polished X months after first implementation) isn't a good way to think about the status of a feature. For one thing, there are competing priorities, and sometimes it takes some after a feature is first merged for us to know whether it's useful and something we want to build on.</p>\n<p>We as a project have literally hundreds of features we can work on, and work tends to happens in bursts of effort where someone spends a few weeks on a specific feature, generally also involving a lot of conversations in this stream and elsewhere to figure out a path forward that is actually better. (I think all of us have seen attempts at polishing the product that we can't merge because they end up not working out how we'd imagined beforehand).</p>\n<p>A better way to think about a feature is using more descriptive terminology: </p>\n<ul>\n<li>Nonexistent: Zulip does not have the feature.</li>\n<li>Checkbox (it's there, you can find it by reading our documentation and/or seeing other folks using it, and it might not be nice, but you can do it if you're determined to do so).  Checkbox features are really important competitively, because \"Zulip doesn't have polls\" is a much more significant objection than \"Zulip's polls aren't as nice as I'd like\".</li>\n<li>Complete: It can do all the things you naturally might want to do with that sort of widget (E.g. anonymous polls, editing, and other fancy things).</li>\n<li>Reasonably bug-free: To what extent are there visible bugs one might encounter using the feature.</li>\n<li>Polished: It looks nice and feels pleasant to use.</li>\n<li>Discoverable: It's easy to find the feature contextually within the app.</li>\n</ul>",
        "id": 1222452,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1624989297
    },
    {
        "content": "<p>So I think part of why folks were talking past each other about polls above is that currently polls are a checkbox feature that is moderately bug-free, not polished, not complete, and only socially discoverable (once you see one, you can figure out how to do it by googling if nothing else). That's still super valuable, and I'm very glad we have them even if their current state!</p>\n<p>I think <span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell (showell)</span> is absolutely right that socially discoverable is much better than \"not discoverable at all\".  Empirically, many organizations do discover polls (about 1/3 of active Zulip Cloud users are in an organization that's used a poll at least once). But I think <span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> is right that it'd be better if these useful features were \"Fully discoverable\", like emoji or the Giphy widget.</p>\n<p>I think it's reasonable to discuss (on a dedicated thread) to what extent we want to change one or all of those aspects of polls in particular. But I think precise terminology is very helpful for having a discussion about the status of a feature.  (I believe there is active work on the compose box that would support having a \"poll button\").</p>",
        "id": 1222456,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1624989860
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222456\">said</a>:</p>\n<blockquote>\n<p>[...]  (about 1/3 of active Zulip Cloud users are in an organization that's used a poll at least once)</p>\n</blockquote>\n<p>I honestly would have expected about 15% here.  I think we can all agree that polls aren't super discoverable, so the fact that we've \"infected\" 33% of the Cloud probably indicates how viral our membership is.</p>\n<p>I fully believe that one once person on a realm learns how to use the poll widget, then the rest of the users eventually learn.  Falling like dominoes (but in a good way).</p>\n<p>I don't understand the mechanism for how it transfers cross-realm.</p>",
        "id": 1222498,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624992807
    },
    {
        "content": "<p>A lot of big communities have some users who are in more than one Zulip organization.  (Or someone who stopped by here when evaluating, or read the documentation).</p>",
        "id": 1222502,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1624992862
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222502\">said</a>:</p>\n<blockquote>\n<p>A lot of big communities have some users who are in more than one Zulip organization.  (Or someone who stopped by here when evaluating, or read the documentation).</p>\n</blockquote>\n<p>That would be the most logical explanation, I think.</p>",
        "id": 1222503,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624992895
    },
    {
        "content": "<p>social learning in action</p>",
        "id": 1222506,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624992925
    },
    {
        "content": "<p>Yeah, 33% isn't bad, but one could hope for 80% or more, so there's certainly opportunity in making it more discoverable.  </p>\n<p>(And there's ongoing work on compose box design changes that would include exposing polls)</p>",
        "id": 1222507,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1624992994
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell (showell)</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222498\">said</a>:</p>\n<blockquote>\n<p>I fully believe that one once person on a realm learns how to use the poll widget, then the rest of the users eventually learn.  Falling like dominoes (but in a good way).</p>\n</blockquote>\n<p>I think that hypothesis is contradicted by the experience right here on <a href=\"http://chat.zulip.org\">chat.zulip.org</a>. How many people here create polls?</p>",
        "id": 1222514,
        "sender_full_name": "Greg Price",
        "timestamp": 1624993196
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222514\">said</a>:</p>\n<blockquote>\n<p>How many people here create polls?</p>\n</blockquote>\n<p>The snarky answer is everyone who wants to create one and can type \"/po\" in the compose box.</p>\n<p>If we want some analytics on this, can <span class=\"user-mention\" data-user-id=\"12178\">@Alex Vandiver</span> or somebody similar do a query here?</p>",
        "id": 1222520,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624993453
    },
    {
        "content": "<p><code>select distinct(sender_id) from zerver_submessage where content like '%widget_type%';</code></p>",
        "id": 1222522,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624993632
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>zulip=&gt; select count(distinct sender_id) from zerver_submessage where content like &#39;%widget_type%&#39;;\n count\n-------\n   163\n(1 row)\n</code></pre></div>",
        "id": 1222526,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1624993935
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222514\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell (showell)</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222498\">said</a>:</p>\n<blockquote>\n<p>I fully believe that one once person on a realm learns how to use the poll widget, then the rest of the users eventually learn.  Falling like dominoes (but in a good way).</p>\n</blockquote>\n<p>I think that hypothesis is contradicted by the experience right here on <a href=\"http://chat.zulip.org\">chat.zulip.org</a>. How many people here create polls?</p>\n</blockquote>\n<p>I mean, I'm aware they exist and have never been tempted to make one. (I didn't know how to make one, but I (correctly, I think) assumed that \"view source\" would likely tell me. I assume if I'd decided I really wanted one, I could have found a message with a poll to extract it from.)</p>",
        "id": 1222533,
        "sender_full_name": "Alex Dehnert",
        "timestamp": 1624994120
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell (showell)</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222520\">said</a>:</p>\n<blockquote>\n<p>The snarky answer is everyone who wants to create one and can type \"/po\" in the compose box.</p>\n</blockquote>\n<p>Let's please stop snarking about people's intelligence. That's not a helpful way to conduct a discussion.</p>",
        "id": 1222534,
        "sender_full_name": "Greg Price",
        "timestamp": 1624994158
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"12178\">Alex Vandiver</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222526\">said</a>:</p>\n<blockquote>\n<p>163</p>\n</blockquote>\n<p>Well, that's certainly more than I would have guessed! Interesting.</p>",
        "id": 1222535,
        "sender_full_name": "Greg Price",
        "timestamp": 1624994217
    },
    {
        "content": "<blockquote>\n<p>I mean, I'm aware they exist and have never been tempted to make one.</p>\n</blockquote>\n<p>I'm also aware of them, but have no inclination to use them (I avoid social media polls when I can)</p>",
        "id": 1222539,
        "sender_full_name": "Ken Clary",
        "timestamp": 1624994305
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222534\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell (showell)</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222520\">said</a>:</p>\n<blockquote>\n<p>The snarky answer is everyone who wants to create one and can type \"/po\" in the compose box.</p>\n</blockquote>\n<p>Let's please stop snarking about people's intelligence. That's not a helpful way to conduct a discussion.</p>\n</blockquote>\n<p>It's actually an anti-snark about people's intelligence.  The idea that people can't figure out \"/po\" is the arrogance.  The idea that 99% of the people can figure it out is the everyman's view.</p>",
        "id": 1222554,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624994816
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"12178\">Alex Vandiver</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222526\">said</a>:</p>\n<blockquote>\n<p><div class=\"codehilite\"><pre><span></span><code>zulip=&gt; select count(distinct sender_id) from zerver_submessage where content like &#39;%widget_type%&#39;;\n count\n-------\n   163\n(1 row)\n</code></pre></div><br>\n</p>\n</blockquote>\n<p>That honestly seems too high to be true.  (It includes the \"todo\" widget as well as the now-defunct tictactoe widget.)</p>",
        "id": 1222558,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624994948
    },
    {
        "content": "<p>Here's a slightly more precise query, if you have a moment, Alex:</p>\n<div class=\"codehilite\"><pre><span></span><code>select distinct(sender_id) from zerver_submessage where content like &#39;%widget_type&quot;: &quot;poll%&#39;;\n</code></pre></div>",
        "id": 1222560,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624995085
    },
    {
        "content": "<blockquote>\n<p>The idea that people can't figure out \"/po\" is the arrogance.</p>\n</blockquote>\n<p>I disagree.  Many users are not familiar with command-line UIs, and expect that the message compose box is for text, or maybe formated text -- but not commands.</p>\n<p>But I think that casting <em>any</em> side of this as arrogance is not helpful to the tone of the conversation.  I don't think that anyone is arguing that making it <em>more</em> discoverable via UI elements ia a bad idea; the quibbling is over \"how\" discoverable it is currently.  Which is a bit pointless, if we all agree that making it <em>more</em> so would be useful, and is in the short-term goals?</p>",
        "id": 1222575,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1624995429
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell (showell)</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222560\">said</a>:</p>\n<blockquote>\n<p>Here's a slightly more precise query, if you have a moment, Alex:</p>\n</blockquote>\n<p>127.</p>",
        "id": 1222577,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1624995473
    },
    {
        "content": "<p>Is making it more discoverable a short-term goal? That's news to me.</p>",
        "id": 1222579,
        "sender_full_name": "Greg Price",
        "timestamp": 1624995493
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222507\">said</a>:</p>\n<blockquote>\n<p>(And there's ongoing work on compose box design changes that would include exposing polls)</p>\n</blockquote>",
        "id": 1222582,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1624995528
    },
    {
        "content": "<p>Ah, I see. I'm curious about that ongoing work, then.</p>",
        "id": 1222586,
        "sender_full_name": "Greg Price",
        "timestamp": 1624995635
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"12178\">Alex Vandiver</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222575\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>The idea that people can't figure out \"/po\" is the arrogance.</p>\n</blockquote>\n<p>I disagree.  Many users are not familiar with command-line UIs, and expect that the message compose box is for text, or maybe formated text -- but not commands.</p>\n<p>But I think that casting <em>any</em> side of this as arrogance is not helpful to the tone of the conversation.  I don't think that anyone is arguing that making it <em>more</em> discoverable via UI elements ia a bad idea; the quibbling is over \"how\" discoverable it is currently.  Which is a bit pointless, if we all agree that making it <em>more</em> so would be useful, and is in the short-term goals?</p>\n</blockquote>\n<p>My main point is that people are smart, and they learn socially.  Unless I've totally forgotten how to do SQL, we have evidence that 100+ people have created polls on this realm, and I suspect at least 50% of the people who created polls asked somebody else for help.  It's not a bad thing. It's how social chat apps work.</p>",
        "id": 1222597,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624996178
    },
    {
        "content": "<p>I agree that people are smart, and learn socially -- and it's good that people can ask others for help!  I just think it's <em>better</em> if they don't <em>have</em> to, since not everyone will feel confident doing so. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 1222600,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1624996296
    },
    {
        "content": "<p>I hope that we make the poll feature 100% discoverable once it reaches a certain bar.  That \"bar\" isn't perfection.  I know the PR for poll support is gonna be merged soon.  We should maybe give a month to burn it in, then iterate on publicity and polishing.</p>",
        "id": 1222601,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624996308
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"12178\">Alex Vandiver</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222600\">said</a>:</p>\n<blockquote>\n<p>I agree that people are smart, and learn socially -- and it's good that people can ask others for help!  I just think it's <em>better</em> if they don't <em>have</em> to, since not everyone will feel confident doing so. :)</p>\n</blockquote>\n<p>I know I keep repeating the elephant in the room, but the main barrier to advertising how to use the poll widget is the lack of mobile support.  Once we merge that PR, it's a completely different discussion.</p>",
        "id": 1222602,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624996419
    },
    {
        "content": "<p>And to redundantly repeat myself redundantly, there is an opportunity for the mobile team to raise the bar here.  The server architecture for polls is ridiculously simple--you get events for the question, the options, and the votes.  Everything else is completely under control of the UI team on the relevant client app team.</p>",
        "id": 1222604,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624996571
    },
    {
        "content": "<p>:nod:  I hear you that feature-parity seems like it's helpful before doing more work here, and I somewhat agree.  But since <span class=\"user-mention silent\" data-user-id=\"17945\">Wesley Aptekar-Cassels</span> has started a PR on it, and work on <a href=\"https://github.com/zulip/zulip-mobile/pull/4704\">#M4704</a> is ongoing, I don't know that focusing on how it's not done yet advances the discussion in any way.</p>",
        "id": 1222605,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1624996784
    },
    {
        "content": "<p>I am mostly saying the discussion is premature.  Why are we complaining about the lack of discoverability of the poll widget when we're not actually ready for users to discover it?</p>",
        "id": 1222609,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624997058
    },
    {
        "content": "<p>There's been a lot of talk in this thread about discoverability. I'd like to redirect attention to the fact that that represents a small sliver of the polish issues that started this thread.</p>",
        "id": 1222610,
        "sender_full_name": "Greg Price",
        "timestamp": 1624997104
    },
    {
        "content": "<p>Do we need to have this conversation in the abstract, or can we move to specific conversations about the poll widget and timestamp widget?  As I pointed out to Wesley earlier, the timestamp widget is being discussed.</p>",
        "id": 1222617,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624997321
    },
    {
        "content": "<p>Here's a link to a link: <a href=\"#narrow/stream/101-design/topic/polish/near/1220124\">https://chat.zulip.org/#narrow/stream/101-design/topic/polish/near/1220124</a></p>",
        "id": 1222619,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624997352
    },
    {
        "content": "<p>It's kind of a funny discussion, because people are getting torn over the fact that Israel, Ireland, and India all call their time zones something akin to \"IT\".</p>",
        "id": 1222622,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624997426
    },
    {
        "content": "<p>I think that splitting out specific things to different threads is a good idea. I also think that we may end up talking in circles re: the poll widget (although I will take this as an opportunity to poke <span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> about reviewing <a href=\"https://github.com/zulip/zulip-mobile/pull/4704\">#M4704</a> <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> )</p>",
        "id": 1222623,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1624997430
    },
    {
        "content": "<p>I do think there's value in a more general discussion as well, though.</p>",
        "id": 1222626,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1624997492
    },
    {
        "content": "<p>I just bumped <a href=\"#narrow/stream/6-frontend/topic/poll.20widget\">https://chat.zulip.org/#narrow/stream/6-frontend/topic/poll.20widget</a></p>",
        "id": 1222627,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624997495
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"17945\">Wesley Aptekar-Cassels</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222626\">said</a>:</p>\n<blockquote>\n<p>I do think there's value in a more general discussion as well, though.</p>\n</blockquote>\n<p>Fair enough.</p>",
        "id": 1222628,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624997508
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell (showell)</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222619\">said</a>:</p>\n<blockquote>\n<p>Here's a link to a link: <a href=\"#narrow/stream/101-design/topic/polish/near/1220124\">https://chat.zulip.org/#narrow/stream/101-design/topic/polish/near/1220124</a></p>\n</blockquote>\n<p>I'd be glad to see a thread about the time picker widget, but I think that isn't one -- it's about how we display a timestamp.</p>",
        "id": 1222629,
        "sender_full_name": "Greg Price",
        "timestamp": 1624997536
    },
    {
        "content": "<p>Yeah, I may have found the wrong thread.</p>",
        "id": 1222637,
        "sender_full_name": "Steve Howell",
        "timestamp": 1624997868
    },
    {
        "content": "<blockquote>\n<p>As much as I agree that \"general look and feel\" is an area that we get criticized on and can certainly improve on, it's kind of overly, um, general. Whereas the next two are something where one individual can really do a deep dive.</p>\n</blockquote>\n<p>For instance, here's something we can have a general discussion about in a productive way, I think. We've identified a problem — people are unhappy with the \"general look and feel\" of Zulip. What's our strategy for fixing that?</p>\n<p>I think this is an interesting thing to look at, since there are several parts to it, and I think we may be blocking some of the easy parts on the hard parts unnecessarily. I see the \"hard parts\" here as coming up with a cohesive and attractive visual style for Zulip, building a library of UI components that fit that theme, and switching the whole app to using them. That's a lot of work, which will require a designer, lots of discussion, lots of sort of tricky frontend work, etc. But there's also a lot of more tactical work that we can go in order to move in a better direction, even if we aren't sure what the exact destination is.</p>\n<p>And, to be fair, a lot of this is work that we're doing! A lot of the chatter in <a class=\"stream\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design\">#design</a> is about this sort of thing. But I think we could stand to do more of trying to look at the UI with fresh eyes, and looking for things that could be improved. I think one thing we could do here is try to make reporting small papercuts lower friction — perhaps a running topic in <a class=\"stream\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback\">#feedback</a> for people to post things that feel too small to start a new thread for. For instance, <a href=\"https://github.com/zulip/zulip/pull/19053\">#19053</a> is something I noticed just now which feels a little silly to make an issue for since it's so small, but is absolutely something we should fix, since it looks pretty embarrassing as soon as you notice it. <a href=\"https://github.com/zulip/zulip/pull/19055\">#19055</a> is similar — it's a small thing which is easy miss or to not follow up on, but if we do around a dozen things of that size, I think the app will feel noticeably nicer and less ugly.</p>\n<p>Even as someone who is employed by Zulip, I often run into things that look a little funky, but it just feels like a lot of effort to make an issue, so I put it off and then forget.</p>\n<p>We could also try things like having a \"frontend polish week\", where people dedicate time to looking for things to polish and then implementing them.</p>",
        "id": 1222690,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1624999293
    },
    {
        "content": "<p>I would also be happy to take a shot at writing up some general UI principles, if that's something we think would be useful. I do think there's a lot of stuff that we get right (being keyboard friendly, responsive, avoiding things popping up without user interaction, etc), but there are also things we can improve on.</p>\n<p>I suspect that a broader plan for coming up with a more cohesive UI language for Zulip would look something like:</p>\n<ul>\n<li>Come up with design principles (things that we care about that our UI should enable and strive for)</li>\n<li>Come up with a frontend style guide, including things like font sizes, icon sizes, and a library of UI widgets for different usecases</li>\n<li>Choose a small part of the UI to start converting to the style we're aiming for, so that we can talk about it in a concrete context</li>\n<li>Iteratively discuss the style guide and implement it in more places, making sure that when we make decisions that are generic, we write them down.</li>\n</ul>\n<p>Obviously this is something that it would help to engage a designer in, but I think there's value in starting that now, and I'd be happy to start a doc for it if it's something people think is valuable.</p>",
        "id": 1222698,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1624999709
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"17945\">Wesley Aptekar-Cassels</span> <a href=\"#narrow/stream/101-design/topic/polish/near/1222690\">said</a>:</p>\n<blockquote>\n<p>Even as someone who is employed by Zulip, I often run into things that look a little funky, but it just feels like a lot of effort to make an issue, so I put it off and then forget.</p>\n</blockquote>\n<p>I have this experience too, and would be glad to find ways to streamline this.</p>",
        "id": 1222702,
        "sender_full_name": "Greg Price",
        "timestamp": 1624999992
    },
    {
        "content": "<blockquote>\n<p>I think one thing we could do here is try to make reporting small papercuts lower friction — perhaps a running topic in <a class=\"stream\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback\">#feedback</a> for people to post things that feel too small to start a new thread for.</p>\n</blockquote>\n<p>FWIW I tend to find that starting a thread in <a class=\"stream\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback\">#feedback</a> or <a class=\"stream\" data-stream-id=\"9\" href=\"/#narrow/stream/9-issues\">#issues</a> is usually the lowest-barrier way to report small things now.</p>\n<p>Often the conclusion of the thread is that I end up going and filing an issue. But the chat thread is a smaller bit of work to start, and usually it gets some replies that help me feel like filing an issue is worthwhile.</p>\n<p>I do think having a fresh thread for each one is valuable -- it helps the issue not get lost among other issues.</p>",
        "id": 1222704,
        "sender_full_name": "Greg Price",
        "timestamp": 1625000048
    },
    {
        "content": "<p>Yeah, I agree that starting a conversation in <a class=\"stream\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback\">#feedback</a> is the best way to start a conversation about a papercut.  In part because I think it requires some lightweight discussion and context on what else is in progress in order to be able to write up an effective issue.</p>",
        "id": 1222728,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1625001546
    },
    {
        "content": "<p>Since this conversation, I've been trying to start more topics for things I notice. So far:</p>\n<ul>\n<li><a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/users.20subscribed.20tooltip.20direction\">#feedback &gt; users subscribed tooltip direction</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/stream.20name.20tooltips\">#feedback &gt; stream name tooltips</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/topic.20input.20box.20width\">#feedback &gt; topic input box width</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/.22Condense.22.20vs.20.22Collapse.22\">#feedback &gt; \"Condense\" vs \"Collapse\"</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"9\" href=\"/#narrow/stream/9-issues/topic/.22New.20private.20message.22.20isn.27t\">#issues &gt; \"New private message\" isn't</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"9\" href=\"/#narrow/stream/9-issues/topic/typeahead.20while.20editing\">#issues &gt; typeahead while editing</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"9\" href=\"/#narrow/stream/9-issues/topic/page.20title.20not.20updating\">#issues &gt; page title not updating</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/drafts.20in.20sidebar\">#design &gt; drafts in sidebar</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/blue.20box\">#design &gt; blue box</a> </li>\n</ul>\n<p>I'd encourage other people to do the same :)</p>",
        "id": 1224920,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1625432491
    },
    {
        "content": "<p>I think this sort of thing is great; while not everything will result in a change, I think we've already merged fixes for a few of these.</p>",
        "id": 1225575,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1625532078
    },
    {
        "content": "<p>Bumping this topic. I've got an idea for improving the look of the Poll widget here: <a href=\"https://github.com/nooblag/zulip/commit/e11a50cca1b68b9078b0800dd95e3e9e9ef9ce4c\">https://github.com/nooblag/zulip/commit/e11a50cca1b68b9078b0800dd95e3e9e9ef9ce4c</a></p>\n<h4>Before</h4>\n<p><a href=\"/user_uploads/2/6d/8KAvBHyvWaLigyLNHhtaZxAm/before.gif\">before.gif</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/6d/8KAvBHyvWaLigyLNHhtaZxAm/before.gif\" title=\"before.gif\"><img src=\"/user_uploads/2/6d/8KAvBHyvWaLigyLNHhtaZxAm/before.gif\"></a></div><h4>After</h4>\n<p><a href=\"/user_uploads/2/a0/O_ZCBfMA5Y4kc5z4-tzXtfAb/after.gif\">after.gif</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/a0/O_ZCBfMA5Y4kc5z4-tzXtfAb/after.gif\" title=\"after.gif\"><img src=\"/user_uploads/2/a0/O_ZCBfMA5Y4kc5z4-tzXtfAb/after.gif\"></a></div><p><a href=\"/user_uploads/2/c1/z1LM-EIWUYJJmi7ZQGFaDMam/Before_After-bigNumbersTest.png\">Before_After-bigNumbersTest.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/c1/z1LM-EIWUYJJmi7ZQGFaDMam/Before_After-bigNumbersTest.png\" title=\"Before_After-bigNumbersTest.png\"><img src=\"/user_uploads/2/c1/z1LM-EIWUYJJmi7ZQGFaDMam/Before_After-bigNumbersTest.png\"></a></div>",
        "id": 1260024,
        "sender_full_name": "Jore",
        "timestamp": 1632915654
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"20503\">@Jore</span>  I agree that the <strong>After</strong> version looks nicer! I'd be happy to see this change implemented.</p>",
        "id": 1260111,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1632935869
    },
    {
        "content": "<p>Yeah, that looks nicer to me as well.</p>",
        "id": 1260192,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1632939289
    },
    {
        "content": "<p>Cool, created PR for it: <a href=\"https://github.com/zulip/zulip/pull/19869\">#19869</a></p>",
        "id": 1261189,
        "sender_full_name": "Jore",
        "timestamp": 1633002670
    },
    {
        "content": "<p>Also just updated the PR for night mode <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 1261602,
        "sender_full_name": "Jore",
        "timestamp": 1633082578
    },
    {
        "content": "<p>Heya <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> <span class=\"user-mention\" data-user-id=\"5140\">@Aman Agrawal (amanagr)</span> Hope you're well out there. Just a polite ping on this PR which is ready to be merged if everyone is happy with it. <a href=\"https://github.com/zulip/zulip/pull/19869\">https://github.com/zulip/zulip/pull/19869</a></p>",
        "id": 1272327,
        "sender_full_name": "Jore",
        "timestamp": 1635280061
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"20503\">@Jore</span> oops, sorry I lost track of that, merged.  Thanks for the ping!</p>",
        "id": 1272404,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1635286528
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> No worries, thanks Tim</p>",
        "id": 1272675,
        "sender_full_name": "Jore",
        "timestamp": 1635311491
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"20503\">@Jore</span> if you are interested in doing more polish on our widgets, it would be great if <code>/todo</code> and <code>/poll</code> looked consistent with each other. I filed <a href=\"https://github.com/zulip/zulip/pull/20283\">#20283</a>.</p>",
        "id": 1283352,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1637177925
    }
]