[
    {
        "content": "<p>Continuing a conversation from #mobile, <a href=\"#narrow/stream/48-mobile/topic/poll.20widget/near/768137\" title=\"#narrow/stream/48-mobile/topic/poll.20widget/near/768137\">here</a>, about the design of the Poll widget, since there were some issues realised with the webapp's design as well. Besides, on design considerations, it will be better to get opinions from everyone! Continuing the conversation from there -- the following are my replies and opinions <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span>.</p>\n<blockquote>\n<ul>\n<li>\n<p>One bit of functionality I notice isn't there yet: the list of people who voted for each option.</p>\n<p>I think this is a pretty key bit of the poll functionality for many use cases, so adding that will be an important followup step.</p>\n</li>\n</ul>\n</blockquote>\n<p>That should be easy to add data flow wise, I was very confused about the design though.</p>\n<blockquote>\n<p>The heading looks actually bigger than on the webapp. We can probably dial it back to the same size.</p>\n</blockquote>\n<p>True, I was having doubts about its size.</p>\n<blockquote>\n<p>The border, and associated padding, make the available space narrower. We already have less space to work with than the webapp, so it's likely best to leave that out.</p>\n</blockquote>\n<p>I think the border is important to keep, since they do make the messages 'widgets', and as you said, differentiates between a normal message, and the other. </p>\n<p>Since you said later that the 'votes button' needs to go (which I agree with completely), these borders might provide a nice framework to put all the options in -- without them, we'd have a lesser number of ways we could properly display the options. The design I have in mind, is this -<br>\n- The box which currently exists, stays. The insides get changed though.<br>\n- The heading remains the same -- with the font-size change<br>\n- The options appear as a list, without any apparent button on screen -- so only the text, listed.<br>\n- Once you click an option, it would have the <a href=\"https://material-components.github.io/material-components-web-catalog/#/component/ripple\" target=\"_blank\" title=\"https://material-components.github.io/material-components-web-catalog/#/component/ripple\">ripple</a> effect, and the option would essentially be voted on.<br>\n- Any option which the user has voted for will have it's row in the list highlighted (the same way the reactions get highlighted currently in the mobile app).<br>\n- The number of votes would be on the right of each row, with a lower opacity.<br>\n- The user would be able to see who voted for each option by long pressing on it.</p>\n<p>I will post a mockup of this design soon in case it's hard to understand.</p>\n<blockquote>\n<p>The border under the poll question feels like too much separation. Remember that it's a question and the options are answers... so they're basically consecutive sentences in a conversation.</p>\n</blockquote>\n<p>That is true. Can we perhaps lower it's opacity, and it'll improve? <a href=\"/user_uploads/2/34/HGvfw912nAkuu2nZsh96wfoY/Screenshot-2019-07-16-at-3.56.02-AM.png\" target=\"_blank\" title=\"Screenshot-2019-07-16-at-3.56.02-AM.png\">Like this?</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/34/HGvfw912nAkuu2nZsh96wfoY/Screenshot-2019-07-16-at-3.56.02-AM.png\" target=\"_blank\" title=\"Like this?\"><img src=\"/user_uploads/2/34/HGvfw912nAkuu2nZsh96wfoY/Screenshot-2019-07-16-at-3.56.02-AM.png\"></a></div>",
        "id": 768345,
        "sender_full_name": "Isham Mahajan",
        "timestamp": 1563229818
    }
]