[
    {
        "content": "<p>We are adding \"Pronouns\" custom field type in <a href=\"https://github.com/zulip/zulip/pull/23135\">#23135</a>. Issue is <a href=\"https://github.com/zulip/zulip/pull/21271\">#21271</a>.</p>\n<p>We want to show some commonly used pronouns in typeahead for suggestions in the user settin, even though user is not restricted to select only from typeahead. Any suggestions for what pronouns we should show in the typeahead?</p>",
        "id": 1445585,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1665078348
    },
    {
        "content": "<p>Yeah, I think it's clear we'll want to include <code>she/her</code>, <code>he/him</code>, <code>they/them</code>, and the ability to enter whatever you like, which we already support. <a href=\"https://lgbtqia.ucdavis.edu/educated/pronouns-inclusive-language\">https://lgbtqia.ucdavis.edu/educated/pronouns-inclusive-language</a> suggests those are the primary common ones but lists ~10 others that might show up; I don't know if it'd be better to have the ~10 others in a dropdown (or if, say, 3 of those are 100x more common than the rest, and we should just have those).</p>",
        "id": 1445670,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1665084553
    },
    {
        "content": "<p>IME the other pronouns on that list are very rare.</p>\n<p>After \"she/her\", \"he/him\", and \"they/them\", I think the next-most-common answers I see are:</p>\n<ul>\n<li>\"he/they\" (i.e., use either he/him or they/them pronouns)</li>\n<li>\"she/they\"</li>\n<li>\"no pronouns\" (i.e., just always use the person's name)</li>\n<li>\"any pronouns\"</li>\n</ul>",
        "id": 1445767,
        "sender_full_name": "Greg Price",
        "timestamp": 1665092108
    },
    {
        "content": "<p>I think providing the three most common choices, and letting people with other answers fill them in freeform, is the best solution.</p>\n<p>One reason it's good to keep the list short is that for the 80-90% or so of people who haven't much thought about the question, it keeps it simple and helps encourage them to just pick the answer that's obvious for them and move on.</p>",
        "id": 1445768,
        "sender_full_name": "Greg Price",
        "timestamp": 1665092112
    },
    {
        "content": "<p>One illustration of how uncommon the pronouns other than the \"she\", \"he\", and \"they\" series are is that the authors of that page have gotten the last row of the table wrong. And that's one of the <em>least</em> rare of them, one of the few I'd actually heard of. It <a href=\"https://en.wiktionary.org/wiki/ve#Etymology_2\">should be</a> ve/ver/vis, not ve/vis/ver.</p>",
        "id": 1445769,
        "sender_full_name": "Greg Price",
        "timestamp": 1665092529
    },
    {
        "content": "<p>(And to get that wrong they have to have really not even tried to say it aloud in a sentence -- when you do it becomes clear which way is which.)</p>",
        "id": 1445770,
        "sender_full_name": "Greg Price",
        "timestamp": 1665092595
    },
    {
        "content": "<p>OK, sounds good, that appears to be what we already have in the PR, so we can proceed with that plan for now.</p>",
        "id": 1445855,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1665099643
    },
    {
        "content": "<p>Just noting here that documentation changes are still pending.</p>",
        "id": 1446074,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1665136022
    }
]