[
    {
        "content": "<p>There has been talk of switching q and w. I think 1.7 is as good a time as any to make breaking hotkey changes. Thoughts?</p>",
        "id": 286603,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1506270389
    },
    {
        "content": "<p>I support that change.</p>",
        "id": 286611,
        "sender_full_name": "Steve Howell",
        "timestamp": 1506273217
    },
    {
        "content": "<p>I up for the change also.</p>",
        "id": 286613,
        "sender_full_name": "Joshua Pan",
        "timestamp": 1506275206
    },
    {
        "content": "<p>sweet. Any other breaking hotkey changes we want to make for 1.7? On my list:</p>\n<ul>\n<li>C -&gt; x</li>\n<li>Remove A and D (to be replaced with keyboard navigation of the left sidebar, or ctrl-shift-down, or something else to be decided later)</li>\n<li>switch q and w</li>\n<li>switch s and S, or change s to be a toggle between topic and stream narrow. </li>\n</ul>\n<p>Hasn't yet been discussed:</p>\n<ul>\n<li>Possibly P should be p?</li>\n<li>I think having n and S in stream settings is a bit confusing, especially n, which is in the top five hotkeys we want everyone to learn. E.g. currently if you hover over the create-new-stream button in stream settings, the title text is \"Create new stream (n)\", which is confusing if you think n = next unread topic (partly since most other products don't reuse hotkeys in this way). <br>\nI think the natural hotkey for \"create a new stream\" is one that should be usable from the main webapp, though I don't have a good proposal. Maybe alt+shift+s?<br>\nI think it would be good to replace stream settings S as well, if anyone has ideas. Maybe <code>t</code>, for toggle subscription?</li>\n</ul>",
        "id": 286619,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1506278941
    },
    {
        "content": "<p>Al these ideas same good to me.</p>",
        "id": 286621,
        "sender_full_name": "Steve Howell",
        "timestamp": 1506279321
    },
    {
        "content": "<p>switching <code>q/w</code> seems good to do fast; the rest I feel like are bigger risks.  <span class=\"user-mention\" data-user-email=\"joshuapan8@gmail.com\" data-user-id=\"857\">@Joshua Pan</span> would you be able to do the q/w swap quickly?</p>",
        "id": 286760,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1506312730
    },
    {
        "content": "<p>Sure, on it right now</p>",
        "id": 286761,
        "sender_full_name": "Joshua Pan",
        "timestamp": 1506312743
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"tabbott@zulipchat.com\" data-user-id=\"7\">@Tim Abbott</span> done <a href=\"https://github.com/zulip/zulip/pull/6658\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/6658\">#6658</a></p>",
        "id": 286768,
        "sender_full_name": "Joshua Pan",
        "timestamp": 1506313295
    },
    {
        "content": "<p>(Ran node tests locally, but probably should wait for Travis)</p>",
        "id": 286769,
        "sender_full_name": "Joshua Pan",
        "timestamp": 1506313316
    },
    {
        "content": "<p>Another hotkey we should consider re-mapping is ESC -&gt; H, to avoid the nasty pitfall of ESC dumping you into a confusing interleaved view when you aren't expecting it.</p>\n<p>I understand TIm's concern about the risk for 1.7, so I wonder if it makes sense to do most of the re-mappings in a quick follow up release?  I'd be up for calling the subsequent release 1.8, because even if it doesn't contain lots of stuff, we could treat it as a release where we undo a few legacy decisions.</p>",
        "id": 286932,
        "sender_full_name": "Steve Howell",
        "timestamp": 1506356608
    },
    {
        "content": "<p>ah yeah. I feel like the discussion at the time was around making ESC/H a user option? Since the people that like ESC to home really like it, and the people that don't really don't. <br>\nBumping to 1.8 is reasonable, if it's too late to get these in to 1.7.</p>",
        "id": 286933,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1506357590
    },
    {
        "content": "<p>Yeah, I think we shouldn't do the rest of these for 1.7; it feels too risky to add at this late point.</p>",
        "id": 286935,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1506358005
    }
]