[
    {
        "content": "<p>I created a draft PR for a recent conversations view for streams and would love if folks played around with it and gave some feedback!</p>",
        "id": 1619220,
        "sender_full_name": "Evy",
        "timestamp": 1691021759
    },
    {
        "content": "<p><a href=\"https://github.com/zulip/zulip/pull/26409\">https://github.com/zulip/zulip/pull/26409</a></p>",
        "id": 1619221,
        "sender_full_name": "Evy",
        "timestamp": 1691021768
    },
    {
        "content": "<p><a href=\"/user_uploads/2/3b/x4B-AsovPD5v3dNBmZMRtc0K/257968058-a8354926-fe10-4da1-a337-3ab252a31ded.gif\">257968058-a8354926-fe10-4da1-a337-3ab252a31ded.gif</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/3b/x4B-AsovPD5v3dNBmZMRtc0K/257968058-a8354926-fe10-4da1-a337-3ab252a31ded.gif\" title=\"257968058-a8354926-fe10-4da1-a337-3ab252a31ded.gif\"><img src=\"/user_uploads/2/3b/x4B-AsovPD5v3dNBmZMRtc0K/257968058-a8354926-fe10-4da1-a337-3ab252a31ded.gif\"></a></div>",
        "id": 1619224,
        "sender_full_name": "Evy",
        "timestamp": 1691021800
    },
    {
        "content": "<ul>\n<li>There's still work to do to add the setting/option to also access the interleaved view.</li>\n<li>I have an open question about if it's worth the extra work to make each stream's filter defaults stored separately (see code comment).</li>\n<li>There's some weird stuff going on with the highlight of the buttons, but that's present on CZO as well. (and probably should be looked into)</li>\n</ul>",
        "id": 1619225,
        "sender_full_name": "Evy",
        "timestamp": 1691021818
    },
    {
        "content": "<p>I understand there has been a desire for this kind of feature, and users find the interleaved views confusing. I use recent conversations myself on czo, if rarely using any of the filters, so it's interesting to see this idea <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 1619292,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1691030695
    },
    {
        "content": "<p>From the recording my first take was to be a little wary of how what is primarily (historically) the message list area will now be flipping between that and more variations of the recent conversations views. I think that my feeling of that may have arisen since they seem like different views - they're filtered to a stream, and titled as such, but it's unclear if they're actually the same UI. For example, can I adjust the title like a search term and recover recent conversations? Search from recent conversations can't filter to a stream right now; will it be adjusted so I can get from there to a stream version?</p>",
        "id": 1619293,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1691030706
    },
    {
        "content": "<p>Another query would be how much purpose the expanding-topic list in the left panel retains - it is less detailed and featureful than this new view, even if in a topic narrow it enables switching between a subset of topics. However, the filtering of the stream topics in the new view presumably doesn't apply to the left panel topic list? Would it be simpler to drop that list if this feature is enabled?</p>",
        "id": 1619294,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1691030709
    },
    {
        "content": "<p>I like the experiment here, Evy. One question that occurs to me about such a view is what can actually be <em>done</em> there. Like, why might a user want to interact with topics from that view versus the LSB? As things stand, the LSB provides more, and more obvious, actions on a given topic than the view inspired by Recent conversations.</p>",
        "id": 1619428,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1691082835
    },
    {
        "content": "<p>LSB=Left Side Bar? (I've normally called this the left panel, but I'm not sure we have a glossary)</p>",
        "id": 1619432,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1691083003
    },
    {
        "content": "<p>Ooops, yes, Left Side Bar :)</p>",
        "id": 1619433,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1691083028
    },
    {
        "content": "<p>I could swear I saw some other use of that, but searching CZO suggests if someone else is using \"LSB,\" it wasn't here.</p>",
        "id": 1619434,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1691083086
    },
    {
        "content": "<blockquote>\n<p>why might a user want to interact with topics from that view versus the LSB? </p>\n</blockquote>\n<p>The idea is to never land user in the interleaved view where things can be confusing to new users. Also, recent topics offers a much more organized and informative view of a topic helping you decide which topic can be more important to read first or read at all right now.</p>",
        "id": 1619447,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1691085841
    },
    {
        "content": "<blockquote>\n<p>We do need a different design for recent conversations filters. One that shows which stream is selected, has multi-select dropdown widget and a search bar.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"5140\">@Aman (amanagr)</span> are you thinking we need that for stream recent conversations? Can you explain why?</p>\n<p>If you had something like that screenshot, what would happen if you selected more streams or removed the stream filter -- would the narrow change? As a user, I expect clicking on a stream to show me only topics from that stream and not be part of some bigger filtering thing.</p>",
        "id": 1619451,
        "sender_full_name": "Evy",
        "timestamp": 1691086877
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"5140\">Aman (amanagr)</span> <a href=\"#narrow/stream/101-design/topic/recent.20conversations.20for.20streams/near/1619447\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>why might a user want to interact with topics from that view versus the LSB? </p>\n</blockquote>\n<p>The idea is to never land user in the interleaved view where things can be confusing to new users. Also, recent topics offers a much more organized and informative view of a topic helping you decide which topic can be more important to read first or read at all right now.</p>\n</blockquote>\n<p>Exactly  -- the main motivation for me was to replace the interleaved view. But there are also other motivations like showing all the extra information that Recent Conversations shows (people participating in the conversation, filtering by muted or participated, etc). I also don't like that the side bar involves an extra click to search for topic names, and Recent Conversations has that built into the main view.</p>",
        "id": 1619454,
        "sender_full_name": "Evy",
        "timestamp": 1691087030
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"5140\">Aman (amanagr)</span> <a href=\"#narrow/stream/101-design/topic/recent.20conversations.20for.20streams/near/1619453\">said</a>:</p>\n<blockquote>\n<p>But, I am thinking if you are using recent conversation and want to filter by stream, what should the design be like.</p>\n</blockquote>\n<p>Can you keep that in a separate design conversation than this one which is about the view for when you click on a stream name in the left side bar?</p>",
        "id": 1619456,
        "sender_full_name": "Evy",
        "timestamp": 1691087069
    },
    {
        "content": "<p>It feels like a mostly different set of UX questions and use cases, and I don't want to overcomplicate what this situation needs.</p>",
        "id": 1619457,
        "sender_full_name": "Evy",
        "timestamp": 1691087100
    },
    {
        "content": "<p>Moved to <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/recent.20topics.20multiselect.20filters\">#design &gt; recent topics multiselect filters</a></p>",
        "id": 1619464,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1691087415
    },
    {
        "content": "<p>As I mentioned <a href=\"https://github.com/zulip/zulip/pull/26409#issuecomment-1663759680\">here</a>, from previous discussion on this, we wanted for user to be able to fetch more history otherwise this recent conversation view of stream feels very empty and perhaps misleading to some extent.</p>",
        "id": 1619474,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1691087553
    },
    {
        "content": "<p>But I guess, this is a good starting point to merge as a development only feature maybe.</p>",
        "id": 1619477,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1691087629
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2406\">Neil Pilgrim (neiljp)</span> <a href=\"#narrow/stream/101-design/topic/recent.20conversations.20for.20streams/near/1619293\">said</a>:</p>\n<blockquote>\n<p>[...]<br>\nI think that my feeling of that may have arisen since they seem like different views - they're filtered to a stream, and titled as such, but it's unclear if they're actually the same UI. For example, can I adjust the title like a search term and recover recent conversations? Search from recent conversations can't filter to a stream right now; will it be adjusted so I can get from there to a stream version?</p>\n</blockquote>\n<p>Aman followed up on this a little, but to clarify:</p>\n<ul>\n<li>recent conversations is special in that the search area is disconnected from the area below (which is special in not being a typical \"message list\")</li>\n<li>recent conversations search starts from nothing, independently of the recent conversations filters</li>\n<li>regular message list narrows for streams, topics, etc. have the search area title prefilled with the narrow title (eg. stream name)</li>\n<li>regular message list narrows allow editing of the search, to remove a simple narrow filter (eg. stream, topic) or add to it</li>\n</ul>\n<p>Your prototype shows recent conversations with a stream title. That requires reconciling the above points, to make it clear how the user interacting with the search bar will now behave:</p>\n<ul>\n<li>will it not prefill with the stream filter text, like the existing recent conversations? That would be inconsistent with the title being present</li>\n<li>so will it prefill with the stream filter text?</li>\n<li>what does hitting enter on the stream search text do? Does it go to a stream narrow or back to the Stream+recentconversations view?</li>\n<li>if I delete any prefilled stream filter text, would that take me to recent conversations or all messages?</li>\n<li>what if I add another search term?</li>\n</ul>\n<p>The simplest solution might be to introduce a search term that specifically refers to recent conversations, ie. enables an interactive additional search feature. Then we could have a prefilled element for recent conversations (eg. <code>is:filtered-recently</code>), and a stream version would combine that with the stream name, and also enable combinations with a topic name, or whatever else.</p>",
        "id": 1619507,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1691089603
    },
    {
        "content": "<p>Ah I see yeah so there's some issue here around search. I'd expect searching for a stream to show me all messages for a stream, i.e. the interleaved view. I'd want clicking on the stream to show me something different though.</p>",
        "id": 1620529,
        "sender_full_name": "Evy",
        "timestamp": 1691377689
    },
    {
        "content": "<p>I don't find it very intuitive that something like recent conversations would have a search item at all for it, but I'm also not a user that uses search filters to navigate through narrows.</p>",
        "id": 1620530,
        "sender_full_name": "Evy",
        "timestamp": 1691377724
    },
    {
        "content": "<p>The reason I find it not intuitive is it that to me, searching should always show a result that is the messages which correspond to the search. If there aren't messages in the view, I wouldn't expect search to have anything in it.</p>",
        "id": 1620531,
        "sender_full_name": "Evy",
        "timestamp": 1691377813
    },
    {
        "content": "<p>I personally think search filters should work this way:</p>\n<ul>\n<li>Recent Conversations always has an empty search bar (no filters), both or org-wide and only stream-wide.</li>\n<li>If the search bar is empty and you hit enter, it just closes the search bar and doesn't navigate you to anywhere (currently it navigates me to all messages)</li>\n<li>You can't \"add filters\" to recent conversations views, because they're not message narrows.</li>\n<li>Searching <code>stream:foo</code> shows you the interleaved view for all messages in <code>#foo</code></li>\n</ul>",
        "id": 1620532,
        "sender_full_name": "Evy",
        "timestamp": 1691378009
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"2406\">@Neil Pilgrim (neiljp)</span> curious what you think about that proposal, being more familiar with user interaction for these things.</p>",
        "id": 1620533,
        "sender_full_name": "Evy",
        "timestamp": 1691378032
    },
    {
        "content": "<p>My perspectives on your bullet points:</p>\n<ul>\n<li>My suspicion would be that recent conversations has no initial search filters, since it was the alternative presentation of all messages, which also has no filters.</li>\n<li>Having no pre-filled 'filters' when searching in a stream equivalent of recent conversations may be simpler for users in one way - just click and type - and this matches the current recent conversations view. However, right now that's inconsistent with how every other (messages) view pre-fills with the existing narrow filter. I feel the current recent conversations view gets an exception due to my first point.</li>\n<li>I agree that hitting enter on an empty search going to a different place is confusing. Perhaps that could go to the default starting narrow (all messages vs recent conversations)? However, that may remove the possibility of a user accessing all messages via the search bar.</li>\n<li>While recent conversations is not strictly a regular message list view/narrow, I view it as simply a different collapsed view of (all) messages. The recent conversations checkboxes and topic filter are akin to persistent friendly versions of our search filters. So adding search filters feels natural to me, and something to integrate.</li>\n<li>Having <code>stream:foo</code> go to interleaved <code>#foo</code> is fine. How can I jump to a recent conversations view of <code>#foo</code>, without clicking on a stream when it's configured that way?</li>\n</ul>",
        "id": 1621224,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1691477414
    },
    {
        "content": "<p>In broadening the application of recent conversations, my sense is that we could go two ways:</p>\n<ul>\n<li>Emphasize Search (and filters in that bar) as a distinct entity separate from recent conversations views. The title of stream recent conversations would be distinct from the search bar, using search leaves any recent conversations view and enters a traditional message list view, search filters don't affect recent conversations views, recent conversations filters do not affect initial search text</li>\n<li>Integrate recent conversations more strongly with search, and acknowledge that recent conversations is an alternative message view. It could have a 'filter' representation as I improvised above, possibly represented by a visible toggle (or setting) - or multi-way to include Inbox view? Search filters and recent conversations filters would be made more interoperable where possible, switching between recent conversations and regular message list forms would pre-fill search with existing options by default, <code>stream:foo</code> would give an interleaved view or recent conversations view of <code>#foo</code> depending on the toggle value/setting</li>\n</ul>",
        "id": 1621225,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1691477420
    },
    {
        "content": "<p>I personally strongly prefer the first one, because recent conversations doesn't look like search results to me, so I wouldn't want to be able to get to that view from doing a search.</p>",
        "id": 1621385,
        "sender_full_name": "Evy",
        "timestamp": 1691514377
    },
    {
        "content": "<p>Curious what others think!</p>",
        "id": 1621386,
        "sender_full_name": "Evy",
        "timestamp": 1691514397
    },
    {
        "content": "<p>I think they should remain as two separate entities.</p>",
        "id": 1621395,
        "sender_full_name": "Steve Howell",
        "timestamp": 1691514857
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"21453\">Evy</span> <a href=\"#narrow/stream/101-design/topic/recent.20conversations.20for.20streams/near/1620532\">said</a>:</p>\n<blockquote>\n<p>I personally think search filters should work this way:</p>\n<ul>\n<li>Recent Conversations always has an empty search bar (no filters), both or org-wide and only stream-wide.</li>\n<li>If the search bar is empty and you hit enter, it just closes the search bar and doesn't navigate you to anywhere (currently it navigates me to all messages)</li>\n<li>You can't \"add filters\" (in search) to recent conversations views, because they're not message narrows. You can filter what topics you see with the checkboxes on the page.</li>\n<li>Searching <code>stream:foo</code> shows you the interleaved view for all messages in <code>#foo</code></li>\n</ul>\n</blockquote>\n<p>How do people feel about this plan?</p>",
        "id": 1621493,
        "sender_full_name": "Evy",
        "timestamp": 1691518073
    },
    {
        "content": "<blockquote>\n<p>I agree that hitting enter on an empty search going to a different place is confusing. Perhaps that could go to the default starting narrow (all messages vs recent conversations)? However, that may remove the possibility of a user accessing all messages via the search bar.</p>\n</blockquote>\n<p>I personally feel okay with this because it seems odd to me to have an empty search navigate somewhere, and I think there will be more users accidentally doing empty searches than users who actively want to get to All Messages like that. Potentially we could add some other way to get to All Messages with the keyboard.</p>",
        "id": 1621497,
        "sender_full_name": "Evy",
        "timestamp": 1691518162
    },
    {
        "content": "<blockquote>\n<p>How can I jump to a recent conversations view of #foo, without clicking on a stream when it's configured that way?</p>\n</blockquote>\n<p>Great question -- I don't use the keyboard to navigate enough to have an idea for this one.</p>",
        "id": 1621499,
        "sender_full_name": "Evy",
        "timestamp": 1691518216
    },
    {
        "content": "<p>I'd definitely expect any action on an empty search to be the equivalent of \"Never mind.\" Close it and hold to wherever the user is.</p>",
        "id": 1621501,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1691518333
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"21453\">Evy</span> <a href=\"#narrow/stream/101-design/topic/recent.20conversations.20for.20streams/near/1621499\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>How can I jump to a recent conversations view of #foo, without clicking on a stream when it's configured that way?</p>\n</blockquote>\n<p>Great question -- I don't use the keyboard to navigate enough to have an idea for this one.</p>\n</blockquote>\n<p>As a keyboard-heavy user myself, this leads back to <a href=\"#narrow/stream/101-design/topic/recent.20conversations.20for.20streams/near/1619428\">what I said above</a> about clarifying the functionality offered in a stream-based Recent conversations view that's more than what the left sidebar already offers.</p>",
        "id": 1621512,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1691518814
    },
    {
        "content": "<p>One general thing about keyboard navigation as currently implemented is that it's highly oriented around unread messages. It takes a fair amount of work to get to a specific topic or stream without unreads using just the keyboard.</p>",
        "id": 1621515,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1691518880
    },
    {
        "content": "<p>(Unless of course you're using the recent conversation views AND what you're looking for is there--but that's also prejudiced towards either unreads or until-recently-unreads)</p>",
        "id": 1621516,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1691518924
    },
    {
        "content": "<p>...which is all a long way of saying that I'd want a Recent streams view to be more about finding something from the past, rather than using it as yet another view to read messages I haven't seen yet.</p>",
        "id": 1621519,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1691518976
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"21453\">@Evy</span> I have not found it easily to totally parse the proposal here. But I had been thinking:</p>\n<ul>\n<li>We could have <code>/#recent/stream/{id}</code> parallel to the <code>/#narrow/stream/{id}</code> URLs for \"recent conversations for stream X\"</li>\n<li>I think some filtering, like \"participated\", might be nice to be able to do in \"recent conversations for stream X\", but in practice, anything other than \"unread|muted\" may be awkward to implement for data model reasons, so might be good to defer.</li>\n<li>I think it's definitely simplest to keep the top-of-page search box independent of \"recent conversations\" for now. There's a world where we unify that in the future but it'll likely depend on a lot of data model refactoring that we definitely don't want to block on.</li>\n</ul>",
        "id": 1625172,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692076135
    },
    {
        "content": "<p>Ooooo using those urls would be very helpful to handle navigation to each view, thanks!</p>",
        "id": 1628219,
        "sender_full_name": "Evy",
        "timestamp": 1692504919
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"26369\">Karl Stolley</span> <a href=\"#narrow/stream/101-design/topic/recent.20conversations.20for.20streams/near/1621501\">said</a>:</p>\n<blockquote>\n<p>I'd definitely expect any action on an empty search to be the equivalent of \"Never mind.\" Close it and hold to wherever the user is.</p>\n</blockquote>\n<p><a href=\"https://github.com/zulip/zulip/pull/26534\">#26534</a></p>",
        "id": 1628220,
        "sender_full_name": "Evy",
        "timestamp": 1692504989
    },
    {
        "content": "<p>I just updated <a href=\"https://github.com/zulip/zulip/pull/26409\">#26409</a>:</p>\n<ul>\n<li>Now uses <code>#recent</code> in the url. And <code>/#narrow/</code> still shows the interleaved view (reachable by typing the url or by searching for the stream name). </li>\n<li>The recent topics for streams view has an empty filter (i.e. default search text).</li>\n<li>I also removed the participated checkbox from the recent view -- now only muted and unread are available.</li>\n</ul>\n<p>I'd love if folks could check it out locally and see how it feels!</p>",
        "id": 1628246,
        "sender_full_name": "Evy",
        "timestamp": 1692509801
    },
    {
        "content": "<p>Reposting <a href=\"https://github.com/zulip/zulip/pull/26409#issuecomment-1687244999\">my comment on the UI issues coming from the data challenges for this feature</a> for visibility:</p>\n<blockquote>\n<p>So this view basically has a messy data problem.</p>\n<ul>\n<li>If we don't do a <code>participated</code> column, then we can use the existing <code>stream_topic_history</code> module to populate this view back to the beginning of time in the stream quite easily (that API query is a little slow the first time, but the web app caches data for a given stream for the duration of your session, so it should be fine). That data set doesn't have any participation data and it would likely not be cheap to adjust it to include such data.</li>\n<li>With the \"participated\" column, what we can display is just recent conversations within the window that we display in the main \"recent conversations\" view ... which could be 0 conversations in the event that the stream doesn't have any recent messages. @alya's opinion was that was an unacceptable user experience to do that and have no way to fetch more.</li>\n</ul>\n<p>There might be an option to work around these problems by having the view merge the two data sets, and just have some \"Participation data not available for older conversations\" indication, either as a boundary or in the individual rows, that we design more thoughtfully than I have good ideas for right now.</p>\n<p>But the other option is to figure out the scrolling system mechanics to just fetch more messages when you can see the bottom, and use a <code>MessageListData</code> object effectively for that stream narrow, with its associated <code>FetchStatus</code> object, to store the data. That plan likely involves some chipping away towards <a href=\"https://github.com/zulip/zulip/pull/23812\">#23812</a>, which would be a very good thing to do, but is not going to be quick.</p>\n</blockquote>",
        "id": 1629069,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692664880
    },
    {
        "content": "<p>If folks have ideas for how we might indicate \"we don't have participation data (yet)\", that's going to be a situation we need to deal with the \"inbox\" view as well when the app first loads, if we're including a \"participated\" column there, so it might be worth figuring out some sort of reasonable UI pattern for conveying that situation without making things ugly.</p>\n<p>With the contrast that in \"inbox\", we expect we will definitely have the data by 1-2 minutes after the app loads even if you've got like 50k unread messages, whereas for a stream narrow, we would not necessarily have a mechanism to ever populate older \"participated\" data.</p>",
        "id": 1629071,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692664982
    },
    {
        "content": "<p>Would it be reasonable to move forward with just no participation checkbox there for now?</p>",
        "id": 1629182,
        "sender_full_name": "Evy",
        "timestamp": 1692672510
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"21453\">Evy</span> <a href=\"#narrow/stream/101-design/topic/recent.20conversations.20for.20streams/near/1629182\">said</a>:</p>\n<blockquote>\n<p>Would it be reasonable to move forward with just no participation checkbox there for now?</p>\n</blockquote>\n<p>I know I need to think about this a little more deeply, but my knee-jerk instinct is that participation is a more useful piece of information in the recent conversations view: let me check in on just the stuff I’ve been involved in, wherever in Zulip those conversations might be. By contrast, I would see the recent view for streams as basically a more readily browsable, information-rich version of what’s in the left sidebar (which also lacks any kind of participation data or filtering).</p>",
        "id": 1629336,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1692707991
    },
    {
        "content": "<p>Data point: I definitely use the participation checkbox.</p>",
        "id": 1629341,
        "sender_full_name": "Steve Howell",
        "timestamp": 1692708777
    },
    {
        "content": "<p>I almost exclusively use it, but also part of why I want to create this feature is to remove the interleaved messages view which I think is a lot more confusing then a glorified version of the sidebar</p>",
        "id": 1629444,
        "sender_full_name": "Evy",
        "timestamp": 1692723716
    },
    {
        "content": "<p>Well, you and I are definitely on the same page when it comes to interleaved views.  <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 1629633,
        "sender_full_name": "Steve Howell",
        "timestamp": 1692742388
    },
    {
        "content": "<p>We're definitely not removing the interleaved messages view, the goal is to make it a secondary view, not the main thing you get when clicking a stream. It'll always be available via search if nothing else.</p>",
        "id": 1629698,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692747135
    },
    {
        "content": "<p>Oh sorry -- yes I meant removing it as the default view when clicking on a stream, not removing it from search views.</p>",
        "id": 1629710,
        "sender_full_name": "Evy",
        "timestamp": 1692747523
    },
    {
        "content": "<p>My thought was that replacing \"clicking the stream name results in an interleaved view\" with \"clicking the stream name results in recent conversations with no participated checkbox\" is an improvement, and we could add the participated information as followup work.</p>",
        "id": 1629711,
        "sender_full_name": "Evy",
        "timestamp": 1692747574
    },
    {
        "content": "<p>Yeah, that's the direction I have in mind as well.</p>",
        "id": 1629747,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692750365
    }
]