[
    {
        "content": "<p>I was wondering if we would be interested in modifying the <code>recent_senders</code> logic to \"expire\" senders based on some threshold time period.</p>\n<p>The use case is fairly simple, when I see <a class=\"stream-topic\" data-stream-id=\"8\" href=\"/#narrow/stream/8-commits/topic/zulip.20.2F.20main\">#commits &gt; zulip / main</a> in recent topics, I assume that everything is normal and there hasn't been any human conversation there, however it still shows people names there, even if they had said something months ago... I don't feel like those names are useful.<br>\nIf only the people that had participated in the last eg 90 days were shown, I would (a) know  for certain that there has been no recent human conversation if no names are shown and (b) know for certain that there has been some human conversation if a name is shown. This would also be useful to just normal conversations eg (1) if I revive a topic from 2020 people would know at a glance that there was only one recent sender or eg (2) it might be useful to know that \"admin x has recently chimed in to topic y\"...</p>\n<p>... but then again communicating that clearly to all users will probably not be easy. I also realize that the code is simpler the way it is and the suggested change would add code complexity.</p>",
        "id": 1317740,
        "sender_full_name": "Yash RE",
        "timestamp": 1643380314
    },
    {
        "content": "<p>Ah. And it seems that the current implementation is not exact either, it just depends on \"which messages have been fetched\".</p>\n<p>So, eg on a hard refresh you'd see only me on <a class=\"stream-topic\" data-stream-id=\"9\" href=\"/#narrow/stream/9-issues/topic/emoji.20border\">#issues &gt; emoji border</a> (since I revived the topic).... but if you open the topic, scroll through the past and then go back to recent topics, you'll see several participants.</p>",
        "id": 1317756,
        "sender_full_name": "Yash RE",
        "timestamp": 1643384069
    },
    {
        "content": "<p>Yeah, I think this is something that would be nice to change to a date-based threshold (or perhaps a \"senders of unreads based\").  There's no easy way to change that with how the data fetching is setup, I think; but it's something we can think about in more detail once we've done more work on the internals.</p>",
        "id": 1334484,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1645736991
    }
]