[
    {
        "content": "<p>I'm also test-deploying some experimental work by <span class=\"user-mention\" data-user-email=\"brock@zulipchat.com\" data-user-id=\"136\">@Brock Whittaker</span> on a possible new style for the message recipient bars.  Feedback appreciated!  (Both high-level, on how it compares to what we have now, which may best be in reactions to this message), as well as more nitpicking stuff.</p>",
        "id": 509882,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1519180270
    },
    {
        "content": "<p>(I expect most folks will experience some visual challenge during the first several hours using this, because everyone's brain is wired to detect the old style of recipient bars; so I'm especially interest in feedback on things like how easy content is to detect visually after folks have used this a bit)</p>",
        "id": 509887,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1519180454
    },
    {
        "content": "<p>I like it more than the other one that was experimentally  deployed before</p>",
        "id": 510468,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1519219823
    },
    {
        "content": "<p>I don't like the completely different styling we use for <code>stream</code>.<br>\nOn this very page I am writing I see:</p>\n<ul>\n<li>on the left, purple <code>#</code> and normal colored stream name</li>\n<li>on top, square background in purple, inverted stream name, font is different</li>\n<li>recipient bars &amp; headers - rounded corners, different font, topic is bold</li>\n<li>just above this input - purple border, normal fonts, weird <code>&gt;</code></li>\n</ul>",
        "id": 510485,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1519219990
    },
    {
        "content": "<p>After using it for a bit, I like the direction, though maybe 70% of this direction would be optimal for me.</p>\n<ul>\n<li>The new blue box is too prominent / distracting for me</li>\n<li>I feel less able to skim through a stream; I think the boxing around the previous recipient blocks was important for visually chunking the conversations. I think I'd probably be fine with e.g. a thin line for the recipient bar rather than the full width bar</li>\n</ul>",
        "id": 510782,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1519233156
    },
    {
        "content": "<p>on the plus side I think it is successful on the front of looking much cleaner / more modern, so overall I'd be up for iterating on this a few times</p>",
        "id": 510783,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1519233274
    },
    {
        "content": "<p>Yeah, I think what I'd be interested in trying is:</p>\n<ul>\n<li>Drawing a line across the top of the recipient bar or something (encapsulating the \"Today\" area).</li>\n<li>Removing the background on the new blue box, but maybe keeping the new color?  I think the new color does look nicer.</li>\n<li>Putting the <code>#</code> next to \"design\" in the stream boxes.</li>\n<li>Obviously, we'll need to adjust how the compose area looks to correspond; but I'd like to not get distracted with that for now.</li>\n<li>We can try removing the bold in the recipient bars, though I think that actually does have usability value (the topic is usually the most important thing we want to draw your eyes to)</li>\n</ul>",
        "id": 510807,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1519234490
    },
    {
        "content": "<p>I suggest the pill to be the whole column width. This looks better as a separator and a sticky header:<br>\n<a href=\"/user_uploads/2/b2/qD7ouy48ASObb8fNBQ8UApuf/Screen-Shot-2018-02-21-at-19.44.43.png\" target=\"_blank\" title=\"Screen-Shot-2018-02-21-at-19.44.43.png\">Screen-Shot-2018-02-21-at-19.44.43.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/b2/qD7ouy48ASObb8fNBQ8UApuf/Screen-Shot-2018-02-21-at-19.44.43.png\" target=\"_blank\" title=\"Screen-Shot-2018-02-21-at-19.44.43.png\"><img src=\"/user_uploads/2/b2/qD7ouy48ASObb8fNBQ8UApuf/Screen-Shot-2018-02-21-at-19.44.43.png\"></a></div>",
        "id": 510839,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1519235255
    },
    {
        "content": "<p>My only concern about that is whether the double-colored-line would look wrong.  Easy to check.</p>",
        "id": 510869,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1519235811
    },
    {
        "content": "<p>Possibly adding an accent to the top or bottom of a section with the stream color could help a lot!</p>",
        "id": 510885,
        "sender_full_name": "Brock Whittaker",
        "timestamp": 1519235967
    },
    {
        "content": "<p>BTW, as a separate mini-project, you can investigate using the <code>position: sticky</code>for headers. Supported on most modern browsers and make the sticking better.</p>",
        "id": 510918,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1519236245
    },
    {
        "content": "<p>yeah, if we're going to add two lines, my preference would be to add a line at the bottom of a section</p>",
        "id": 510929,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1519236463
    },
    {
        "content": "<p>We can make it taller too</p>",
        "id": 510943,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1519236794
    },
    {
        "content": "<p>I really like the look of the new recipient bars.</p>",
        "id": 519346,
        "sender_full_name": "Steve Howell",
        "timestamp": 1519758742
    },
    {
        "content": "<p>I am mostly neutral on the pointer but I slightly favor the old blue outline with no shading.</p>",
        "id": 519350,
        "sender_full_name": "Steve Howell",
        "timestamp": 1519758868
    }
]