[
    {
        "content": "<p>Thinknig of ways to make the UX simpler for new users. Would it make sense to remove \"Manage organization\" from the gear menu for non-admins? They can still get to it from the settings modal.</p>",
        "id": 694369,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1549334119
    },
    {
        "content": "<p>(this is also in anticipation of adding a hotspot for \"going to settings\")</p>",
        "id": 694370,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1549334134
    },
    {
        "content": "<p>One nitpick: it actually says \"Organization settings\" for non-admins.  I'm +0.2 on your suggestion.  I like that your suggestion would reduce cognitive clutter for newbies, but occasionally it's nice to tell users that they can go to the gear menu to see how their org is set up.</p>",
        "id": 694371,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549334375
    },
    {
        "content": "<p>oh, interesting. One thing we could do is put \"Organization settings\" in its own section with Statistics.</p>",
        "id": 694372,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1549334475
    },
    {
        "content": "<p>If you want to do that, I'd consider just putting it under the <code>&lt;hr&gt;</code> tag and near \"Help center\".  Since these are all basically info:</p>\n<ul>\n<li>Org settings</li>\n<li>Help center</li>\n<li>Keyboard shortcuts</li>\n<li>Message formatting</li>\n<li>Search operators</li>\n</ul>",
        "id": 694373,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549334589
    },
    {
        "content": "<p>I'd be happy to rename \"Manage organization\" to \"Organization settings\" for admins, so that we can keep our help consistent.  I think this thread is a case in point where presenting different names to admins makes them unaware of what normal users actually see.</p>",
        "id": 694374,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549334725
    },
    {
        "content": "<p>(obviously they would still have different views of the world, so take my point with a grain of salt)</p>",
        "id": 694375,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549334824
    },
    {
        "content": "<p>One thing to note is that \"organization settings\" is available for users to manage user groups, custom emoji, see other users in the organization, etc., so it's not actually something we want to be hiding for normal users.</p>",
        "id": 694380,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1549335840
    },
    {
        "content": "<p>Changing it to consistently say \"Organization settings\" is reasonable.  I think the original reason for keeping the difference was that was the main way to tell you're an administrator before, but now we just display your role in user popovers, \"my account\", etc.</p>",
        "id": 694381,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1549335900
    },
    {
        "content": "<p>\"Organization settings\" should definitely not be mixed up with docs/.help center things.</p>",
        "id": 694382,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1549335942
    },
    {
        "content": "<p>I don't feel too strongly about the wording, especially if the help docs already handle the differences.</p>",
        "id": 694385,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549336309
    },
    {
        "content": "<p>There's possibly also some argument for just having a single \"Settings\" for both admins and normal users, which is how most products handle this. And then on the settings page itself the user can click \"You\" or \"Organization\" to get to your settings or the organization settings. </p>\n<p>Currently we have 4 different things you can click on to get to your settings (desktop gear in lower left, manage streams, settings, and organization settings).</p>",
        "id": 694401,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1549343089
    },
    {
        "content": "<p>I think we used to have a single menu setting for it.  Not sure which way is better.</p>",
        "id": 694402,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549343385
    },
    {
        "content": "<p>I think this is a space where adding extra clicks does make a difference in how annoying something is.</p>",
        "id": 694427,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1549346388
    },
    {
        "content": "<p>So I'm skeptical that making you to \"settings\" and then \"organization\" from there would be an improvement.</p>",
        "id": 694428,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1549346413
    },
    {
        "content": "<p>it's not something you access very often though, right?</p>",
        "id": 694437,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1549346941
    },
    {
        "content": "<p>If you're an administrator, you likely access it a lot more than you do settings.  And browsing organization settings is a nontrivial part of the evaluation experience.</p>",
        "id": 694438,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1549347040
    },
    {
        "content": "<p>I also think on org admin can bear the burden of a non optional UX experience. The idea here should be to make users lives easier first. I feel like admin can handle an extra click.</p>\n<p>That being said, it feels like a bit of organisation smell that a non admin needs “Organization Settings”. I’m not sure what the right solution here is but they shouldn’t need to see that tab at all.</p>",
        "id": 694442,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549347157
    },
    {
        "content": "<p>That way you could keep a menu item for organisation settings but hide the tab and menu item from normal users.</p>",
        "id": 694445,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549347255
    },
    {
        "content": "<p>I’m not sure where those 4 categories of things Tim mentioned would go.</p>",
        "id": 694446,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549347274
    },
    {
        "content": "<p>I agree browsing org settings is a part of the evaluation experience, but it's also something that I would expect to be under \"settings\" from other products. E.g. just checked both Front and GitHub; there's one menu item called \"Settings\", which takes you to a page where you can easily click on whether you're doing personal settings or organization settings.</p>",
        "id": 694447,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1549347293
    },
    {
        "content": "<p>Well, except that 1/3 or more of the \"organization\" panel of settings is functionality normal users can interact with.</p>",
        "id": 694448,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1549347306
    },
    {
        "content": "<p>Perhaps that’s the root problem here</p>",
        "id": 694450,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549347339
    },
    {
        "content": "<p>No, that's not a problem -- \"User groups\", \"Custom emoji\", etc. are organization-level settings that you want normal users to be able to interact with.</p>",
        "id": 694455,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1549347464
    },
    {
        "content": "<p>It’s really not a problem that we expose organization settings to users.  We can reorganize the gear menu to reduce clicks or highlight more important features.</p>",
        "id": 694456,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549347468
    },
    {
        "content": "<p>I’m not clear on why a non admin user can edit a user group ( or actually even what a user group is )</p>",
        "id": 694457,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549347550
    },
    {
        "content": "<p>Ahh okay I see like mobile etc. I always figured that was all members of the mobile stream... hmmm interesting</p>",
        "id": 694459,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549347723
    },
    {
        "content": "<p>Yeah the user group concept is distinct from stream membership.</p>",
        "id": 694479,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549348240
    },
    {
        "content": "<p>Although obviously conceptually similar</p>",
        "id": 694482,
        "sender_full_name": "Steve Howell",
        "timestamp": 1549348294
    },
    {
        "content": "<p>After giving it a bit of thought, in my opinion the organisation settings should be hidden from users. A new view calling “manage” should be created that consists of streams, groups, and emoji so for a normal user the menu options would have settings and manage options. I’m not too happy with the word manage but structurally to me it makes more sense.</p>\n<p>I apologise if my input on this thread has been premature or not thought out.</p>",
        "id": 694493,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549349617
    },
    {
        "content": "<p>As for letting users see who’s on the realm I believe this is what the buddy list should achieve. I think all the menu items under the help subsection (shortcuts, formatting, operators), as well as information like available bots and other information users currently discover in the organization settings section should be available under a section called help and documentation.</p>",
        "id": 694496,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1549349770
    }
]