[
    {
        "content": "<p>So any proposals instead of <code>common topic</code>?  </p>\n<ul>\n<li>general topic</li>\n<li>empty topic</li>\n<li>open topic</li>\n</ul>",
        "id": 1484234,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1672726208
    },
    {
        "content": "<p>anything topic?</p>",
        "id": 1484235,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1672726546
    },
    {
        "content": "<p>\"General topic\" seems OK to me...</p>",
        "id": 1484809,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1672788749
    },
    {
        "content": "<p>3 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box\">#design &gt; UI redesign: compose box</a> by <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span>.</p>",
        "id": 1486179,
        "sender_full_name": "Notification Bot",
        "timestamp": 1672969859
    },
    {
        "content": "<p>Prior discussion re: default topic name is interspersed <a href=\"#narrow/stream/137-feedback/topic/Help.20Choosing.20Topic/near/1429013\">here</a>.</p>",
        "id": 1486183,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1672970084
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"22433\">@Vlad Korobov</span> I guess our plan for the placeholder text (in <a href=\"https://github.com/zulip/zulip/pull/23294\">#23294</a>) for orgs that allow no-topic messages had been:</p>\n<blockquote>\n<p>Enter topic or send to \"general chat\"</p>\n</blockquote>",
        "id": 1486184,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1672970131
    },
    {
        "content": "<p>It's not recorded in the issue, but we could make it just \"Enter topic\" (instead of the current \"Topic\") for orgs that do not allow no-topic messages.</p>",
        "id": 1486185,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1672970228
    },
    {
        "content": "<p>Thanks for tracking that down!</p>",
        "id": 1486200,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672971300
    },
    {
        "content": "<p>My perspective is there's no reason to have the word \"topic\" in the \"general chat\" topic, and there are downsides to it being there. I guess my main concern is that we want this to serve as an example of a good topic name, ideally, and good topics generally don't have the word \"topic\" placed at the end of them.</p>",
        "id": 1486204,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672971507
    },
    {
        "content": "<p>We should also think about considerations around users wanting to refer to this feature. For example, \"Please don't send cat pictures to the general chat\" is a thing someone might want to feel normal saying. \"Please don't send cat pictures to the empty topic\" might feel a bit weird. </p>\n<p>The status quo of \"Please don't send cat pictures to (no topic)\" is pretty bad on that front <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>. That choice was motivated by the idea that we want to push people to actually use topics, and so there's some benefit to having one feel like you're it wrong if you send things there.</p>",
        "id": 1486205,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672971607
    },
    {
        "content": "<p>But I think the main consideration is what do we want to hint to users that they should use this topic for?</p>",
        "id": 1486206,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672971651
    },
    {
        "content": "<p>On that test, something like \"empty topic\" or \"open topic\" feels wrong -- that doesn't tell you what sort of stuff belongs there.</p>",
        "id": 1486207,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672971711
    },
    {
        "content": "<p>I think my preferred option is \"general chat\". I don't think it's perfect -- what do you send to the \"general chat\"? But maybe that's fine given the concept is that if you want to talk about something in particular, you should probably put it in a topic... But if you just want to chat, that's the place to chat.</p>\n<p>And the fact that our default stream is called \"general\" means that you'll have <a class=\"stream-topic\" data-stream-id=\"2\" href=\"/#narrow/stream/2-general/topic/general.20chat\">#general &gt; general chat</a>, which looks a little stupid.</p>",
        "id": 1486211,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672971957
    },
    {
        "content": "<p>Another direction would be to call it something like \"chat\" or \"chatroom\" or \"disorganized chat\" <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span> or \"random\" or something else that conveys the idea of \"I'm just having a conversation, not trying to discuss anything in particular\".</p>",
        "id": 1486212,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672972030
    },
    {
        "content": "<p>But I don't think something like \"miscellaneous\" would be a good choice -- ideally, if you've got something to post that's sort its own side thing, we should be hinting you to put it in its own (likely short-lived!) topic.</p>",
        "id": 1486213,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672972078
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/Renaming.20.28no.20topic.29/near/1486185\">said</a>:</p>\n<blockquote>\n<p>It's not recorded in the issue, but we could make it just \"Enter topic\" (instead of the current \"Topic\") for orgs that do not allow no-topic messages.</p>\n</blockquote>\n<p>Oh, and yeah, I think \"Enter topic\" is pretty good for a placeholder; that nicely fits both the primary case for this input of \"Enter a new topic\" along with \"We're going to help you input an existing topic that might happen to already exist\".</p>",
        "id": 1486224,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672972880
    },
    {
        "content": "<blockquote>\n<p>I guess my main concern is that we want this to serve as an example of a good topic name, ideally, and good topics generally don't have the word \"topic\" placed at the end of them.</p>\n</blockquote>\n<p>Yeah, I think that's a good argument against \"X topic\" as the default topic name.</p>",
        "id": 1486278,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1672990361
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"25626\">Ngô Quang Đức</span> has marked this topic as resolved.</p>",
        "id": 1486300,
        "sender_full_name": "Notification Bot",
        "timestamp": 1672998631
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"21836\">Lauryn Menard</span> has marked this topic as unresolved.</p>",
        "id": 1486308,
        "sender_full_name": "Notification Bot",
        "timestamp": 1672999138
    },
    {
        "content": "<p>I strongly disagree on this point with Tim.</p>\n<blockquote>\n<p>no reason to have the word \"topic\"</p>\n</blockquote>\n<p>Yes there is. You wanted to have no text label near that field in the UI like this: <a href=\"/user_uploads/2/ce/htxfcvfkg7sAcjSiVJle6COM/image.png\">image.png</a> So there is got to be explicit label of that input field. And it must include the ultimate identifier of what this thing is, which is <code>topic</code></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/ce/htxfcvfkg7sAcjSiVJle6COM/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/ce/htxfcvfkg7sAcjSiVJle6COM/image.png\"></a></div><blockquote>\n<p>we want this to serve as an example of a good topic name</p>\n</blockquote>\n<p>No we don't. Placeholder, input label and example at the same time is a bad mix. We could do a better job of giving example in a multiline tooltip and an article about that matter. So let please pick 2 goals for that placeholder instead of having 3.</p>\n<blockquote>\n<p>\"Please don't send cat pictures to the general chat\"</p>\n</blockquote>\n<p>And now I'm thinking that you are talking about general stream/channel. The word <code>chat</code> is bad because there is nothing which identifies like this in the UI: stream, conversation, message. To avoid confusion some should talk like \"Please don't send cat pictures to the general chat <strong>topic</strong>\"</p>\n<blockquote>\n<p>\"miscellaneous\" would be a good choice</p>\n</blockquote>\n<p>Yes but it is a long name which hard to spell</p>\n<blockquote>\n<p>\"Enter topic\" (instead of the current \"Topic\") for orgs that do not allow no-topic messages.</p>\n</blockquote>\n<p>If possible I would avoid this case. It is a UX issue. Some admin it guys would remove that setting thinking \"sure everything must have a topic\" but many people will hate Zulip for that, not the admin.<br>\nI agree that it could be an extra warning like \"Your admin recommends you to write to a particular topic instead of a general topic\". </p>\n<p>We don't loose a message if it is in a wrong topic + moving feature can fix the problem, which is a good opportunity to learn a nice Zulip feature.</p>",
        "id": 1486393,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1673015153
    },
    {
        "content": "<p>so I don't like the word <strong>chat</strong> because it misidentifies the topic in the UI. If we have text label <code>Topic:</code> for the input field I'm ok with the <strong>chat</strong>  word. I really don't like the word <strong>general</strong> without topic at the end because there is a legacy of general as a stream/channel (Microsoft teams defaults to it to, so every team has General channel).</p>\n<p>Alya doesn't like the <strong>open</strong> or <strong>common</strong> but I don't understand why.<br>\nOpen means that this topic couldn't be resolved and anybody can write into it.<br>\nCommon is overall topic fo that stream, since you can't write directly into the stream.</p>",
        "id": 1486398,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1673015966
    },
    {
        "content": "<p>I'd love to see comments from a broader set of folks on this one.</p>",
        "id": 1486497,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673028879
    },
    {
        "content": "<p>We could go in a more light-hearted direction, with synonyms for \"mix of stuff\" like:</p>\n<ul>\n<li>hodgepodge</li>\n<li>potpourri</li>\n<li>medley</li>\n</ul>\n<p>Probably less good for non-native English speakers, but I figured I'd throw some more variety of ideas out there.</p>",
        "id": 1486568,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673035148
    },
    {
        "content": "<p>Or  in the \"talking about random stuff\" direction:</p>\n<ul>\n<li>chitchat</li>\n<li>buzz</li>\n</ul>",
        "id": 1486570,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673035422
    },
    {
        "content": "<p>I feel like this is definitely a bit of a puzzle; there's just a lot of constraints around this name.</p>",
        "id": 1486580,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1673036430
    },
    {
        "content": "<p>I agree that the topic name should be a good exemplar topic name, which means not having \"topic\" embedded into it.  Maybe \"general conversation\"?</p>",
        "id": 1486630,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1673040110
    },
    {
        "content": "<p>The \"mix of stuff\" synonyms would require careful work to localize, not just translate.</p>",
        "id": 1486634,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1673040197
    },
    {
        "content": "<p>I like the \"talking about random stuff\" options <span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> proposed: maybe \"chatter\"? Google Translate (via <a href=\"https://translate.namazso.eu\">https://translate.namazso.eu</a>) seems to indicate that there are many synonyms for that in at least German, French, and Czech (Japanese too, but perhaps less perfectly to my untrained eye: you can pick between \"rumor\" or \"useless words\" as your underlying meaning it seems?)</p>",
        "id": 1486659,
        "sender_full_name": "Josh Klar",
        "timestamp": 1673041645
    },
    {
        "content": "<p>I like \"uncategorized conversation\" as a vibe, though definitely not that wording</p>",
        "id": 1486745,
        "sender_full_name": "Evy",
        "timestamp": 1673048301
    },
    {
        "content": "<p>I like \"chatter\".</p>",
        "id": 1486747,
        "sender_full_name": "Evy",
        "timestamp": 1673048310
    },
    {
        "content": "<p>well if there is a strong desire to not have topic in the name of the topic... we should have a label indicating that input field <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span><br>\nI'm ok with <strong>chatter</strong> in this case, but it is hard to translate properly. For example for Russian it is Google Translate doesn't suggest a good version: <a href=\"/user_uploads/2/ff/AGGVqFrbIAAKEZBQZ7g7x604/image.png\">image.png</a> <br>\n<em>болтовня</em> has a negative tone, closer to twaddle... I guess the good translation to Russian would be разговор</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/ff/AGGVqFrbIAAKEZBQZ7g7x604/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/ff/AGGVqFrbIAAKEZBQZ7g7x604/image.png\"></a></div><p>But I'm not sure that such topic would be autotranslated to the organization language. In this case to just name it 'chat' would be more appropriate. So Stream + topic would read like <strong>Design</strong> <strong><em>chat</em></strong>, and in General stream it will be <strong>General</strong> <strong><em>chat</em></strong></p>",
        "id": 1486828,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1673052721
    },
    {
        "content": "<p>I'm of course still learning my way about the \"company/product voice\" as it were, but do we have an expectation that all strings map exactly 1:1, or is there precedent for colloquialisms that may translate imperfectly? I could imagine using <code>chatter</code> which has a more playful tone in English, and leaving a note for translators that if such an informal/playful connotation doesn't exist in their language, <code>chat</code> is a neutral replacement, to give us the best of both worlds.</p>",
        "id": 1486838,
        "sender_full_name": "Josh Klar",
        "timestamp": 1673052962
    },
    {
        "content": "<p>(that's not to say there's not potentially other words that fit better than <code>chatter</code> of course <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> kinda using this as a learning opportunity personally while also proposing an idea)</p>",
        "id": 1486839,
        "sender_full_name": "Josh Klar",
        "timestamp": 1673052994
    },
    {
        "content": "<p><em>shrugs</em> The most active community translators take the lead on translation style, including putting together the <a href=\"https://zulip.readthedocs.io/en/latest/translating/index.html\">style guide</a> for their language.</p>",
        "id": 1486876,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673055188
    },
    {
        "content": "<p>I'm not aware of a way to leave a note for translators, though.</p>",
        "id": 1486877,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673055281
    },
    {
        "content": "<p>I learned today by doing so for a Romanian translation that looked funky that in transifex one can leave comments on a string, they are tagged with the target language if the comment originates from a translator's view (and so I think, while automation may require thought, it's plausible to leave interpretation comments for translators). Some of the Transifex alternatives I've looked at include support for annotating context with screenshots and comments and such too, if we're ever in such a world.</p>",
        "id": 1486897,
        "sender_full_name": "Josh Klar",
        "timestamp": 1673056566
    },
    {
        "content": "<p>Anyway, I digress, sorry to derail slightly there :)</p>",
        "id": 1486898,
        "sender_full_name": "Josh Klar",
        "timestamp": 1673056624
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/Renaming.20.28no.20topic.29/near/1486877\">said</a>:</p>\n<blockquote>\n<p>I'm not aware of a way to leave a note for translators, though.</p>\n</blockquote>\n<p>(I've just opened a <a href=\"#narrow/stream/58-translation/topic/devs.20leaving.20notes.20for.20translators/near/1486901\">discussion</a> in the translation stream for this interesting idea.)</p>",
        "id": 1486903,
        "sender_full_name": "Chris Bobbe",
        "timestamp": 1673057531
    },
    {
        "content": "<p>I too like \"chatter\" but it's hindi translation by Google is <em>really</em> negative - बकवास, which essentially means \"rubbish\"</p>",
        "id": 1487885,
        "sender_full_name": "Nehal Sharma",
        "timestamp": 1673251425
    },
    {
        "content": "<p>What about just \"default\" as the default topic name? It most closely describes what it is. I think any other names may seem to a new user like a topic created by someone else and not the default topic. In a way, it's a lot like the current (no-topic) but pretty neutral</p>",
        "id": 1487886,
        "sender_full_name": "Nehal Sharma",
        "timestamp": 1673251528
    },
    {
        "content": "<p>And I <em>think</em> we would want to distinguish between user created topics and the default one</p>",
        "id": 1487887,
        "sender_full_name": "Nehal Sharma",
        "timestamp": 1673251566
    },
    {
        "content": "<p>related to <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box\">#design &gt; UI redesign: compose box</a>  I have 2 concepts:</p>\n<ol>\n<li>\n<p>We have placeholder which is not using the word <code>Topic</code> and we don't have input field label which indicates that. We hope to teach person and provide experience which helps to get used to that. We can have tooltip on the input field which says <code>Topic</code>.<br>\nThe name of such placeholder is also a localizable name of the common stream topic. For now Alya and Tim feel like <code>general chat</code> is a good word for that in English. That might change in future and it might change for some languages. It is ok because implementation will allow to have that <code> </code> - empty string topic be replaced with such placeholder name everywhere, including topic mentions. <br>\nGeneral chat is in <em>italic</em> to highlight that this is a special topic and kind of not recommended to write too <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span><br>\n<a href=\"/user_uploads/2/41/pU3wZzhbognMpB8kxGeVOBsd/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/41/pU3wZzhbognMpB8kxGeVOBsd/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/41/pU3wZzhbognMpB8kxGeVOBsd/image.png\"></a></div></li>\n<li>\n<p>We have a very traditional and straightforward input field placeholder 'Topic'. And the name of such empty topic is <code>off-topic</code>:<br>\n<a href=\"/user_uploads/2/61/hFFsS5lY_4Gh6cLZ0WlEw6SH/image.png\">image.png</a><br>\nIt might not sound great but it is logical. I hope that in every language there is a way to say <em>outside any topic</em></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/61/hFFsS5lY_4Gh6cLZ0WlEw6SH/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/61/hFFsS5lY_4Gh6cLZ0WlEw6SH/image.png\"></a></div></li>\n</ol>",
        "id": 1490818,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1673752062
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> and <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> please let me know what do you think about this. It is not changing much what I'm going to do with css/html prototype</p>",
        "id": 1490819,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1673752142
    },
    {
        "content": "<p>I think \"off-topic\" will be confusing, because streams can be considered \"topics of conversation\" and \"off-topic\" could mean not relating to that stream.</p>",
        "id": 1490932,
        "sender_full_name": "Evy",
        "timestamp": 1673813514
    },
    {
        "content": "<p>I like the italics! I also like \"General chat\". I could also see people having conversation there by default and moving conversations into topics when they get longer or when two conversations are happening at the same time (I don't know if this is good or bad.. probably bad?)</p>",
        "id": 1490933,
        "sender_full_name": "Evy",
        "timestamp": 1673813586
    },
    {
        "content": "<p>interesting point... so <code>off-topic</code> sound negative and <code>general chat</code> is just ok - I like that perspective</p>",
        "id": 1490934,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1673815094
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"21453\">Evy</span> <a href=\"#narrow/stream/101-design/topic/Renaming.20.28no.20topic.29/near/1490933\">said</a>:</p>\n<blockquote>\n<p>[...] I could also see people having conversation there by default and moving conversations into topics when they get longer or when two conversations are happening at the same time (I don't know if this is good or bad.. probably bad?)</p>\n</blockquote>\n<p>I may be misunderstanding, but this sounds like something similar I was concerned with in the discussion in <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/translating.20blank.20topic.20name\">#design &gt; translating blank topic name</a>, which related to this topic. There I raised someone eg. 'correcting' the <code>general chat</code> name into something more language-specific, and potentially unintentionally dragging messages from <code>(no topic)</code>. Is that along the lines of the 'bad' you were thinking of <span class=\"user-mention silent\" data-user-id=\"21453\">Evy</span>? Or was that not the 'moving' you were referring to? (moving messages vs new topic?)</p>",
        "id": 1490994,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1673822008
    },
    {
        "content": "<p>Thoughts regarding the <code>(no topic)</code> issue, which could affect both design and product direction (with options for backward compatibility?):</p>\n<ul>\n<li>don't allow topic edits (ie. movement) of messages in this topic? That'd be very strict, but coupled with something like a <code>/digress</code> it could add a reference back to an unchangeable 'root' message, in this topic. Renaming of the entire topic could actually be supported there, but be a user preference overriding the server/language defaults, and references would point back to the same topic anyhow.</li>\n<li>don't allow topic-renaming/moving all/many messages from the topic? Perhaps this is mitigated by any recent changes to the message movement backend - I've not kept up on that. Even so, this topic may be very busy so in a short time a lot of messages may fall within a time-based move-window, so I'm not entirely convinced by this solution.</li>\n</ul>",
        "id": 1490995,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1673822307
    },
    {
        "content": "<p>I don't understand why we should not allow to move anything to or from this no topic topic. <br>\nI think we do want to prevent it from ever been mark as resolved</p>",
        "id": 1490997,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1673822557
    },
    {
        "content": "<p>See <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/Beyond.20.28no.20topic.29.3F\">#design &gt; Beyond (no topic)?</a> for background, after thinking this through further.</p>",
        "id": 1491034,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1673832687
    },
    {
        "content": "<p>Limiting resolving that topic is definitely an element of this - currently it is tied to permission to edit the topic, which is available for most (all?) users, unless something has changed.</p>",
        "id": 1491035,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1673832813
    },
    {
        "content": "<p>We should absolutely allow messages to be moved out of <em>general chat</em>. That's a great way to improve the organization in the steam, as <span class=\"user-mention silent\" data-user-id=\"21453\">Evy</span>  noted.</p>",
        "id": 1491294,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673927842
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2406\">Neil Pilgrim (neiljp)</span> <a href=\"#narrow/stream/101-design/topic/Renaming.20.28no.20topic.29/near/1491035\">said</a>:</p>\n<blockquote>\n<p>Limiting resolving that topic is definitely an element of this - currently it is tied to permission to edit the topic, which is available for most (all?) users, unless something has changed.</p>\n</blockquote>\n<p>It's currently tied to permission to edit the topic, which is customizable by the organization. However, we plan to separate out the resolving topic permissions in <a href=\"https://github.com/zulip/zulip/pull/21811\">#21811</a> .</p>\n<p>Prohibiting resolving <em>general chat</em> as a special case (regardless of other permissions) makes sense to me in any case.</p>",
        "id": 1491296,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673928000
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2406\">Neil Pilgrim (neiljp)</span> <a href=\"#narrow/stream/101-design/topic/Renaming.20.28no.20topic.29/near/1491035\">said</a>:</p>\n<blockquote>\n<p>Limiting resolving that topic is definitely an element of this - currently it is tied to permission to edit the topic, which is available for most (all?) users, unless something has changed.</p>\n</blockquote>\n<p>Exactly yes, so we shouldn't let them rename it either.</p>",
        "id": 1491605,
        "sender_full_name": "Evy",
        "timestamp": 1673991006
    },
    {
        "content": "<p>I definitely agree with the general potential to improve organization in a stream by moving messages - it's one reason I enjoy using Zulip.</p>\n<p>However, if topic edits are permitted, ie. messages can be moved, then surely depending on the activity in the topic and the edit time window, one opens up the possibility of all messages being moved, which can also translate to renaming of <code>(no topic)</code> (or equivalent) in this case.</p>\n<p>However, this is <a class=\"stream\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design\">#design</a> so am I missing something? Are we fine with moving all messages out of the topic being considered differently from renaming the topic in the UI, even if it's the same in the API?</p>",
        "id": 1491658,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1673994051
    },
    {
        "content": "<p>The difference is that the general purpose topic would continue to exist in messages could be sent there. We would never allow an actual rename on the back end</p>",
        "id": 1491688,
        "sender_full_name": "Evy",
        "timestamp": 1673995651
    },
    {
        "content": "<p>Just caught up on this discussion; I'm definitely feeling good about this direction.</p>",
        "id": 1492585,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1674087326
    },
    {
        "content": "<p>Mechanically in our internals, marking the \"General chat\" topic as resolved would be equivalent to moving the messages to the \"[checkmark] \" topic. I'm not sure what the best answer is for how to handle the case that someone tries to move a topic to that name, but it's possible that's already a string in the \"topic name\" space that can't contain, because we strip trailing whitespace from topics.</p>",
        "id": 1492586,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1674087418
    },
    {
        "content": "<p>I think that observation supports the UI approach of just not offering \"resolve topic\" UI for this special topic, and we end up not having to think about how to display such a special topic.</p>",
        "id": 1492588,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1674087498
    },
    {
        "content": "<p>Some feedback that came up in the KMK Firmware Zulip yesterday about this issue (in the context of one of the project maintainers asking for brainstorm input on how to split up streams in that org), how timely!</p>\n<p>@_<strong>regicidal plutophage|571707</strong> <a href=\"https://kmkfw.zulipchat.com/#narrow/stream/358347-general/topic/Organizing.20zulip.20streams/near/322153051\">said</a>:</p>\n<blockquote>\n<p>I think the double edged sword of thread system of zulip is that it encourages certain deliberacy which can discourage some folks from creating a thread.<br>\nPerhaps there should be an explicitly low-commitment stream that would serve as a place for threads along the lines of \"I am totally lost please send help\"<br>\nThen the resolution would come in form of an answer of how to better formulate a question and where to post it.<br>\nI don't think this stream should be moderated the same as the other streams with topics being marked as resolved, moved to the other streams, etc.<br>\nIt could also serve as a place for vaguely on-topic discussions, sharing projects, etc.</p>\n</blockquote>",
        "id": 1493131,
        "sender_full_name": "Josh Klar",
        "timestamp": 1674155857
    },
    {
        "content": "<p>Interesting, thanks for sharing!</p>",
        "id": 1493136,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674155970
    },
    {
        "content": "<p>Just to check, this feature or the internationalization aspect of it, have neither been merged?</p>",
        "id": 1528090,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1679276625
    },
    {
        "content": "<p>Correct. It's sufficiently tricky that we haven't had bandwidth to actually work on it yet.</p>",
        "id": 1528402,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1679329656
    },
    {
        "content": "<p>It seems like this might involve a lot of steps, which haven't been discussed in depth, so I'm going to try to write out at least some of them here:</p>\n<ul>\n<li>Switch from storing \"(no topic)\" in the backend to storing an empty string, and migrate existing messages to empty string. Have the frontend treat empty string as a place to display \"(no topic)\", translated</li>\n<li>Change the string that we display in the frontend from \"(no topic)\" to \"general chat\" (also a translated string)</li>\n<li>Probably also ban any messages from being stored on the backend with topics \"(no topic)\" or \"general chat\" since I think that would get confusing. We could just automatically convert those to empty string</li>\n<li>Prevent empty string topics from being resolved</li>\n<li>Still allow messages to be moved out of the general topic</li>\n<li>Probably still allow messages to be moved into the general topic? But I like the idea of adding a layer where, if the box is empty, confirm with the user that they want to send the message to the general topic.</li>\n</ul>\n<p>Thoughts?</p>",
        "id": 1603217,
        "sender_full_name": "Evy",
        "timestamp": 1688425466
    },
    {
        "content": "<p>Good question.</p>\n<p>It looks like this thread forked somewhat back in January, to here:<br>\n<a href=\"#narrow/stream/101-design/topic/translating.20blank.20topic.20name/near/1489618\">https://chat.zulip.org/#narrow/stream/101-design/topic/translating.20blank.20topic.20name/near/1489618</a><br>\nand there's further discussion on that thread.</p>\n<p>There were some open questions there about the UX, and proposals for them but the discussion petered out without a conclusion.</p>",
        "id": 1603270,
        "sender_full_name": "Greg Price",
        "timestamp": 1688429847
    },
    {
        "content": "<p>We'll need to work out on <a class=\"stream\" data-stream-id=\"378\" href=\"/#narrow/stream/378-api-design\">#api design</a> exactly how this should be represented in the API, in order to keep some kind of reasonable UX for existing clients. I don't think that conversation has been started; I think it was waiting for the UX design discussions to conclude.</p>",
        "id": 1603271,
        "sender_full_name": "Greg Price",
        "timestamp": 1688429977
    },
    {
        "content": "<p>Ah great thanks!</p>",
        "id": 1603310,
        "sender_full_name": "Evy",
        "timestamp": 1688435818
    }
]