[
    {
        "content": "<p>I drafted the following while <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/Convert.20replies.20between.20stream.20and.20private.20messages\">#design &gt; Convert replies between stream and private messages</a>  was deployed, so please refer to that for details. I'm posting it here separately due to the size and since it results in other directions to take.</p>\n<hr>\n<h1>An opportunity for stream&lt;-&gt;PM switching?</h1>\n<p>Some day recently I could have used stream/PM compose switching: I was in a (interleaved) search narrow and started writing a reply, and realized half way through that I wanted it to be to a group PM (from the search narrow) instead of to a stream (that was selected when I pressed <code>r</code>).</p>\n<p>I can partially blame that I instead used copy-paste and a <code>r</code> on the right recipients on my keyboard muscle memory, and perhaps lack of knowledge of if there was a hotkey for the new PM/stream switching.</p>\n<p>In this case the PM conversation was in the narrow, so I could have toggled my compose to PM and used names in the narrow as a prompt to type in. However, even if I was a new user not used to simply using copy and paste and was aware of the new button, I'm not sure that it would have necessarily been quicker after I typed in all the recipients in this case, even with autocomplete. Further, if I couldn't remember where I wanted to send it (without the prompt in the narrow, or otherwise) I'd have to browse/search narrows (or users) until I found it, then resume the draft and type in the recipients.</p>\n<p>Another factor to consider is that other than avoiding typing in the recipients, using <code>r</code> to reply from a message (here with copy+paste) means the recipient information is definitely correct - assuming starting from the correct starting message - so as a user I am reassured that it will reliably go to the right place and audience! I'm calling that \"reply feels safe\" behavior. That's relevant to streams to some degree, more so if using many private streams (risking exposure to the wrong audience), or being unable to edit/move messages afterwards - otherwise generally visibility is similar (discounting modifiable subscriptions or changing stream visibility). One might post to the wrong stream, but it's more likely to be fixable and less critical; quite the opposite for PMs! In large orgs it can be easy to mistype someone's name, even with autocomplete. Either way I think it's a useful assurance/shortcut - we use <code>r</code> more frequently than <code>c</code>/<code>x</code> for a reason :)</p>\n<h1>Possible user experiences from stream&lt;-&gt;topic switching alone?</h1>\n<p>Bearing the above in mind, current impressions the toggle feels like it could give to users:</p>\n<ul>\n<li>on initial toggle it's like using <code>c</code> or <code>x</code>, but with existing message content<ul>\n<li>neat! now I don't need to copy/paste if I want to switch recipients!</li>\n</ul>\n</li>\n<li>OK, I've an empty box... now where did I want to send this instead?<ul>\n<li>I remember: it's that user/stream-topic, let me just autocomplete that<ul>\n<li><strong>confident</strong> - that seems right (maybe confirms with <code>CTRL</code>+<code>.</code> to look at existing conversation for context) </li>\n<li><strong>unsure</strong> were those recipients right?  let me just copy/paste content instead and reply once I find the conversation</li>\n</ul>\n</li>\n<li>it's a new user/topic who said something like...? it's that group PM with who in it? it's that topic...in some stream?<ul>\n<li>let me copy/paste that content and find the conversation to reply to it</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>maybe later: let me just copy/paste and reply to this other conversation, instead of needing to autocomplete after switching</li>\n</ul>\n<p>Ideally users are confident, and then there's no problem :)</p>\n<p>Otherwise users may end up using drafts intentionally (or accidentally) once they've gone off looking to confirm the right conversation. Maybe it was right. Otherwise, once they find it they either need to resume the draft and manually copy the recipient information from the narrow, or copy/paste the content into a new reply.</p>\n<h1>Achieving 'reply feels safe' behavior</h1>\n<p>I would emphasize that the stream/PM toggle already feels beneficial if one wants to redirect the content to a \"new\" conversation, with recipients that you can mostly remember, or can interrogate through existing autocomplete <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>\n<p>However, I assert that we won't get a clear flow which removes the need to copy/paste unless the 'reply feels safe' behavior is possible as part of the UI.</p>\n<p>There are various ways we might achieve this, which to my mind boil down to connecting saved written text (ie. drafts) to new recipients (effectively integrated copy-paste), or better supporting recipient-finding while mid-compose so that leaving compose isn't necessary:</p>\n<ul>\n<li>Support resuming content in a draft, but as a reply to the current narrow/message (from general drafts)<ul>\n<li>easier with current interface, but easier to lose context of narrow/message and drafts?</li>\n</ul>\n</li>\n<li>The above, but have a slightly different drafts popup which is triggered within compose (so you can have compose open and recipient already set)<ul>\n<li>maybe confusing to have different drafts menu interfaces/variants?</li>\n</ul>\n</li>\n<li>Some way to select 'quick access' PMs/topics while in compose (which would replace those in the active compose recipient area)<ul>\n<li>'quick access' could be ordered preferentially to include conversations visible/in the current narrow, recently-sent-to conversations (topics/PMs); in principle later extended to other manually preferred conversations?</li>\n<li>simply put, this would be like a simplified combined recipients picker/dropdown, which could have combined autocomplete, eg. &lt;list of users in group PM&gt;, &lt;stream1+topic2&gt;, ...</li>\n</ul>\n</li>\n</ul>\n<p>Thoughts?</p>",
        "id": 1433204,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1662764230
    },
    {
        "content": "<p>My thoughts:<br>\nThere is got to be a way to forward any message to any PM, I was surprised that PM switch allowed that as a side effect.<br>\nI'm ok to not have PM Stream switch, but with that I would like to not have New PM button under any stream feed. <br>\nThe main idea is if we want to have ability to start PM or Stream in the same place we should allow to switch. If we don't allow to switch let's don't confuse person and force them to jump to PM view initially.</p>",
        "id": 1433320,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1662768962
    }
]