[
    {
        "content": "<p>I've had quite a few cases using the windows client where replies in all messages have gone to the wrong conversation, and wondered why I've been making an error. Selecting a message fades messages outside of that conversation, and clicking outside of the chat area resets the fading but still keeps a conversation selected. At that point, hitting reply after seeing a message come in could easily go to the wrong conversation without taking steps to ensure you have the correct conversation as the visual cue for which conversation is active is gone.</p>\n<p>This could be avoided if message selection is cleared along with the fading being reset when clicking outside of the conversation area, and replying either auto selected the most recent conversation (which would be the most useful behaviour but perhaps should be an option), or the user clicked a message (presumably the most recent) to again select the conversation.</p>",
        "id": 1018993,
        "sender_full_name": "Nick Lindridge",
        "timestamp": 1600354516
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"17281\">@Nick Lindridge</span> I think it's somewhat unlikely that we're going to change this behavior, since it's pretty ingrained in our app to always have a message selection and to assume that if you hit enter/r to reply, our best guess is to choose the message you selected.</p>\n<p>Just to clarify one thing, when you say \"hitting reply\", you mean that you're using the keyboard, correct?</p>",
        "id": 1018996,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600355415
    },
    {
        "content": "<p>Some possible workarounds to consider:</p>\n<ul>\n<li>Avoid \"All Messages\" to some degree by using the \"n\" key to navigate to unread messages or \"t\" for recent topics</li>\n<li>Get used to hitting the End key when you've determined you're done reading an upscreen message.</li>\n</ul>",
        "id": 1018997,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600355591
    },
    {
        "content": "<p>even my users often get the conversation wrong</p>",
        "id": 1018998,
        "sender_full_name": "Andrea Soc",
        "timestamp": 1600355715
    },
    {
        "content": "<p>hi steve, yes <code>r</code> or <code>enter</code>. An option to auto-move the selection to the most recent reply, perhaps only if there is no filtering/topic focus in play (not sure what you call the concept in Zulip), might be an alternative. As replying applies focus, this would avoid a new message on a different topic switching topic, and the only race condition would be between observing the most recent message and pressing reply to start replying.</p>\n<p>Essentially, it would be nice if seeing a message, deciding to reply, hitting reply, writing reply and sending, was the only cognitive effort required and 100% reliable, avoiding the steps of needing to check that the reply is going to the right place each time.</p>",
        "id": 1019000,
        "sender_full_name": "Nick Lindridge",
        "timestamp": 1600355886
    },
    {
        "content": "<p>thanks for the <code>end</code> suggestion, this came up as an option when we've been discussing the issue, which has been to some length on a number of occasions now :) I haven't trained myself and already forgotten about it though. </p>\n<p>Another feature I couldn't find when trying to correct an incorrect post was a move feature. The only way I could find so far to move a message was copy/paste, and that had its own issues where too much text would be copied (basically more than what was selected), as well as including the user in the selection. So a move message feature would be nice, though I've only needed that to fix posting to the wrong place.</p>",
        "id": 1019002,
        "sender_full_name": "Nick Lindridge",
        "timestamp": 1600356129
    },
    {
        "content": "<p>Your problem statement makes perfect sense, but it's just tricky to guess which place to put the cursor after certain actions.  If you are replying to an upscreen message, then click away for some reason, and then we jump you down to the last message, that creates a new class of \"mix\" possibilities.</p>",
        "id": 1019003,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600356203
    },
    {
        "content": "<p>For moving messages, you should be able to use the pencil icon in the upper right corner of a message, which lets you edit the topic of a message.  Let me find some docs...</p>",
        "id": 1019004,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600356283
    },
    {
        "content": "<p><a href=\"https://zulipchat.com/help/change-the-topic-of-a-message\">https://zulipchat.com/help/change-the-topic-of-a-message</a></p>",
        "id": 1019005,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600356314
    },
    {
        "content": "<p>Ideally, we try to prevent mixes altogether, which is why we try to show the cursor outline somewhat prominently, and which is why we do \"compose fade\", but prevention isn't always possible without us introducing extra inconvenience (like \"are you sure this is the topic?\") or visual clutter (making it more obvious which message is being replied to).  And then the fallback is to just edit the stream/topic.</p>",
        "id": 1019006,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600356569
    },
    {
        "content": "<p>That works to edit, but I think it's just freeform text and you can't select an existing topic. Haven't tried pasting an existing one in though. </p>\n<p>Replying and clicking away creates a draft, so selecting the last message on a new reply at that point would probably still be ok, and then going back to the draft would select the related conversation again, protecting from auto select behaviour. There might be cases where it is an issue as you said.</p>",
        "id": 1019007,
        "sender_full_name": "Nick Lindridge",
        "timestamp": 1600356590
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"17281\">Nick Lindridge</span> <a href=\"#narrow/stream/101-design/topic/Replies.20too.20easily.20may.20go.20to.20the.20wrong.20stream/near/1019007\">said</a>:</p>\n<blockquote>\n<p>That works to edit, but I think it's just freeform text and you can't select an existing topic.</p>\n</blockquote>\n<p>Huh, yeah, I don't know why we don't have a dropdown there.  Or at least autocomplete.</p>",
        "id": 1019008,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600356733
    },
    {
        "content": "<p>I just opened <a href=\"https://github.com/zulip/zulip/issues/16368\">https://github.com/zulip/zulip/issues/16368</a> for that.  I am surprised we have never implemented that, or that I have never noticed it.  I am a fairly long-time user who mostly avoids interleaved views, so I am not super prone to mixes, but it definitely happens to me every couple weeks or so, and I never really thought about autocomplete.</p>",
        "id": 1019012,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600356973
    },
    {
        "content": "<p>Feel free to comment on the issue directly, or we can wait here to see what other folks think.</p>",
        "id": 1019013,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600356996
    },
    {
        "content": "<p>It wouldn't be crazy to allow you to drag a message to a topic in the left sidebar, either.  I think we mostly avoid drag/drop in our UI, but I don't if that's a philosophical decision we've made, or if it's simply just a type of feature that we haven't invested time in polishing yet.  I suspect it's mostly the latter.</p>",
        "id": 1019014,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600357153
    },
    {
        "content": "<p>Thanks Steve. If you ever do polls, perhaps asking how often people post in the wrong place would be useful;  as it's user error, it's the kind of thing that's less likely to be flagged up than an obvious bug.</p>",
        "id": 1019015,
        "sender_full_name": "Nick Lindridge",
        "timestamp": 1600357192
    },
    {
        "content": "<p><a href=\"https://github.com/zulip/zulip/issues/14187\">https://github.com/zulip/zulip/issues/14187</a> is interesting, too (helping to split topics).  I think we had some outside contributor do a little work on it, but they got busy with other stuff.</p>",
        "id": 1019017,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600357266
    },
    {
        "content": "<p>Depending on the number of possible candidate targets, a right click \"move to\" / \"copy to\" might be easiest. Simpler to implement and less error prone than drag drop.</p>",
        "id": 1019018,
        "sender_full_name": "Nick Lindridge",
        "timestamp": 1600357310
    },
    {
        "content": "<p>/poll How often do you think you send messages to the wrong topic by accident.</p>\n<ul>\n<li>Often (once ever 10 messages or so)</li>\n<li>Somewhat often (once every 50 or so)</li>\n<li>Rarely (once every 200 or so)</li>\n<li>Almost never or never</li>\n</ul>",
        "id": 1019019,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600357417
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"17281\">Nick Lindridge</span> <a href=\"#narrow/stream/101-design/topic/Replies.20too.20easily.20may.20go.20to.20the.20wrong.20stream/near/1019018\">said</a>:</p>\n<blockquote>\n<p>Depending on the number of possible candidate targets, a right click \"move to\" / \"copy to\" might be easiest. Simpler to implement and less error prone than drag drop.</p>\n</blockquote>\n<p>My personal opinion is that we should consider spliting up the edit-message-content feature from the move-topic feature, instead of combining them in the same dialog under the same menu option, as we do now.  But I think it might be a tough sell at this point.</p>",
        "id": 1019021,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600357530
    },
    {
        "content": "<p>Just to be clear about drag/drop, I would only consider that supporting it in addition to other options.  And you obviously want to be somewhat careful about drag/drop interfaces, since accidental mouse swipes can be very confusing if you're overly aggressive about supporting drag/drop.</p>",
        "id": 1019023,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600357627
    },
    {
        "content": "<p>I sometimes press 'R' instead of 'r' and end up with a pm compose box and then have to copy paste your message in the topic compose since there is no direct way to convert a pm compose into topic compose.</p>",
        "id": 1019024,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1600357678
    },
    {
        "content": "<p>(not a real issue btw)</p>",
        "id": 1019026,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1600357714
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"5140\">Aman Agrawal</span> <a href=\"#narrow/stream/101-design/topic/Replies.20too.20easily.20may.20go.20to.20the.20wrong.20stream/near/1019024\">said</a>:</p>\n<blockquote>\n<p>I sometimes press 'R' instead of 'r' and end up with a pm compose box and then have to copy paste your message in the topic compose since there is no direct way to convert a pm compose into topic compose.</p>\n</blockquote>\n<p>I agree that this is somewhat of a pitfall.</p>",
        "id": 1019028,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600357760
    },
    {
        "content": "<p>As a general comment, I'm glad we switched away from Skype for chat. Zulip is a massively better experience and far more suitable for us.</p>",
        "id": 1019032,
        "sender_full_name": "Nick Lindridge",
        "timestamp": 1600358054
    },
    {
        "content": "<p>Thanks for the kind words, always appreciated!</p>",
        "id": 1019033,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600358202
    },
    {
        "content": "<p>Yeah, I think we should probably add a UI widget to switch between stream/topic and PMs; I'm not sure how to do it in a nice way given accessibility considerations (I guess it could be just after the preview widget?)</p>",
        "id": 1019466,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1600375987
    }
]