[
    {
        "content": "<p>Hey folks! At present, we have two permissions options for private messages: everyone can send them, or nobody can. With some frequency, we hear from users that they'd like this setting to be more flexible; this is currently tracked as <a href=\"https://github.com/zulip/zulip/pull/13656\">#13656</a>. I'd like to figure out a concrete plan here, as it might be a good candidate for one of the earlier projects we tackle with the new groups system.</p>\n<p>In a recent conversation with a potential customer, they requested a similar feature: who can <em>initiate</em> conversations. That seems really helpful to me, as it cleanly resolves the concern brought up in the description for <a href=\"https://github.com/zulip/zulip/pull/13656\">#13656</a>:</p>\n<blockquote>\n<p>One design question here is whether we will ever want it to be the case that a user can send a PM to another user who cannot reply (e.g. admins being able to guests when guests aren't allowed to send PMs). I think it might be a bad idea from the standpoint of it being a weird state to communicate (that the person you're messaging cannot reply to you), but I suppose we could think about it if there was a compelling use case.</p>\n</blockquote>",
        "id": 1493368,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674174105
    },
    {
        "content": "<p>So I guess my proposal would be to leave the \"who can send messages\" permission as it is for now (everybody or nobody), and add a new setting to control who can initiate PMs. (We'd disable this setting if nobody can send PMs.)</p>\n<p>If we find that nobody needs <a href=\"https://github.com/zulip/zulip/pull/13656\">#13656</a> after this is implemented, we could convert the overall setting for whether PMs are allowed into a checkbox to clean up the UI.</p>\n<p>Thoughts?</p>",
        "id": 1493369,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674174275
    },
    {
        "content": "<p>That makes sense to me!</p>\n<p>I'd expect that in most (almost all?) of the use cases for restricting PMs, the admins/etc. would still want guests/etc. to be able to reply to the PMs they send them — and that if the guests couldn't reply, it would eliminate most of the value of being able to send to them.</p>",
        "id": 1493372,
        "sender_full_name": "Greg Price",
        "timestamp": 1674174693
    },
    {
        "content": "<p>I like this feature in principle, but if eg. an admin PMs a guest once, would that mean the guest (or other user) can reply indefinitely afterwards? What happens if this feature is changed after admins have sent people PMs? Or accidentally messages a user?</p>\n<p>Possible options: a customizable time-window after the last (admin) outgoing message (ie. the conversation times out), or a way for those who can initiate messages to send a 'close' command explicitly.</p>",
        "id": 1493502,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1674198636
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2406\">Neil Pilgrim (neiljp)</span> <a href=\"#narrow/stream/101-design/topic/restricting.20PMs/near/1493502\">said</a>:</p>\n<blockquote>\n<p>I like this feature in principle, but if eg. an admin PMs a guest once, would that mean the guest (or other user) can reply indefinitely afterwards?</p>\n</blockquote>\n<p>The answer that's easy to specify is \"yes\".</p>\n<p>I think for the intended use cases (the ones I have an idea of, anyway), that's perfectly fine. Anything a trusted user (e.g. an admin) can <em>see</em> is fine — the thing they want to prevent is messages they can't see and can't moderate.</p>",
        "id": 1493620,
        "sender_full_name": "Greg Price",
        "timestamp": 1674237668
    },
    {
        "content": "<p>In fact it now occurs to me that an even simpler spec would be: when a user has PM permission, that means they can receive a PM from anyone, as well as send one. So e.g. if only admins have PM permissions, then anyone can send them a PM, even though others can't send PMs amongst themselves.</p>\n<p>I think for some of the use cases we've heard about, this is exactly what would be wanted: the admins want anyone to be able to ask them questions / report issues / etc., even though they don't want ordinary users talking amongst themselves outside the streams the admins can see.</p>",
        "id": 1493621,
        "sender_full_name": "Greg Price",
        "timestamp": 1674237954
    },
    {
        "content": "<blockquote>\n<p>The answer that's easy to specify is \"yes\".</p>\n</blockquote>\n<p>Yeah, I thought about that same question, but it  gets complicated very quickly. If needed, an admin can mute a user who's bothering them.</p>",
        "id": 1493651,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674239921
    },
    {
        "content": "<blockquote>\n<p>In fact it now occurs to me that an even simpler spec would be: when a user has PM permission, that means they can receive a PM from anyone, as well as send one. So e.g. if only admins have PM permissions, then anyone can send them a PM, even though others can't send PMs amongst themselves.</p>\n</blockquote>\n<p>Hmm, yeah, that fits well with <a href=\"https://github.com/zulip/zulip/issues/13656#issuecomment-597562628\">https://github.com/zulip/zulip/issues/13656#issuecomment-597562628</a>.</p>",
        "id": 1493655,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674240336
    },
    {
        "content": "<p>I'm trying to think about how to explain the idea to users -- it seems a bit trickier to word it clearly?</p>",
        "id": 1493656,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674240363
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> <a href=\"#narrow/stream/101-design/topic/restricting.20PMs/near/1493621\">said</a>:</p>\n<blockquote>\n<p>In fact it now occurs to me that an even simpler spec would be: when a user has PM permission, that means they can receive a PM from anyone, as well as send one. So e.g. if only admins have PM permissions, then anyone can send them a PM, even though others can't send PMs amongst themselves.</p>\n</blockquote>\n<p>How would one make this specification handle group private messages? One option is to just make that a different class of permission -- a lot of consumer chat apps do -- but I'm not sure one wants to have the workaround for sending a PM without permission to be that you can CC anyone who does have permission for PMs on a new group PM along with the target recipient.</p>",
        "id": 1502431,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675474400
    },
    {
        "content": "<p>A lot of consumer chat apps have rules like \"You can only initiate a group PM conversation if all the people have accepted you as a friend\", or something along those lines, but I'm not sure adding a \"friends\" feature as a dependency is a good answer.</p>",
        "id": 1502433,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675474494
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/restricting.20PMs/near/1502431\">said</a>:</p>\n<blockquote>\n<p>How would one make this specification handle group private messages?</p>\n</blockquote>\n<p>Good question. Here's one version: you can send a given PM if either:</p>\n<ul>\n<li>you yourself have PMs permission, or</li>\n<li>all the other recipients have PMs permission.</li>\n</ul>\n<p>So e.g. anyone could send a group-PM to several admins, and the admins could reply.</p>\n<p>And there wouldn't be a loophole where you CC someone with permission in order to PM someone you otherwise couldn't.</p>",
        "id": 1502440,
        "sender_full_name": "Greg Price",
        "timestamp": 1675474749
    },
    {
        "content": "<p>The price of that is that if an admin sends a group PM to several users lacking PMs permission, none of them could reply in the same thread — they can only reply directly to the admin (and/or any others they CC'd who do have permission.)</p>\n<p>That'd probably be annoying in some use cases. If we go with that plan, we'd probably want a warning to the admin when they're about to start such a thread.</p>\n<p>I suspect in a lot of the use cases for this feature, though, that may be perfectly fine.</p>",
        "id": 1502441,
        "sender_full_name": "Greg Price",
        "timestamp": 1675474912
    },
    {
        "content": "<p>Alternatively, as I said above:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> <a href=\"#narrow/stream/101-design/topic/restricting.20PMs/near/1493620\">said</a>:</p>\n<blockquote>\n<p>I think for the intended use cases (the ones I have an idea of, anyway), […] Anything a trusted user (e.g. an admin) can <em>see</em> is fine — the thing they want to prevent is messages they can't see and can't moderate.</p>\n</blockquote>\n<p>So when that is the goal, the existence of this workaround/loophole:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/restricting.20PMs/near/1502431\">said</a>:</p>\n<blockquote>\n<p>[…] but I'm not sure one wants to have the workaround for sending a PM without permission to be that you can CC anyone who does have permission for PMs on a new group PM along with the target recipient.</p>\n</blockquote>\n<p>is no problem at all. If in order to PM someone you have to CC an admin, that means an admin does see it and can moderate. And the admin will tell you to knock it off right quick if you're doing something undesired.</p>",
        "id": 1502442,
        "sender_full_name": "Greg Price",
        "timestamp": 1675475073
    },
    {
        "content": "<p>I haven't thought this through fully, but I wonder if questions like \"Can you reply to an existing PM thread even if you don't have PM permission?\" and \"Can you send PMs to someone with PM permission if you don't have it yourself?\" would make sense as future checkbox settings, on top of a \"Role who has PM permission\" option?</p>",
        "id": 1503055,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675622692
    },
    {
        "content": "<p>I think ideally we want to come up with a feature that will cover the vast majority of use cases and will work sensibly without additional related features.</p>\n<p>I think it's nice if (unless someone's role changes), you can always respond to a PM you received. The model where the presence of an admin \"blesses\" a (group) PM thread is better from that perspective, and I don't think we have reason to think (from what we've heard from users so far) that it would not be preferred.</p>",
        "id": 1504451,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1675797838
    },
    {
        "content": "<p>I'm trying to think how we would describe this to users... Perhaps, \"Which roles must be present in every PM conversation?\", with the dropdown options being \"Admin\", \"Admin or moderator\", \"Admin or moderator or full member\", etc.?</p>",
        "id": 1504454,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1675797963
    },
    {
        "content": "<p>Chatting with <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> offline, it seems like we might want a couple of settings to cover different use cases.</p>\n<p>Settings: who can initiate PMs, who can \"bless\" PMs (not the wording we'll use)</p>\n<p>Education use case: students shouldn't be able to message each other, but should be able to message their instructors<br>\nConfig: Anyone can initiate, moderators+ can bless</p>\n<p>Open community struggling with spam use case: core team members should be able to message each other, but other users shouldn't be able to bug anybody via PMs<br>\nConfig: Moderators can initiate, doesn't really matter who can bless (anyone or moderators+)</p>\n<p>Does that make sense?</p>",
        "id": 1504473,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1675800904
    },
    {
        "content": "<p>To be clear, you'd be able to send a private message only if both rules gave you permission to do so.</p>",
        "id": 1504618,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675813561
    },
    {
        "content": "<p>I was encouraged to post here by <a href=\"https://github.com/zulip/zulip/issues/13656#issuecomment-1421328787\">https://github.com/zulip/zulip/issues/13656#issuecomment-1421328787</a></p>\n<p>I guess it might help for me to explain the use cases that make this topic of interest:</p>\n<ul>\n<li>We're eager to allow guests (our customers) to have limited/restricted access to our Zulip instance, but to do this we need to keep all communication between customers and staff in the designated stream(s). We would want to disable the ability for regular users (staff) and guests to be able to converse with each other via PM. Admins <em>may</em> have a need to initiate a PM with a guest (and I agree that in such cases, the guest should also be able to reply: a one-way PM doesn't make any sense to me).</li>\n<li>The PM feature is heavily over used within our instance (72% last month) vs. our intended purposes and policies (staff are supposed to conduct the majority of their conversations in public/private streams for about 100 different reasons - but the reality clearly does not match, so we need feature tools to help us to modify these behaviours). We want to disable the ability for regular users to be able to converse with each other via PM. Managers (more than just \"admins\") need to be able to be able to PM with their subordinates though (meaning a PM initiated in either direction).</li>\n</ul>\n<p>Taken together, I think the ideas discussed above regarding 2 groups of users (1 allowed to use PM, and another not) is on a good track vs. our needs. The difference is that I would need to be able to enable PMs for an arbitrary set of users (not everyone who needs this ability is a Zulip admin).</p>\n<p>So from my perspective:</p>\n<ul>\n<li>Any user can have \"Can use PM\" permission yes/no</li>\n<li>A PM group must include at least 1 participant with \"Can use PM\" permission<ul>\n<li>a user without \"Can use PM\" permission can initiate and reply to a PM, provided that the other user has \"Can use PM\"</li>\n<li>a user without \"Can use PM\" permission can form/reply to a group PM, provided that at least one recipient has \"Can use PM\"</li>\n<li>a user with \"Can use PM\" permission can initiate and reply to a PM with any other user(s)</li>\n</ul>\n</li>\n</ul>",
        "id": 1507372,
        "sender_full_name": "Damien Ransome",
        "timestamp": 1676110167
    },
    {
        "content": "<p>Thanks for that detailed description, <span class=\"user-mention\" data-user-id=\"26017\">@Damien Ransome</span> !</p>\n<p>So it sounds like in your case the key feature is \"who can \"bless\" PMs\" from just above in the thread; you don't need a restriction on initiating PMs. Also, it's a use case for adding flexible group-based permissions.</p>\n<p>You do describe one feature that I think is not addressed by the discussion so far:</p>\n<blockquote>\n<p>Managers (more than just \"admins\") need to be able to be able to PM with their subordinates though (meaning a PM initiated in either direction).</p>\n</blockquote>\n<p>Is it OK if managers can PM with people on other teams? If not, we're getting into really fine-grained distinctions here as to who precisely can PM with whom.</p>",
        "id": 1511451,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1677092558
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> yes, in our use case the manager would have this PM superpower; although the intended purpose of that power is to be able to converse with their own subordinates, it's not necessary to impose any additional restrictions on that.</p>\n<p>I.e. manager of <code>team A</code> should be able to PM with <code>team A</code> members, but it's totally fine for manager of <code>team A</code> to have the freedom to also PM with <code>team B</code> members, or even <code>team B</code> manager.</p>\n<p>The overall aim from my perspective is to reduce general PM usage and push conversations that should be taking place in a stream to the proper venue. I believe we can do that sufficiently through changing behaviours in the ordinary staff. In theory, managers have the right attitudes already in place so the restrictions aren't needed for them.</p>",
        "id": 1511530,
        "sender_full_name": "Damien Ransome",
        "timestamp": 1677096563
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/restricting.20PMs/near/1511451\">said</a>:</p>\n<blockquote>\n<p>you don't need a restriction on initiating PMs.</p>\n</blockquote>\n<p>Generally no, but the guest scenario that I mentioned would only really be for guests to reply to an admin-initiated PM.</p>\n<p>It's not a big thing for me either way though - if a guest can <em>only</em> PM with the limited subset of people with the \"bless PM\" privilege, that would be <em>good enough</em> for our needs.</p>",
        "id": 1511535,
        "sender_full_name": "Damien Ransome",
        "timestamp": 1677096899
    },
    {
        "content": "<p>Got it, thanks!</p>",
        "id": 1511552,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1677098620
    },
    {
        "content": "<p>OK, I just filed <strong>Add settings for restricting direct messages</strong> <a href=\"https://github.com/zulip/zulip/pull/24467\">#24467</a>, which is a writeup of the proposal <a href=\"#narrow/stream/101-design/topic/restricting.20PMs/near/1504473\">above</a>. I closed out the previous version of the issue (<a href=\"https://github.com/zulip/zulip/pull/13656\">#13656</a>).</p>",
        "id": 1512442,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1677187712
    },
    {
        "content": "<p>Added a few technical update notes to the issue.</p>",
        "id": 1512525,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1677192895
    },
    {
        "content": "<blockquote>\n<ol>\n<li>\n<p>All direct message and group direct messages must include as sender or recipient at least one member of [default: No requirement].</p>\n<ul>\n<li>The \"nobody\" system group option should be offered and be given a special label, \"Direct messages disabled\".</li>\n<li>Variable name: <code>direct_message_permission_group_id</code></li>\n</ul>\n</li>\n<li>\n<p>Who can start a direct message thread [default: Everyone]</p>\n<ul>\n<li>Variable name: <code>direct_message_initiator_group_id</code></li>\n</ul>\n</li>\n</ol>\n<p>The restriction in (1) applies to all messages sent in a DM/group DM.<br>\nThe restriction in (2) applies only to the first message in a DM or group DM conversation.</p>\n</blockquote>\n<p>Does (2) imply that everyone on an existing Zulip instance would continue to be able to DM each other (assuming that they had done so previously), even if these settings were adjusted to apply some restrictions?</p>",
        "id": 1514134,
        "sender_full_name": "Damien Ransome",
        "timestamp": 1677322221
    },
    {
        "content": "<p>You need to have both checks pass to send a message. Only the second check depends on whether existing messages exist in the conversation.</p>\n<p>So if you set the first setting to nobody, private messages will be disabled in the organization.</p>",
        "id": 1514496,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1677456887
    }
]