[
    {
        "content": "<p>This is with reference to <a href=\"https://github.com/zulip/zulip/pull/23943\">#23943</a>. The PR allows to choose the default value of <code>push notifications</code> field  on subscribing a stream.</p>\n<p>As per current behaviour on resubscribing a stream which was unsubscribed by the user the value of <code>push notifications</code> field will be the value of <code>push notifications</code>at time of unsubscription. So should we keep this behaviour now also or We should just make it equal to the default value of <code>push notifications</code> for the stream irrespective of whether it is first time subscription or resubscription ?</p>",
        "id": 1489451,
        "sender_full_name": "Ujjawal Modi",
        "timestamp": 1673463250
    },
    {
        "content": "<p>Hey folks, just bumping this question for feedback, since I wasn't sure what's best. To sum up, if a user unsubscribes from a stream and later resubscribes to it, what notification settings should we use?</p>\n<ol>\n<li>The user's previous notification settings for this stream. [current behavior]</li>\n<li>Default notifications settings for this stream.</li>\n</ol>\n<p>I can see how (1) could be nice, especially if the resubscribe action is due to unintentionally unsubscribing. But (2) seems better if, e.g., a user resubscribes a while later, as their preferences might well have changed.</p>",
        "id": 1493285,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674166289
    },
    {
        "content": "<p>I agree that (2) seems better. The user's preferences may well have changed; and also using the default settings seems more predictable, in that it isn't governed by state which is hidden or obscure.</p>\n<p>(I'm not sure if there is a way in the UI to see your previous notification settings for a previously-subscribed stream. The obvious place it might appear is in the stream settings panel for that stream — but if the notification settings do appear there, they're liable to be highly misleading if they aren't clearly signposted as inactive.)</p>",
        "id": 1493376,
        "sender_full_name": "Greg Price",
        "timestamp": 1674175528
    },
    {
        "content": "<p>Yeah, you can see the disabled notification settings for a muted stream (visually marked as disabled) in the Notifications personal settings panel. But unsubscribed streams are not shown there.</p>",
        "id": 1493395,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674177664
    },
    {
        "content": "<p>Yeah. So if the old settings from when you were previously subscribed aren't even visible in the UI at all, it's confusing to have them reappear and affect the behavior.</p>",
        "id": 1493398,
        "sender_full_name": "Greg Price",
        "timestamp": 1674177752
    },
    {
        "content": "<p>Cool, <span class=\"user-mention\" data-user-id=\"24860\">@Ujjawal Modi</span> , I think you can update your PR to reset the setting to the stream default when a user re-subscribes.</p>",
        "id": 1493402,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674177853
    }
]