[
    {
        "content": "<p>If compose box gets closed with a message on it and I open it again I would like to see the message that I typed restored on compose box. Its kind of painful to open the drafts and restore the message. Thoughts?</p>",
        "id": 281539,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1505421193
    },
    {
        "content": "<p>I think we debated this for a while a few months ago.  I'm personally against auto-restoring drafts, because 90% of the time my draft is \"n\" from typing a hotkey while the compose box is open.  I think people proposed some heuristic where if the message is too small, you don't restore it, but I feel like that leads to inconsistent behavior.</p>",
        "id": 281541,
        "sender_full_name": "Steve Howell",
        "timestamp": 1505421422
    },
    {
        "content": "<p>hmm. For people who don't use hot keys that much I think this won't be an issue. May be wean we have this as an option that user can enable in settings if enough people want this feature?</p>",
        "id": 281544,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1505421585
    },
    {
        "content": "<p>Maybe have a button next to Drafts that restores the last typed message?</p>",
        "id": 281545,
        "sender_full_name": "Tommy Ip",
        "timestamp": 1505421619
    },
    {
        "content": "<p>The last typed message is on the top of the drafts, so it should be a d followed by an enter to restore the message.</p>",
        "id": 281551,
        "sender_full_name": "Sampriti Panda",
        "timestamp": 1505421866
    },
    {
        "content": "<p>Before introducing any new settings or changes to how the compose box works, I think the top priority is to clean up the drafts UI.  The first message should be a lot more prominent than older drafts.</p>",
        "id": 281561,
        "sender_full_name": "Steve Howell",
        "timestamp": 1505422199
    },
    {
        "content": "<p>We could also consider shift-d to \"restore last draft\", or something.</p>",
        "id": 281697,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1505435753
    },
    {
        "content": "<p>Hmm, yeah, shift-d is probably good.</p>",
        "id": 281791,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1505463445
    },
    {
        "content": "<p>Opened as <a href=\"https://github.com/zulip/zulip/pull/6547\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/6547\">#6547</a></p>",
        "id": 282152,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1505491602
    }
]