[
    {
        "content": "<p>Why does <a href=\"http://chat.zulip.org\" target=\"_blank\" title=\"http://chat.zulip.org\">chat.zulip.org</a> use the same domain for both the web interface and the user data (e.g. images).   Most things separate them to avoid cookie leakage/js injection (e.g. Matrix suggests having Riot on a separate domain).</p>",
        "id": 567805,
        "sender_full_name": "Dave Gilbert",
        "timestamp": 1524415391
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7589\">@Dave Gilbert</span> I tihnk <a href=\"http://zulipchat.com\" target=\"_blank\" title=\"http://zulipchat.com\">zulipchat.com</a> handles this differently from this server. <br>\nIn any case, we should probably make it more clear somewhere that this (<a href=\"http://chat.zulip.org\" target=\"_blank\" title=\"http://chat.zulip.org\">chat.zulip.org</a>) is not a \"production-level\" installation.</p>",
        "id": 567806,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1524416212
    },
    {
        "content": "<p>(We are pretty careful about security stuff though, including here. So you should wait for an answer from Tim or Greg :))</p>",
        "id": 567807,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1524416275
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7589\">@Dave Gilbert</span> the answer is basically that this is first and foremost a development server for the community, and we want to be testing what most users will setup in practice (which generally is not doing a separate domain).  For the SaaS service on <a href=\"http://zulipchat.com\" target=\"_blank\" title=\"http://zulipchat.com\">zulipchat.com</a>, we use a separate domain.  I should note that we use a strong <code>Content-Security-Policy</code> for the uploads directories to prevent JS injection (and similar attacks) if you're not using a separate domain for user content, and so using a separate host would just be a second layer of protection (which I'm generally a fan of doing wherever possible).</p>",
        "id": 567863,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1524427989
    }
]