[
    {
        "content": "<p>If you send a message to yourself from a client (web/mobile app, not the API), we automatically mark the message as read for you. (The logic rule applies to all messages you send, actually, not just those you send to yourself, but the case of sending to yourself is important for what follows).</p>\n<p>When you schedule a message to be sent to yourself, I feel like your intent must be that you want to trigger notifications (I imagine this being like a discount \"reminder\" feature, but one can also imagine cases where that feels like the nicer interface because you want to control the content of the reminder for yourself for whatever reason).</p>\n<p>Certainly I've sent emails to myself in Gmail because I want to be reminded of something, and wanted to add a note that wouldn't be a place to write down with their snooze feature.</p>",
        "id": 1566119,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1683742775
    },
    {
        "content": "<p>So I think at least in some circumstances, messages that you scheduled to be sent should be marked as unread for you. The question is whether those circumstances should be \"every message you schedule to be sent\", or something else.</p>",
        "id": 1566120,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1683742806
    },
    {
        "content": "<p>The technically simplest and probably logically simplest change would be \"Messages you schedule to be sent are treated like messages you send via the API / not a full-featured client, and thus not automatically marked as read despite being new\".</p>",
        "id": 1566121,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1683742880
    },
    {
        "content": "<p>But if that's not the behavior we want, there's a number of ways that we could control it.</p>",
        "id": 1566122,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1683742897
    },
    {
        "content": "<p>I tried this feature this morning with a message to myself and I was also puzzled that the message was automatically marked as read. In all the scenarios I can come up with, sending a message to my future self would mean that I want to be notified of something sometime in the future, so marking it automatically as \"read\" doesn't make sense to me for messages-to-self.</p>",
        "id": 1566142,
        "sender_full_name": "Angel de Vicente",
        "timestamp": 1683743496
    },
    {
        "content": "<p>I definitely agree about the messages to yourself piece of this.</p>\n<p>I think you probably want messages scheduled to be sent to other people to be marked as read, as usual? E.g., I'm thinking you scheduled a message to someone for the morning. If there's a unread counter when you get back to your computer, your gut reaction will be that the person replied to your scheduled message, not that your message went through but there's no response yet.</p>",
        "id": 1566180,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1683744706
    },
    {
        "content": "<p>Yes, I guess the only special case should be when sending to yourself? (but what about if sending it to a group of people, yourself included? I guess the delayed message to yourself could be marked as not read but the messages to all the other people as read? Not sure if this would be ugly from the technical point, but it looks like the most sensible option?</p>",
        "id": 1566231,
        "sender_full_name": "Angel de Vicente",
        "timestamp": 1683746120
    },
    {
        "content": "<p>I'm proposing that a scheduled DM message that includes any recipients besides yourself would be marked as read.</p>",
        "id": 1566243,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1683746334
    },
    {
        "content": "<p>yes, sure, IMO that should be like you say</p>",
        "id": 1566267,
        "sender_full_name": "Angel de Vicente",
        "timestamp": 1683746644
    },
    {
        "content": "<p>I think that rule sounds reasonable to me, it'll fix the case we're aware of being a problem, and we can always make further tweaks if there's feedback about use cases where it'd be helpful for it to do so in other circumstances.</p>",
        "id": 1566278,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1683746991
    },
    {
        "content": "<p>The intention will be that this flag will be applied in the backend upon scheduled sending?</p>",
        "id": 1566309,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1683748242
    },
    {
        "content": "<p>Effectively. At a code level, we have this check, \"for the user who's the sender, potentially mark it as already read\", and we'd change that check to have an exclusion for a scheduled message.</p>\n<div class=\"codehilite\"><pre><span></span><code>    for user_profile_id in um_eligible_user_ids:\n        flags = base_flags\n        if (\n            (user_profile_id == sender_id and message.sent_by_human())\n            or user_profile_id in mark_as_read_user_ids\n            or (limit_unread_user_ids is not None and user_profile_id not in limit_unread_user_ids)\n        ):\n            flags |= UserMessage.flags.read\n</code></pre></div>",
        "id": 1566319,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1683748739
    },
    {
        "content": "<p>Filed a release goal issue: <strong>Scheduled messages to yourself should be marked as unread</strong> <a href=\"https://github.com/zulip/zulip/pull/25523\">#25523</a>.</p>",
        "id": 1566434,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1683754687
    },
    {
        "content": "<p>Quick update: <a href=\"https://github.com/zulip/zulip/pull/25523\">#25523</a> is closed this as completed in <a href=\"https://github.com/zulip/zulip/pull/25583\">#25583</a>.</p>",
        "id": 1574782,
        "sender_full_name": "Daniil Fadeev",
        "timestamp": 1684839092
    }
]