[
    {
        "content": "<p>Hey folks! It is currently not possible to send a message to a stream you're not subscribed to. </p>\n<p>However, we have an inconsistency where rather than disabling the compose box or the send button, we show a banner that implies that messages <em>can</em> be sent.<br>\n<a href=\"/user_uploads/2/4a/YzIEfqWZVGpFa9pOqn_IinHS/Screen-Shot-2022-01-28-at-1.25.41-PM.png\">Screen-Shot-2022-01-28-at-1.25.41-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/4a/YzIEfqWZVGpFa9pOqn_IinHS/Screen-Shot-2022-01-28-at-1.25.41-PM.png\" title=\"Screen-Shot-2022-01-28-at-1.25.41-PM.png\"><img src=\"/user_uploads/2/4a/YzIEfqWZVGpFa9pOqn_IinHS/Screen-Shot-2022-01-28-at-1.25.41-PM.png\"></a></div><p>According to <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span>, the back story is that we've gone back and forth in the past as to whether or not to allow sending to an unsubcribed stream. Either choice is easy from a technical perspective -- we just need to pick one and make the UI communicate correctly what's going on.</p>\n<p>Thoughts on which way to go?</p>",
        "id": 1318205,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1643405940
    },
    {
        "content": "<p>I can imagine various scenarios where sending to an unsubscribed stream would be convenient, e.g. a senior manager dropping by a thread in some team's channel to congratulate them on a feature launch.</p>",
        "id": 1318206,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1643406012
    },
    {
        "content": "<p>My vote is to not allow it.  The use case is certainly plausible, but it seems rare enough to me that we should just let folks use the obvious workarounds.</p>",
        "id": 1318211,
        "sender_full_name": "Steve Howell",
        "timestamp": 1643407014
    },
    {
        "content": "<p>For context, the Zulip backend has always allowed you to send messages to public streams without being subscribed -- it's a client-side limitation that was added a few years ago that you can't actually click send here.</p>",
        "id": 1318272,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643409707
    },
    {
        "content": "<p>I guess I don't understand what the benefit is of not allowing one to do so -- it's about the same UI and user-facing complexity either way.</p>",
        "id": 1318273,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643409728
    },
    {
        "content": "<p>Where there is some small (marginal, I agree) benefit of being able to send without subscribing, and as one can see with the banner we've already done the work to communicate what one would want to know about this situation to users.</p>",
        "id": 1318274,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643409818
    },
    {
        "content": "<p>It sounds to me like we should just let the Send button work in this case.</p>\n<p>In particular, it seems like that'd be the simplest way to make this consistent -- we already have all the UI set to communicate that.</p>",
        "id": 1345532,
        "sender_full_name": "Greg Price",
        "timestamp": 1647384398
    },
    {
        "content": "<p>Yeah, I think I agree with that.</p>",
        "id": 1345621,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647386601
    },
    {
        "content": "<p>Works for me. <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> do we need an issue for this?</p>",
        "id": 1345632,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647386897
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> yes, that'd be appreciated.</p>",
        "id": 1345683,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647388190
    },
    {
        "content": "<p>Filed <a href=\"https://github.com/zulip/zulip/pull/21433\">#21433</a>; marked high priority because it sounds like it should be easy, and will address an inconsistent/confusing experience.</p>",
        "id": 1345705,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647388516
    },
    {
        "content": "<p>What about the error message, Should we still be displaying it with the message being sent?</p>",
        "id": 1346412,
        "sender_full_name": "Yash",
        "timestamp": 1647461601
    },
    {
        "content": "<p>Do you mean the orange banner in Alya's screenshot at the top of the thread?</p>\n<p>If so: yes, we definitely want to continue showing that warning. We just want to let the user ignore the warning and send anyway, if they choose.</p>",
        "id": 1346603,
        "sender_full_name": "Greg Price",
        "timestamp": 1647474767
    },
    {
        "content": "<p>I have made a PR for this issue. Can anyone please review the <a href=\"https://github.com/zulip/zulip/pull/21467\">PR#21467</a>?</p>",
        "id": 1347218,
        "sender_full_name": "Yash",
        "timestamp": 1647549850
    },
    {
        "content": "<p>I've tagged this as a release goal and asked a couple folks to review. No guarantees we'll ship it, and <span class=\"user-mention\" data-user-id=\"22581\">@Yash</span> you should start by fixing CI, but it seems like it'd be nice to include either in the release or in 5.1 if we can.</p>",
        "id": 1347343,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647556894
    },
    {
        "content": "<p>I gave this a try, implementing it as a \"Send anyway\" button, which seemed pretty easy &amp; intuitive:<br>\n<a href=\"https://github.com/zulip/zulip/issues/21433\">PR #21433</a><br>\ncc <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> - WDYT?  includes a unittest, etc <span class=\"user-mention\" data-user-id=\"2187\">@Greg Price</span></p>\n<p>Showing both the action, and how the buttons look on a narrower screen:<br>\n<a href=\"/user_uploads/2/6c/FEWAYVTZGZUy22GQA8sRwFbM/164093817-ca87cdc1-9c61-4ca0-8398-41c81303746e.gif\">164093817-ca87cdc1-9c61-4ca0-8398-41c81303746e.gif</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/6c/FEWAYVTZGZUy22GQA8sRwFbM/164093817-ca87cdc1-9c61-4ca0-8398-41c81303746e.gif\" title=\"164093817-ca87cdc1-9c61-4ca0-8398-41c81303746e.gif\"><img src=\"/user_uploads/2/6c/FEWAYVTZGZUy22GQA8sRwFbM/164093817-ca87cdc1-9c61-4ca0-8398-41c81303746e.gif\"></a></div>",
        "id": 1370703,
        "sender_full_name": "Adam Sah",
        "timestamp": 1650475110
    },
    {
        "content": "<p>So looking at the screencast, I notice a bug, which is that the \"You unsubscribed from ...\" notice appears in the wrong place after sending such a message.</p>",
        "id": 1373190,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1650919456
    },
    {
        "content": "<p>I think there's a few things going on that bug: </p>\n<ul>\n<li>I notice the timestamp isn't appearing -- that's what happens when the server does not confirm a locally echoed message via the <a href=\"https://zulip.readthedocs.io/en/latest/subsystems/events-system.html\">server=&gt;client events system</a>. This is likely happening because the current user is not subscribed to the stream, and thus is not a \"recipient\" of the message. It's possible we want to do a preparatory change to the server to always include the sender as a recipient of stream messages, even if they are not subscribed -- but I'm not sure that doesn't have cascading secondary issues. (We'd at the very least be removing the invariant that stream messages you receive are always to a stream you're subscribed to, which could break clients that assume that invariant is true).</li>\n<li>We're not setting the <code>historical</code> flag properly for the locally echoed message, which is oddly named but generally is used whenever we are displaying a message that the current user did not receive, and is used to back-computer where to display those informative notices.</li>\n</ul>",
        "id": 1373191,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1650919678
    },
    {
        "content": "<p>If we think those two visible glitches are a problem, which seems likely, then we likely need to address both of those details before we can merge this change.</p>",
        "id": 1373192,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1650919820
    },
    {
        "content": "<p>The hacky option we have is that we could trigger a hard refresh of the current view when we get a 200 after sending a message via this \"send anyway\" code path ... but we try hard to avoid having code paths like that.</p>",
        "id": 1373193,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1650919877
    },
    {
        "content": "<p>thx/gotcha - I'm on it, will dig in.</p>",
        "id": 1373275,
        "sender_full_name": "Adam Sah",
        "timestamp": 1650924360
    }
]