[
    {
        "content": "<p>Hi,<br>\nMy name is Hayder I have been using Zulip for the past two weeks in our company we think there's something in the design that will help a lot if implemented.<br>\nWhich is having messages sent aligned to the right and messages received aligned to the right just like it's in most Chat apps.<br>\nIt will greatly help in reading the messages specially when reading from history</p>",
        "id": 856913,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587234915
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"15718\">@Hayder Sinan</span> This style is definitely common, and I'm sure others will respond too, but personally I'm not sure if this left/right styling will work so well for Zulip. Many other systems are based on writing shorter messages to get a reply in quickly since messages aren't limited to specific topics; since Zulip has less of an issue with this then message lengths can be naturally longer.</p>",
        "id": 856990,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1587240541
    },
    {
        "content": "<p>That said, what front-end are you using? (web-app/desktop/mobile?)</p>",
        "id": 856991,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1587240588
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"2406\">@Neil Pilgrim</span>  for replying <br>\nAs for frontends based on stats 43% of our messages are sent from desktop 27% are sent from mobile and 29% are sent from web</p>",
        "id": 856994,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587240883
    },
    {
        "content": "<p>About long messages I don't think it will be an issue with alignment if we added a limited width that a message can take for example only 90% of available width and in this way both the message will take enough space and the alignment will give a much better in identifying the sender of the message if it's me or not</p>",
        "id": 856997,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587241143
    },
    {
        "content": "<p>The other aspect against may be how many messages are sent by you vs others.</p>",
        "id": 857136,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1587271381
    },
    {
        "content": "<p>Anyhow, I'll leave others to weigh in here :)</p>",
        "id": 857137,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1587271401
    },
    {
        "content": "<p>It's an interesting idea... the central theme being: \"Visually differentiate me (and my messages) from them.\"<br>\nOur competitors don't do this, probably because it doesn't make sense / look good / cause convenient eye movement and UX.<br>\nMaybe prototype with having one's own username to the right? idk.<br>\nMaybe give your own messages a different colored background?</p>\n<p>Maybe this is a change we only want to do for PMs? Those are more likely to be 1 to 1 conversations. but then... that'd make PMs look different from regular stream conversations. Which might be something we want anyway, idk!</p>\n<p>When you're talking to 5 or six people at a time, which is what this and our competitors products are designed to facilitate, how often does it matter to identify your own name?</p>\n<p>Very interesting idea, thanks for bringing it up. </p>\n<p>I'd love to see mock ups.<br>\n(You can make them in MS paint or photoshop for all I care, I'd really just like to see some of the ideas here).</p>",
        "id": 857166,
        "sender_full_name": "Yash RE",
        "timestamp": 1587281539
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"9808\">@Yash RE</span> We have discussed this in the context of zulip-term, but some options are limited of course :)</p>",
        "id": 857242,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1587297883
    },
    {
        "content": "<p>I'm having the gradual, dawning realisation that zterm UI is moving faster than the mobile or web app and it scares me for some reason.</p>",
        "id": 857246,
        "sender_full_name": "Yash RE",
        "timestamp": 1587298112
    },
    {
        "content": "<p>In a good way though, <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 857247,
        "sender_full_name": "Yash RE",
        "timestamp": 1587298224
    },
    {
        "content": "<p>Thanks for sharing will try to work some drawings and get back to you as soon as possible</p>",
        "id": 857708,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587348982
    },
    {
        "content": "<p>As for the idea of implementing this in PM it also make alot of sense at least for us or companies who work like us</p>",
        "id": 857709,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587349036
    },
    {
        "content": "<p>We have around 60% of our messages are done in PMs</p>",
        "id": 857710,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587349062
    },
    {
        "content": "<p>That's because we have a lot of diversity in work so if we created a streams for the stuff it would cause to issues</p>",
        "id": 857711,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587349150
    },
    {
        "content": "<p>First topics will be in 100 which are active and this will cause issues to users not the system.</p>",
        "id": 857712,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587349199
    },
    {
        "content": "<p>The second is that a lot of people are gone get notified for things that is intended for them</p>",
        "id": 857713,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587349236
    },
    {
        "content": "<p>So a lot of the messages we have is actually a 1 to 1 PMs</p>",
        "id": 857714,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587349268
    },
    {
        "content": "<p>Which is why a lot in my company has suggested to me that we implement some way of a threading in PMs as well not to go with topics but at least grouping messages togather somehow. Since a lot of them time we talk in 1 to 1 about 2 or 3 different things at the same time so with simple would much more organized but that discussion for a different topic</p>",
        "id": 857715,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587349467
    },
    {
        "content": "<p>Thanks</p>",
        "id": 857716,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587349469
    },
    {
        "content": "<p>Have you considered that private streams might be the solution to everything that you want?</p>",
        "id": 857726,
        "sender_full_name": "Yash RE",
        "timestamp": 1587355461
    },
    {
        "content": "<p>you could make a private stream with only 2 people if you really wanted to. That would give you access to the feature of topics.</p>",
        "id": 857727,
        "sender_full_name": "Yash RE",
        "timestamp": 1587355525
    },
    {
        "content": "<p>You wanna watch out and make sure private streams don't get announced.</p>",
        "id": 857728,
        "sender_full_name": "Yash RE",
        "timestamp": 1587355546
    },
    {
        "content": "<p>(announced as in the \"xyz stream was created\" I saw that happen on this server recently and I'm hoping it's just a setting and not a bug)</p>",
        "id": 857729,
        "sender_full_name": "Yash RE",
        "timestamp": 1587355624
    },
    {
        "content": "<p>but anyway, another benefit of using a private stream to handle such discussions is that you have control over the history of the conversation. If necessary, you can invite other people into the conversation and share the history with them. This is something that you can not do via PMs.</p>",
        "id": 857730,
        "sender_full_name": "Yash RE",
        "timestamp": 1587355723
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"13779\">@Hashir Sarwar</span></p>",
        "id": 857731,
        "sender_full_name": "Yash RE",
        "timestamp": 1587355784
    },
    {
        "content": "<blockquote>\n<p>(You can make them in MS paint or photoshop for all I care, I'd really just like to see some of the ideas here).</p>\n</blockquote>\n<p>Also, Idk if it was clear but the \"You\" was meant to refer to \"anyone\". So, new gsoc students, if you want to practice mock ups, this is definitely an opportunity.</p>",
        "id": 857732,
        "sender_full_name": "Yash RE",
        "timestamp": 1587355914
    },
    {
        "content": "<p>Hi<br>\nWell it's very to control 800 users who will they talk but even if we went with private streams it will be hell since if we went with we will endwith a lot of streams which basically it works just like a PM<br>\nWe already have a log of private streams.</p>",
        "id": 857946,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587377309
    },
    {
        "content": "<p>And topics talk about in PM most of the time have a short period of couple of minutes which will be annoying to manage this in stream also it will most of the rime like 99% there's need to share it's history with others.</p>",
        "id": 857947,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587377613
    },
    {
        "content": "<p>Ahh... well, at that scale what you're saying makes more sense... not too enthusiastic about ~400 streams... (even though I think it could still function).</p>",
        "id": 857949,
        "sender_full_name": "Yash RE",
        "timestamp": 1587377804
    },
    {
        "content": "<p>would like to hear more perspectives</p>",
        "id": 857950,
        "sender_full_name": "Yash RE",
        "timestamp": 1587377828
    },
    {
        "content": "<p>I have thought of doing some testing so I have tries the two big names <code>Slack</code> and <code>MS Teams</code> Slack is already being used by some teams in our enterprise which we looking to migrate their work to <code>Zulip</code> so I tries with them.<br>\nmy finding was the following </p>\n<ul>\n<li>\n<p>MS Teams (as pre the images attached) <code>Quota\n as @**Yash RE ✨**  has suggested Maybe this is a change we only want to do for PMs? Those are more likely to be 1 to 1 conversations. but then... that'd make PMs look different from regular stream conversations. Which might be something we want anyway, idk!</code></p>\n<ul>\n<li>for PM called chat there it has different alignments sender to the write and receiver on the left.</li>\n<li>for streams called teams there it has a single alignment everything to the left like in here but the difference is that the messages are encapsulated with in a box which makes very clear boundaries even with replies seems much more clear. </li>\n<li>Slack</li>\n<li>does it in the same way it's being done in here there are no boundaries all messages no matter where it is has the same alignment. which I also hated</li>\n</ul>\n</li>\n</ul>",
        "id": 858256,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587399143
    },
    {
        "content": "<p>also something worth <a href=\"/user_uploads/2/83/LVJlLJ_uXVALk3pbGMVzjKbr/Teams4.jpg\" title=\"Teams4.jpg\">Teams4.jpg</a> <a href=\"/user_uploads/2/ad/ISrGGJQSEvFnSQDE2vtfihCp/Teams3.jpg\" title=\"Teams3.jpg\">Teams3.jpg</a> <a href=\"/user_uploads/2/bc/pw-e-PHKiVaKUfPiI_3WJ88d/Teams2.jpg\" title=\"Teams2.jpg\">Teams2.jpg</a> <a href=\"/user_uploads/2/b3/nxjHx0-4LaU14tjMvvBRK9x2/Teams1.jpg\" title=\"Teams1.jpg\">Teams1.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/83/LVJlLJ_uXVALk3pbGMVzjKbr/Teams4.jpg\" title=\"Teams4.jpg\"><img src=\"/user_uploads/2/83/LVJlLJ_uXVALk3pbGMVzjKbr/Teams4.jpg\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/ad/ISrGGJQSEvFnSQDE2vtfihCp/Teams3.jpg\" title=\"Teams3.jpg\"><img src=\"/user_uploads/2/ad/ISrGGJQSEvFnSQDE2vtfihCp/Teams3.jpg\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/bc/pw-e-PHKiVaKUfPiI_3WJ88d/Teams2.jpg\" title=\"Teams2.jpg\"><img src=\"/user_uploads/2/bc/pw-e-PHKiVaKUfPiI_3WJ88d/Teams2.jpg\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/b3/nxjHx0-4LaU14tjMvvBRK9x2/Teams1.jpg\" title=\"Teams1.jpg\"><img src=\"/user_uploads/2/b3/nxjHx0-4LaU14tjMvvBRK9x2/Teams1.jpg\"></a></div>",
        "id": 858260,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587399230
    },
    {
        "content": "<p>also something else worth mentioning I'm not sure if it applies for something I have created two poll  in our company </p>\n<ul>\n<li>the first asks about those alignment and I have added the same photos also added the photos from Zulip and Slack I have got 233 replies so far distributed as follows<ul>\n<li>MS Teams: 103</li>\n<li>Slack: 63</li>\n<li>Zulip: 67</li>\n</ul>\n</li>\n<li>the second is about overall design of the app and colors contrast<ul>\n<li>Light Theme: all three got almost the same result very small difference between them</li>\n<li>Dark Theme: for this one Slack came out on top people some how love the colors used by Slack for Dark theme then was MS Teams and then Zulip many has suggested the current dark theme has a little bit bright color so it's not relly dark as compared to Slack or Teams</li>\n</ul>\n</li>\n</ul>\n<p>Hope these info helps<br>\nThanks you</p>",
        "id": 858277,
        "sender_full_name": "Hayder Sinan",
        "timestamp": 1587399787
    },
    {
        "content": "<p>Back to the original alignment question, the UI model of right-aligning messages you yourself sent opposite messages other sent works well for a mobile-only chat tool designed for small groups where the screen is small and you send a significant portion of messages, but it's a pretty bad experience in a desktop size browser (where the right-alignment would force one's eyes to scan pretty far away) as well as being the wrong focus for a stream with dozens of users or more (where messages you yourself sent are rare and would just disrupt reading).  This is why all of our peer team chat tools use the same model as Zulip with the same alignment for all messages.</p>\n<p>I think there is a possible feature of some sort of visual adornment of messages that you yourself sent to make it easy to visually filter those in PM conversations.</p>",
        "id": 858344,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1587402576
    }
]