[
    {
        "content": "<p>We've gotten some hints that people care about this feature: <a href=\"https://get.slack.help/hc/en-us/articles/208423427-Set-a-reminder\" target=\"_blank\" title=\"https://get.slack.help/hc/en-us/articles/208423427-Set-a-reminder\">https://get.slack.help/hc/en-us/articles/208423427-Set-a-reminder</a><br>\nIt's also one of the reasonably high feature requests for mattermost.</p>\n<p>Doing a full implementation of slack's feature is a lot of work, and I also suspect they didn't really get it right. I do think it would be nice to have a simple /remind-like function both to say that we have it, and because I think it is a very useful feature for managers and others handling 100s of messages a day.</p>\n<p>What should this look like? Some options.</p>\n<p><strong>Remind is for building a todo list</strong><br>\nFor a V0 each todo can just be a message. The UI for this would look like drafts. You can add items to the todo list via the actions popover menu or an appropriate shortcut. </p>\n<p>I realize so far this is essentially identical to starred messages. I'm not sure why I don't like using starred messages for this. Maybe it's small things, like </p>\n<ul>\n<li>there isn't a keyboard shortcut to get there</li>\n<li>adding and especially removing a star is sort of an annoying hotkey <code>*</code> (I don't have muscle memory for it)</li>\n<li>the chaos of the view: lots of date separators, lots of red at-mentions and grey PMs, and nearly every message is from a different stream.</li>\n</ul>\n<p>or maybe something deeper that suggests this direction is not a good idea.</p>\n<p>Anyway, the V1 of this would allow adding notes, or todos not attached to messages, via </p>\n<ul>\n<li>sending a message <code>/remind blah</code> or <code>/todo blah</code></li>\n<li>when you mark a message as todo you can add a short note</li>\n</ul>\n<p>And then the V2 could allow boomeranging of things in this inbox of todos. </p>\n<p><strong>Remind is for calender reminders</strong><br>\nLike sending a zulip \"eng meeting starts now\" every Thursday at 2.<br>\nAfter thinking about this more I think we should just write a nicely configurable google calendar incoming webhook bot and point people at that.<br>\nThere is a lot of complexity to doing a good job here, and I'm not convinced there is much to add over a few incoming webhook bots (one for each popular calendar tool).</p>\n<p><strong>Remind is for send later</strong><br>\nI think slack's approach: \"/remind <a class=\"stream\" data-stream-id=\"101\" href=\"/#narrow/stream/design\">#design</a> &lt;message&gt; in three hours\" is probably not the right design for us. It doesn't do topics, group PMs, or i18n (Slack mostly just gives up on i18n here). It also doesn't work well with longer messages. </p>\n<p>I think the benefit of a slick slash command for a send later message is also small, since it is a relatively rare action. (Compared to adding todos: you could imagine a busy manager doing 1 every few minutes as they catch up in the morning.)</p>\n<p>So I suspect if we go down this route we'll want to do something like</p>\n<ul>\n<li>If you compose a message starting with /sendlater, it pops up a modal after you send where you pick a date and time (with maybe some preset options like \"in an hour\" or \"tomorrow at 9am\").<br>\n*If this turns out to be a way people really do use zulip, possibly a setting that adds a \"Send later\" button to the compose box. </li>\n</ul>\n<p><strong>Remind is for boomeranging messages to yourself</strong><br>\nLike <a href=\"https://github.com/RocketChat/Rocket.Chat/issues/7946\" target=\"_blank\" title=\"https://github.com/RocketChat/Rocket.Chat/issues/7946\">https://github.com/RocketChat/Rocket.Chat/issues/7946</a></p>\n<p>I think the V0 here would be a \"Remind me about this later\" in the actions popover menu that when clicked would open a modal where you could easily select \"1 hour\", \"tomorrow 9am\", or a specific date and time. <br>\nIt would then send that message to you as a PM from reminder-bot at the specified time (maybe with a link to the original message).</p>\n<p>V1 might be you can reply to a message \"/remindme 5 minutes\", and it would do the same thing without the modal. (Tricky i18n issues here as above, though much simpler since it is just a time that needs to be translated, not a complex phrase.)</p>\n<p>And then the V2 might allow custom notes as well, so \"/remindme take out the trash in 5 minutes\" sent as a PM to reminder-bot.</p>\n<p>(Or possibly V2 and V0 are swapped.)</p>\n<hr>\n<p>Okay, in writing this I mostly answered most of the questions I wanted answered. Slack's \"remind\" function is actually a couple of totally different features wrapped into one UI, and I think it makes sense for us to build them as separate features. (Or more likely, build only 1 or 2 of them for now.)</p>\n<ul>\n<li>General thoughts?</li>\n<li>Which of the four features above seems most important to build first? I'm partial to \"Remind is for building a todo list\", and I could see \"Remind is for boomeranging things to yourself\" as also being the primary feature people would want.</li>\n</ul>",
        "id": 408093,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1514163036
    },
    {
        "content": "<p>Not sure if it's because Slack doesn't have a to do list feature, but for me, the Slack remind system works decently well. I use Slack for my robotics team and whenever I think of something that needs to be done at the next meeting, I set a reminder for Slackbot to message me at that time about it. I use the remind messages a decent amount, not only for myself but to also remind the entire team of things at a later date.</p>",
        "id": 408257,
        "sender_full_name": "Jerry Zhang",
        "timestamp": 1514177958
    },
    {
        "content": "<p>But the todo list is also useful if we could do it here.</p>",
        "id": 408258,
        "sender_full_name": "Jerry Zhang",
        "timestamp": 1514177998
    },
    {
        "content": "<p>These sound like interesting features - and I'm not surprised they're in demand! This is my take on it :)</p>\n<p>To summarise:</p>\n<ul>\n<li><strong>todo list</strong> (one list, many lists later? associated with messages or not)</li>\n<li><strong>calendar reminders</strong> (webhooks -&gt; alerts?)</li>\n<li><strong>send-later</strong> (after duration/at set time)</li>\n<li><strong>remind-me-later</strong> (alert [PM?] re a message at a later time)</li>\n</ul>\n<p>Inputs:</p>\n<ul>\n<li>slash commands (for notes) [initially via bots? see below]</li>\n<li>message menus (for message context)</li>\n</ul>\n<p>Outputs:</p>\n<ul>\n<li>private messages [or other privately-structured/displayed data]</li>\n<li>(group messages?)</li>\n<li>streams</li>\n</ul>\n<p>Does that summarize it?</p>\n<hr>\n<p>From previous discussions, I see slash commands mapping to bots/integrations in some way, so in the short term I see the 'note' part as implementable via messaging/mentioning bots.</p>\n<p>For marking messages for 'followup', and integrating that with bot 'notes', perhaps these components could have an optional 'message callback' which registers that message (id) with them? That could be like the star/drop-down menu for messages, or elsewhere like I think I've seen reference to plugins in other systems which add extra \"features\" to the message if the plugin identifies certain characteristics (I can't think of which system it was). In the short term, a bot could link to a named topic/stream, or the message with a full link?</p>\n<p>Since bots/integrations can already post to all the outputs, this provides a reasonable first approach, I think?</p>\n<p>Other than slash commands relating to bots, for future development I could see this being extended with a better way to organize starred/private messages arising from these type of features, ie. \"personal organization\" of private/stream messages, but also \"notes\", possibly combined. This could involve components (eg. bots/integrations) which can extend the \"All/private/starred/mentions\" section, allowing eg. a 'to-do' view,  'agenda' or 'tagged messages' (dynamic folders).</p>\n<hr>\n<p>Implementation-wise this feels like (with increasing complexity):</p>\n<ul>\n<li>slash commands (to avoid messaging streams/huddles but with the context there; later mapping commands to bots/integrations via UI)</li>\n<li>better message posting to bots (ie. hook into the star/drop-down menu)</li>\n<li>extend top UI section to show private views of bot data (possibly even extracting \"stars\" into \"starbot\" or similar)</li>\n</ul>\n<p>Personally I would really like a 'better star' (ie. to-do) feature, but reliable and with multiple lists :)<br>\n(but that's \"just\" a good to-do bot ;))</p>",
        "id": 408282,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1514178446
    },
    {
        "content": "<p>This is great feedback! I'll start with Jerry's. <br>\nA lot of detailed questions below, because the complexity of the implementation I think will vary a lot depending on exactly which features we support :). </p>\n<ul>\n<li>For remind messages: This is you click on the message, and select one of the ~five options (20 minutes, 3 hours, etc), right? Or are you doing something via /remind? Also, it seems like the click and select version only allows you to remind yourself? Also, do you know if \"tomorrow\" just bumps it exactly 24 hours later, or is it doing something more clever?</li>\n<li>To remind the team and yourself of non-message content, are you are using <code>/remind ...</code> or something else? How important is it that the interface to set the time be slick; i.e. if you could do <code>/remind &lt;message&gt;</code> and then had to click around a bunch to set a time, would that feel like a considerably less usable feature?</li>\n<li>How important is the reminding team feature vs the reminding yourself feature?</li>\n</ul>",
        "id": 408310,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1514179287
    },
    {
        "content": "<p>For Neil: yup, good summary :). </p>\n<p>In terms of remembering the message, we're currently imagining this as a fairly embedded feature, so the bot will have access to the message_id and everything else that's needed.</p>\n<p>And that's good data, about wanting a better star, in terms of multiple lists!</p>",
        "id": 408313,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1514179904
    },
    {
        "content": "<p>I was interested in the slash commands discussion some time ago, but unfortunately lost touch with how that was progressing and didn't have time to contribute in that way - maybe next year! (/msg support would be nice too)</p>",
        "id": 408322,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1514180893
    },
    {
        "content": "<p>I think have a delayed-delivery mechanism on the server would be useful for lots of problems.  It would be nice for simply sending a message to yourself \"in the future,\" and it could be used by bots for more advanced scheduling kind of stuff.</p>",
        "id": 408773,
        "sender_full_name": "Steve Howell",
        "timestamp": 1514202968
    }
]