[
    {
        "content": "<p>Does it make sense to show \"normal\" users a stripped down version of the settings menu. I feel like its confusing for them to see an organization settings option as well as the tab when they open up their user settings. I think a better idea would be to have an option to hide such admin level options from them. Same for the statistics option for example.</p>",
        "id": 663437,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1542811192
    },
    {
        "content": "<p>I don't think we want to completely hide organization settings from normal users, because normal users sometimes want to know what the settings are.  I wonder if a less extreme solution is to make it more obvious which settings are personal and can be changed without an admin's help.</p>",
        "id": 663538,
        "sender_full_name": "Steve Howell",
        "timestamp": 1542822064
    },
    {
        "content": "<p>agreed both that we want them to be able to see it, and that currently it is confusing. I think ideally when you switch to Organization settings there would be a (constant) banner at the top or bottom that explains these are for viewing pleasure only.</p>",
        "id": 663581,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1542824236
    },
    {
        "content": "<p>I think ideally, as a regular non admin zulip user, I would want to be able to see the settings ( in a read only mode ) as some sort of an “advanced” type of access feature. My feeling is the drop down menu is way too cluttered as is and feels overwhelming as a normal new user.</p>",
        "id": 663659,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1542829577
    },
    {
        "content": "<p>Yeah, I think it would probably help to resort the \"organization settings\" panel to show the ones the user can edit (e.g. \"User groups\" and possible \"custom emoji\" in some sort of highlighted fashion)</p>",
        "id": 664544,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1543279955
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"5837\">@Armaan Ahluwalia</span> want to open an issue for that concept?  I don't think it'll make sense to hide that data.</p>",
        "id": 664545,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1543279975
    },
    {
        "content": "<p>Opened as <a href=\"https://github.com/zulip/zulip/pull/10893\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/10893\">#10893</a></p>",
        "id": 664641,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1543312450
    }
]