[
    {
        "content": "<p>The <strong>Bots</strong> and <strong>Invitations</strong> tabs in <strong>Organization settings</strong> display a banner for non-admins that says: \"Only organization administrators can edit these settings.\" However, it's not really clear what settings that banner is referring to -- there are no settings displayed.</p>\n<p>Should we just remove those banners? Is there anything else we feel the need to inform the user about there?</p>",
        "id": 1266575,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1634189365
    },
    {
        "content": "<p>My vote is to remove them, obviously.  As an aside, I think all those banners related to non-orgs not being able to change things could be more attractive.</p>",
        "id": 1266618,
        "sender_full_name": "Steve Howell",
        "timestamp": 1634206280
    },
    {
        "content": "<p>Yeah, those just seem like a bug.</p>\n<p>There's already a more-relevant banner below each of those: like \"Anyone in this organization can add bots.\"</p>",
        "id": 1266728,
        "sender_full_name": "Greg Price",
        "timestamp": 1634236851
    },
    {
        "content": "<p>Cool, filed <a href=\"https://github.com/zulip/zulip/pull/19967\">#19967</a>.</p>",
        "id": 1266765,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1634241422
    },
    {
        "content": "<p>For the \"Invitations\" tab, do non-administrators see anything at all on that page?  I guess I'd expect them to see the invitations that they themselves sent, but not any others.</p>",
        "id": 1266792,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1634243604
    },
    {
        "content": "<p>(It's possible we should add an alternative banner on that page for non-administrators that just explains this shows the invitations that you've sent).</p>",
        "id": 1266794,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1634243633
    },
    {
        "content": "<p>I guess we should possibly make the Invites page for non-admins and non-owners show up under Personal Settings since it's really just a list of my <strong>own</strong> bots (presumably) if I am a regular member.  Perhaps the same applies to bots?</p>",
        "id": 1266804,
        "sender_full_name": "Steve Howell",
        "timestamp": 1634246429
    },
    {
        "content": "<p>Part of the confusion here, I guess, is that some of the list widgets under the two settings UIs (uploaded files, invites, bots) aren't precisely settings.</p>",
        "id": 1266805,
        "sender_full_name": "Steve Howell",
        "timestamp": 1634246558
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/settings.20banners/near/1266792\">said</a>:</p>\n<blockquote>\n<p>For the \"Invitations\" tab, do non-administrators see anything at all on that page?  I guess I'd expect them to see the invitations that they themselves sent, but not any others.</p>\n</blockquote>\n<p>They already see: \"Members can only view or manage invitations that you yourself sent.\"</p>",
        "id": 1266806,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1634246563
    },
    {
        "content": "<p>(Could be worded better, but it should get the message across...)</p>",
        "id": 1266807,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1634246597
    },
    {
        "content": "<p>These banners also create confusion if shown for the users even if they have permission to edit the settings. This was discussed here in this <a href=\"https://github.com/zulip/zulip/pull/18691#discussion_r645046042\">PR thread</a>.<br>\nWe also got a report here in <a class=\"stream-topic\" data-stream-id=\"138\" href=\"/#narrow/stream/138-user-community/topic/Register.20Bot\">#user community &gt; Register Bot</a> where user was confused due to the banner.</p>\n<p>I think we should only show the banners if the user is not allowed to edit settings. They can get the information of which roles can edit these settings from the permissions section anyway. Thoughts?</p>",
        "id": 1281792,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1636996884
    },
    {
        "content": "<p>The other option is to have the text include \"Organization administrators like you\" if you have the ability to do it.  It's kinda nice to have it be clear which other users have the permission to do something -- or at least that was the motivation for the current arrangement.  It's possible that now that we have a lot more documentation, it's easy to check that via Google or \"Organization permissions\", and that's no longer a priority.</p>",
        "id": 1282014,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1637010323
    },
    {
        "content": "<p>I very much agree with <span class=\"user-mention silent\" data-user-id=\"10242\">Sahil Batra</span> -- we should consistently apply this rule:</p>\n<blockquote>\n<p>I think we should only show the banners if the user is not allowed to edit settings. </p>\n</blockquote>\n<p>If you just generally want to look up who has permissions to do what, that's what the \"Organization permissions\" tab is for.</p>",
        "id": 1282151,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1637020850
    }
]