[
    {
        "content": "<p>Somebody just filed <a href=\"https://github.com/zulip/zulip/pull/10476\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/10476\">#10476</a>, \"Show me in the list of users.\"  This is probably a duplicate of an ancient issue, but I couldn't find it.</p>",
        "id": 641987,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536344211
    },
    {
        "content": "<p>I've always been torn on whether it's a good idea that we don't show \"me\" in the buddy list.  The logic, of course, is that I already know I'm logged in, so no need to waste space showing me.</p>",
        "id": 641989,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536344257
    },
    {
        "content": "<p>But it's also confusing for new users.</p>",
        "id": 641990,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536344263
    },
    {
        "content": "<p>For a long time we never addressed this, because we were kind of waiting for user profiles to get finished.  \"Once we have user profiles,\" some of the conversation went, \"then we'll have a little widget to edit your profile.\"</p>",
        "id": 641992,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536344324
    },
    {
        "content": "<p>Similar conversations went along the lines of \"let's wait till we redesign the title bar.\"</p>",
        "id": 641993,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536344354
    },
    {
        "content": "<p>Anyway, it's been several months since I've seen dialog on this, so bringing it up for discussion.</p>",
        "id": 641994,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536344381
    },
    {
        "content": "<p>So I was a bit confused by this when I did my initial zulip setup. I kinda expected to see myself listed when I initialized the server. It hasn't bothered me since. As  user profiles become richer (custom fields, different avatar sources) it might be good to so that users can check what others see about them.</p>",
        "id": 641995,
        "sender_full_name": "Scott Russell",
        "timestamp": 1536344664
    },
    {
        "content": "<p>If it's decided to show yourself in the user list, would it be marked differently?</p>",
        "id": 641997,
        "sender_full_name": "Scott Russell",
        "timestamp": 1536344978
    },
    {
        "content": "<p>Maybe.  In very early versions of Zulip we'd put the current user at the top of the buddy list, but I don't think there was any special styling.</p>",
        "id": 641998,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536346127
    },
    {
        "content": "<p>Part of the reason the current approach has had so much inertia is that there are like 5 different things we could do here, and none of them are such significant upgrades from the status quo that we feel great urgency to make a change.</p>",
        "id": 641999,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536346196
    },
    {
        "content": "<p>I think it’s a good idea as both a sanity check of your visibility to others as well as point of access for the menu options such as view all messages sent etc</p>",
        "id": 642004,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1536347362
    },
    {
        "content": "<p>/poll</p>",
        "id": 642137,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536409647
    },
    {
        "content": "<p>I just submitted <a href=\"https://github.com/zulip/zulip/pull/10487\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/10487\">#10487</a> for the basic solution here (just include me in the buddy list, in the first line).</p>",
        "id": 642153,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536416024
    },
    {
        "content": "<p>I don't like the idea of <em>me</em> at the top. i know I'm online. I would just suggest sorting my name with the rest of the user list. That includes my status circle, my full name, and some indicator (formating, icon, or just a <em>(me)</em> text suffix) that it's me.</p>",
        "id": 642462,
        "sender_full_name": "Scott Russell",
        "timestamp": 1536590710
    },
    {
        "content": "<p>Thanks for the feedback, <span class=\"user-mention\" data-user-id=\"5233\">@Scott Russell</span>.  Our poll is 9-1 to add \"me\", so we're probably gonna at least try it out here.  I think it will be interesting to get another round of feedback once we deploy it.</p>",
        "id": 642464,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536591910
    },
    {
        "content": "<p>I agree with Scott that I was voting for having it alphabetically in the buddy list, not on the first line. If we're going to put it on the first line I think adding it to the gear-menu area makes more sense.</p>",
        "id": 642473,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1536595842
    },
    {
        "content": "<p>Ok.  The commit to put you at the top of the list is separate, so it's easy to experiment with both versions.</p>\n<p>I'm mostly anti-gear-menu now, because I believe that it's good to have the same options for you as others when it comes to seeing your or their profile, seeing messages you or they sent, sending a message to yourself or them, etc.</p>",
        "id": 642483,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536596701
    },
    {
        "content": "<p>Having my name listed in the buddy list will be a confusing thing for me, especially because we don't enforce unique display names per realm.  As someone who is using Zulip for quite sometime I feel I will be tricked into thinking that there is some other person with same name. For a new user it will be not be a problem but for existing users it will be likely confusing.<br>\nFor me, replacing gear icon with avatar makes most sense. Regarding having same options for yourself as others, I think we can simulate this by opening user popover when someone clicks on the avatar and opening the gear menu by the chevron.<br>\nOther option would be to have a hotspot explaining that this list displays <strong>other people</strong> who are online.</p>",
        "id": 642495,
        "sender_full_name": "Harshit Bansal",
        "timestamp": 1536598252
    },
    {
        "content": "<p>I'm anti-gear menu because when I see my profile picture as a menu, I expect all items in the menu to be related to personal settings of my profile and experience. For profile picture as a menu it would make more sense to put it next to the gear menu and move the personal config items out of the gear menu and under the profile picture. </p>\n<p>That's a whole different UX experience though than what zulip currently has.</p>",
        "id": 642496,
        "sender_full_name": "Scott Russell",
        "timestamp": 1536598373
    },
    {
        "content": "<blockquote>\n<p>Having my name listed in the buddy list will be a confusing thing for me, especially because we don't enforce unique display names per realm.  As someone who is using Zulip for quite sometime I feel I will be tricked into thinking that there is some other person with same name. For a new user it will be not be a problem but for existing users it will be likely confusing.</p>\n</blockquote>\n<p>I think you'll be surprised how quickly you adjust to always having your name at the top, and it will actually reduce confusion.</p>\n<p>We'll find out for sure once we deploy this--I could be wrong.</p>",
        "id": 642498,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536598560
    },
    {
        "content": "<blockquote>\n<p>I think you'll be surprised how quickly you adjust to always having your name at the top, and it will actually reduce confusion.</p>\n</blockquote>\n<p>Having my name on the top will be fine but having it sorted with others in the list will be pretty confusing.</p>",
        "id": 642500,
        "sender_full_name": "Harshit Bansal",
        "timestamp": 1536598655
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>I think you'll be surprised how quickly you adjust to always having your name at the top, and it will actually reduce confusion.</p>\n</blockquote>\n<p>Having my name on the top will be fine but having it sorted with others in the list will be pretty confusing.</p>\n</blockquote>\n<p>Ah, I took your post slightly out of context--thanks for clarifying.  Yeah, I think leaving your name in alpha order is bad for two reasons--not only do people have similar names, but people with names toward the end of the alphabet probably still want their name on the screen.</p>",
        "id": 642501,
        "sender_full_name": "Steve Howell",
        "timestamp": 1536598864
    },
    {
        "content": "<p>I see, I agree that having name in alpha order will be a confusing migration for existing Zulip users. </p>\n<p>Our original design for this was indeed to have 2 \"gear menus\": one with your profile picture with personal settings, and a gear menu with non-personal settings.</p>",
        "id": 642508,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1536599398
    },
    {
        "content": "<p>Interesting :)</p>",
        "id": 642510,
        "sender_full_name": "Scott Russell",
        "timestamp": 1536600991
    }
]