[
    {
        "content": "<p>For the left sidebar: Would it be easy to show unread streams that are out of view at the top or bottom of the streams view? E.g. say my streams are</p>\n<div class=\"codehilite\"><pre><span></span>A [3]\nB\n-- visible part starts\nC\nD\nE\n-- visible part ends\nF [2]\nG\n</pre></div>\n\n\n<p>Instead of showing C, D, E, it would show A, C, F. (And then as you scrolled, you would get (A, D, F), then (A, E, F), then (A, F, G).)</p>\n<p>One benefit I think would be it would allow us to loosen the density of the left sidebar, since it wouldn't be as important to show so many streams.</p>",
        "id": 340506,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1511631871
    },
    {
        "content": "<p>I don't understand what you're suggesting.</p>",
        "id": 340513,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1511632655
    },
    {
        "content": "<p>Let's say you have 50 streams, and you can see 30 on your screen.<br>\nCurrently we show a contiguous subset of them, i.e. \"stream i\" to \"stream i+29\".<br>\nThe proposal is to show \"All the streams &lt; i with unreads\", followed by \"stream i to stream j\", followed by \"all the streams &gt; j with unreads\".</p>\n<p>The premise is that streams with unreads are much more important to a user than the other streams. E.g., that</p>\n<ul>\n<li>Most of the scrolling up and down that people do is to find the stream with the unread count, when the Home unread count increases. </li>\n<li>Much of the motivation for having a dense left sidebar is to increase the chance that you can see all your streams with unread counts</li>\n</ul>\n<p>Does that make sense?</p>",
        "id": 340522,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1511633377
    },
    {
        "content": "<p>I think one also scrolls around looking for a specific stream that you want to send something to.  But I guess I'm confused as to why your proposal here is not just \"sort all the streams with unreads at the top\" if you're trying to solve that problem.</p>",
        "id": 340525,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1511633535
    },
    {
        "content": "<p>There might be some difference between people that use Zulip mostly from Home vs mostly from the left sidebar? My ideal for composing would be <code>q</code> + a shortcut that narrows to what is in the compose box. Whereas for reading, I sort of want to know which stream it is before hitting <code>n</code>.</p>\n<p>Sort all streams with unreads at the top could also be reasonable, though then you pinned and non-pinned streams mixing.</p>",
        "id": 340545,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1511636575
    },
    {
        "content": "<p>I think a \"quick menu\" is the best solution here.</p>",
        "id": 340899,
        "sender_full_name": "Steve Howell",
        "timestamp": 1511665410
    },
    {
        "content": "<p>What do you mean by quick menu?</p>",
        "id": 343566,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1511847964
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"rishig@zulipchat.com\" data-user-id=\"131\">@Rishi Gupta</span> By \"quick menu\" I also mean \"jump menu\", which is a menu for doing the most \"likely\" task.  I think the ideal \"jump menu\" has 5 really likely options (e.g. \"create new topic\", \"jump to next unread topic\") and then you maybe hit one more keystroke for the next 20 most likely things you'd do.</p>",
        "id": 343606,
        "sender_full_name": "Steve Howell",
        "timestamp": 1511849909
    },
    {
        "content": "<p>The \"quick menu\" would have a little a bit of contextual smarts to figure out your most likely next option, but it wouldn't have to be super smart...v1 could simply contain the 5 most likely things you'd do in most circumstances.</p>",
        "id": 343621,
        "sender_full_name": "Steve Howell",
        "timestamp": 1511850001
    },
    {
        "content": "<p>(It would be a popover menu that you'd invoke with something like control-q or control-j.)</p>",
        "id": 343629,
        "sender_full_name": "Steve Howell",
        "timestamp": 1511850068
    },
    {
        "content": "<p>I see, I think what I really want here is the ability to see at a glance where the unreads are, which allows me to make a decision whether to catch up or not. I think that's also the main reason why I care to have a dense left sidebar.</p>",
        "id": 343674,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1511851088
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"rishig@zulipchat.com\" data-user-id=\"131\">@Rishi Gupta</span> I'm 100% in favor of a bold re-design of the sidebar.  There are some tricky UI constraints, but I think the ultimate answer is some kind of tabbed interface, or something similar, that allows multiple views of streams.  I'm mostly ok with the current view, especially with the \"n\" hotkey, but I'm only one user, and I think there's room for innovation/improvement.</p>",
        "id": 343693,
        "sender_full_name": "Steve Howell",
        "timestamp": 1511851547
    },
    {
        "content": "<p>interesting! yeah, I guess I'm fine with the idea that we should do a bold redesign at some point, and that the current thing is good enough for the near future, especially since it doesn't affect new users.</p>",
        "id": 343697,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1511851727
    },
    {
        "content": "<p>Here is Slack's version, which I think we could carry to the next level:</p>\n<p><a href=\"/user_uploads/2/33/UrSBGYKGgcyAOSHTev_wsxtW/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/33/UrSBGYKGgcyAOSHTev_wsxtW/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/2/33/UrSBGYKGgcyAOSHTev_wsxtW/pasted_image.png\"></a></div>",
        "id": 345182,
        "sender_full_name": "Steve Howell",
        "timestamp": 1511899662
    },
    {
        "content": "<p>Their quick-jump menu has a little icon in their sidebar, and its hotkey is control-K.</p>",
        "id": 345185,
        "sender_full_name": "Steve Howell",
        "timestamp": 1511899707
    }
]