[
    {
        "content": "<p>With some of the improved zulip-terminal (ZT) UI changes recently, particularly already with the just-merged improved autohide layout, I'm thinking we could adjust (widen) the left and right panel widths.<br>\nFor those not familiar with the terminal application, we broadly match the web/desktop design, so I'm referring to the stream/topic-list and user-list areas. Initially we went with a minimal fit of common stream text lengths (on czo), however with the extra space we now have there is a possibility of allowing space for more topic visibility, or user lengths.<br>\nIs there a guide on how much to include, other than the amount in the web app? (which doesn't match exactly of course, as we have a fixed width font)<br>\nOther than a fixed length, we could try dynamic approaches such as adjusting this per account/server based on including lengths of a certain number of subscribed streams, within some minimum/maximum - too much space can look bad too! More space for topics is a double-edged sword of course, and at least for now we'd keep the same width for streams and topics.</p>",
        "id": 1243140,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1628016020
    },
    {
        "content": "<p>I regularly have the feeling that it'd be nice if another word or so of each topic was visible in the left sidebar.</p>\n<p>The trade-off there is that it makes the sidebar wider -- which consumes precious horizontal space if you're on a laptop screen and trying to fit a chat window on one side and some code, or a terminal, or a web page you're consulting, etc., on the other.</p>\n<p>And it's good for the width to be pretty consistent between different clients (to the extent possible given things like fixed-width vs. variable-width fonts), because that keeps expectations aligned between the person writing a message (and in particular starting a new topic) and the people reading it.</p>",
        "id": 1244016,
        "sender_full_name": "Greg Price",
        "timestamp": 1628124714
    },
    {
        "content": "<p>FWIW, I have a pretty small laptop, and I still have lots of extra space on the left and right sides of the screen. It would be nice if we could let the sidebars expand into that space, while allowing them to be smaller on small screens, although I'm not sure how much work that'd be. If it's tricky, I'm definitely in favor of just bumping up the size of the sidebars a little bit.</p>",
        "id": 1249999,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1630012495
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"17945\">Wesley Aptekar-Cassels</span> <a href=\"#narrow/stream/101-design/topic/Side.20panel.20widths/near/1249999\">said</a>:</p>\n<blockquote>\n<p>FWIW, I have a pretty small laptop, and I still have lots of extra space on the left and right sides of the screen.</p>\n</blockquote>\n<p>Are you giving the browser the whole width of the screen? If so, then that's what I'd expect.</p>\n<p>But I have a laptop with a 15\" screen (which I think puts it at the large end of the typical range), and if I want both sidebars to fit I have to give the Zulip window more than half the screen. That makes it already somewhat crowded if I'm trying to fit other information on the screen alongside a conversation.</p>",
        "id": 1250607,
        "sender_full_name": "Greg Price",
        "timestamp": 1630274619
    },
    {
        "content": "<p>Yeah, I was talking about full width, which is what I almost always use. Another good usecase for client-side telemetry would be collecting stats about viewport resolution and size :)</p>",
        "id": 1250768,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1630359890
    },
    {
        "content": "<p>True!</p>",
        "id": 1250795,
        "sender_full_name": "Greg Price",
        "timestamp": 1630361256
    },
    {
        "content": "<p>One design challenge with arbitrarily wide sidebars is for situations where folks are using relatively short topics, it increases the space between the topic and the unread count, which can end up looking ugly.  For example, the top-left region (which has relatively short labels) has quite a bit of whitespace between labels and unread counts, and that might look ugly if we made the sidebars 10 characters wider.</p>\n<p>It's also worth noting that increasing our font size will force us to make sidebars substantially larger in pixels for the same number of visible characters today.  I don't know what the best solution is here, but probably the best answer will involve making this something users can control (maybe it should just be draggable or something).</p>",
        "id": 1256412,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1631835356
    },
    {
        "content": "<p>I definitely noticed the challenge of the left bar being at least \"disconnected\" between the names and unreads, when this was being heavily experimented upon over the Summer (in zulip-terminal).</p>",
        "id": 1256486,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1631847118
    }
]