[
    {
        "content": "<p>This seems like a good group discussion topic. We're adding support for silent mentions, basically for use cases where you want to mention someone but not trigger a notification.  The question is what syntax to use (see <a href=\"https://github.com/zulip/zulip/pull/11166#issuecomment-452997687\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/11166#issuecomment-452997687\">https://github.com/zulip/zulip/pull/11166#issuecomment-452997687</a>).  The bottom two are the currently suggested options:</p>\n<div class=\"codehilite\"><pre><span></span>@**Iago**\n@**Iago|123**\n.@**Iago**\n@.**Iago**\n@_**Iago**\n_@**Iago**\n</pre></div>\n\n\n<p>(This feature would be used internally in the implementation for not mentioning users when messages they sent are quoted, but also is useful for applications like the notification-bot explaining who created or renamed a stream).</p>",
        "id": 681170,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1547246290
    },
    {
        "content": "<p>But any feedback/thoughts on what feels most natural to you would be appreciated.</p>",
        "id": 681171,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1547246318
    },
    {
        "content": "<p>A dot prefix seems appropriate here.  Of the options I like the last one.</p>",
        "id": 681173,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547246788
    },
    {
        "content": "<p>Added dot to the list of options, conveniently not at the end to avoid making your message confusing.  I think I like how underscore looks visually better.</p>",
        "id": 681174,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1547249646
    },
    {
        "content": "<p>I think a UI toggle within the mentions box might be more appropriate. Would be difficult to discover this functionality and would also cover the case for people who are not shortcut friendly. Maybe a little bell within the mention box?</p>",
        "id": 681340,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1547279789
    },
    {
        "content": "<p>As for the shortcut I like the dot syntax as well</p>",
        "id": 681341,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1547279844
    },
    {
        "content": "<p>Another alternative I can think of is three stars around the username</p>",
        "id": 681342,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1547279905
    },
    {
        "content": "<p>Or @*</p>",
        "id": 681343,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1547279921
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"5837\">@Armaan Ahluwalia</span> by \"bell within the mention box\", I assume you're talking about styling for displaying them?  I suppose we could do that, but I think most of the time it's going to be of little interest, so at most we'd just show the data in the popover you get when you click on the mention.</p>",
        "id": 681577,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1547435629
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> I meant as a toggle button within the compose box ( because I forgot we don’t render the actual mention box while composing ) I was envisioning a box with the users name in the compose area and a little icon to toggle silent mentions but it seems like a lot of work to change the way we render composing and plain text seems better for copying and pasting as well as training the user.</p>",
        "id": 681627,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1547447666
    }
]