[
    {
        "content": "<p>We could obviously extend the capability of slash commands.  We don't have a great customer feedback loop on this.  I know that I personally use \"/me\" (albeit mostly for silly reasons), \"/poll\" (for fairly practical reasons), and \"/day\" and \"/night\" (but often for dev-related reasons).</p>",
        "id": 1019517,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600383703
    },
    {
        "content": "<p>Out typeahead support has gotten more complete since March of last year: <a href=\"https://github.com/zulip/zulip/blob/master/static/js/composebox_typeahead.js#L356\">https://github.com/zulip/zulip/blob/master/static/js/composebox_typeahead.js#L356</a></p>\n<p>For example, we now support \"/fluid-width\" and \"/fixed-width\" in the typeahead.  It should be a pretty easy PR to add \"/settings\" to the typeahead.</p>",
        "id": 1019520,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600383830
    },
    {
        "content": "<p>It's a little unfortunate that \"/me\" and \"/poll\" are no longer in the top five options, since I think they are probably two of the more popular commands.  And we only show 5 things in the typeahead, which is a bit of a pet peeve of mine (especially when completing common names like \"Tim\").</p>",
        "id": 1019522,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600383925
    },
    {
        "content": "<p>I don't feel too strongly here.  I feel like most of the slash commands are relatively easy to build and maintain, but they also have fairly low upside in terms of exciting customers.</p>",
        "id": 1019523,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600383977
    },
    {
        "content": "<p>I suspect I have less customer interaction so can't comment with as much context, but other platforms certainly seem to run with these ideas, whether it's coming from IRC or where maybe even integrations are managed that way? I know we discussed this when Rhea was working on this, but I've not looked at it since.</p>",
        "id": 1019527,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600384224
    },
    {
        "content": "<p>Yeah there may be more upside here than I realize.  I certainly wouldn’t push back too hard on somebody doing more exploration here.</p>",
        "id": 1019528,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600384406
    },
    {
        "content": "<p>I know there's an ease of use aspect here, but I'd also personally prefer more namespacing of them too - while <code>/dark</code> and friends are zcommands and so could be completely different in a different client in any case, in ZT I imagine we'd choose <code>/theme &lt;name&gt;</code>. Perhaps similarly for the width commands.</p>",
        "id": 1019551,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600384915
    },
    {
        "content": "<p>The “framework” is in place to add slash commands.  And I put framework in quotes, because it’s basically not much code at all.</p>\n<p>There are probably some ambitious things we can do related to integrations that might require some non-trivial infrastructure or custom code, but for things that are basically UI shortcuts, patches should be about 15-30 lines including tests.</p>",
        "id": 1019555,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600385087
    },
    {
        "content": "<p>I understand your concern about namespacing, but I would tend to be more aggressive about shortcuts.</p>",
        "id": 1019563,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600385316
    },
    {
        "content": "<p>It might just be similar to your point about showing only 5 things in typeahead, so showing 'category' commands (<code>/theme</code>) vs individual command (4x as many) would alleviate that. Of course, there's then a concern over how/whether to autocomplete the parameters, but <code>/theme</code> could give a message listing available options, for example. That said, I'm familiar how important dark mode is these days ;)</p>",
        "id": 1019589,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600386241
    },
    {
        "content": "<p>We could also have redundancy to some extent.  So namespace theme and put it in the top 5 but also support dark.</p>",
        "id": 1019599,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600386532
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2406\">Neil Pilgrim</span> <a href=\"#narrow/stream/137-feedback/topic/.2Fnick.20command/near/1019515\">said</a>:</p>\n<blockquote>\n<p>Parameters to it appear to be ignored right now, but this could allow <code>/settings fullname My New Name</code>, for example. I understand that's again on the edge of making name-changing too easy.</p>\n</blockquote>\n<p>That version sounds great to me, actually. I share the concerns about <code>/nick</code> potentially encouraging a cultural norm of \"nickname\" identifiers -- particularly for people coming from IRC. But I think <code>/settings fullname My New Name</code> should avoid that problem pretty well.</p>",
        "id": 1020197,
        "sender_full_name": "Greg Price",
        "timestamp": 1600454562
    },
    {
        "content": "<p>I'm not sure how nice <code>/settings</code> would be as a slash command; do we have settings other than a name that we imagine folks would use?</p>",
        "id": 1020205,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1600454907
    },
    {
        "content": "<p>Day/night mode and width settings already have dedicated commands</p>",
        "id": 1020236,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600455660
    },
    {
        "content": "<p>I can’t think of common use cases.</p>",
        "id": 1020240,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600455760
    },
    {
        "content": "<p>Time zone, maybe. Also I'd include dark mode / light mode, if we were to add a general <code>/settings</code> command, even though there's already shortcut versions.</p>",
        "id": 1020253,
        "sender_full_name": "Greg Price",
        "timestamp": 1600456872
    },
    {
        "content": "<p>I just took a quick look through the settings screen, and don't see many other candidates.</p>",
        "id": 1020254,
        "sender_full_name": "Greg Price",
        "timestamp": 1600456921
    },
    {
        "content": "<p>I already posted a minor PR for adding <code>/settings</code> to typeahead (<a href=\"https://github.com/zulip/zulip/pull/16375\">#16375</a>), and posted in <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/.2Ftheme.20vs.20dark.2Flight.2Fnight.2Fday\">#design &gt; /theme vs dark/light/night/day</a> about a working WIP commit for namespacing the dark/light aspect into eg. <code>/theme dark</code>, which fits in with the ideas here perhaps?</p>",
        "id": 1020377,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600469215
    },
    {
        "content": "<p>It's worth noting that we support both \"/day\" and \"/light\", as well as \"/dark\" and \"/night\".</p>",
        "id": 1020378,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600469455
    },
    {
        "content": "<p>They all work with <code>/theme</code> with that commit. If using that approach, the question would be whether to have that as the base to point people at (with typeahead) and have the other slash commands still work but not shown in typeahead, though possibly still hinted when used?</p>",
        "id": 1020385,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600469861
    },
    {
        "content": "<p>If I wanted day mode, I would expect \"/day\" to be the command, so we should keep it in typeahead.  But maybe we would have \"/theme\" be in the top 5 with things like \"/me\" and \"/poll\" and \"/settings\", and you would only see day/dark/light/night if you typed d/d/l/n.</p>",
        "id": 1020392,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600470104
    },
    {
        "content": "<p>I'm still pretty ambivalent about the need for \"/theme\", to be honest.  It doesn't really add any new functionality, and it seems harder to guess in a way.</p>",
        "id": 1020396,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600470147
    },
    {
        "content": "<p>Re <code>/settings</code>, it comes down to levels of nesting? Really <code>/settings theme dark</code> == <code>/theme dark</code> == <code>/dark</code>? Perhaps everything could be in <code>/settings ...</code> in some hypothetical complete slash-command implementation, with the others being default but customizable shortcuts at an organization or user level, allowing freeing up the root namespace for specific needs.</p>",
        "id": 1020416,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600472430
    },
    {
        "content": "<p>I'm not suggesting this, unless that sounds like a nice way to expose and describe settings ;)</p>",
        "id": 1020421,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600472609
    },
    {
        "content": "<p>I don't think the root namespace is ever gonna get that crowded, which is why I prefer short commands like \"/day\".</p>",
        "id": 1020429,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600472803
    },
    {
        "content": "<p>But I would like this series of commits:</p>\n<ul>\n<li>make sure poll, me, settings, are in the top five</li>\n<li>add theme dark, theme light, etc., putting theme in top five</li>\n<li>consider bumping 5 to 8 just for slash commands (which only tab-complete at the beginning, so not quite as ugly)</li>\n</ul>\n<p>And don't remove day/night/dark from tab-complete.  (This is more or less what I said a few messages ago, but slightly more of a proposed \"plan\".)</p>",
        "id": 1020430,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600472994
    },
    {
        "content": "<p>I suppose one tricky thing with a nested command like \"theme\" is that you'll want to only have one item in the tab complete until somebody types \"th\" or something.  Although maybe that's unnecessary, as long as \"theme\" doesn't crowd out me/poll/settings/etc.</p>",
        "id": 1020432,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600473084
    },
    {
        "content": "<p>Is it reasonable to achieve the first by simply hand-sorting the slash-commands, ie. avoiding the auto-sort we do? A test of that looks to work OK.<br>\nAdding theme (or maybe as a different name, based on existing descriptions?) next makes sense, but if leaving at 5, then the remaining typeaheads are all grouped (width, color-modes/themes) so the extra one will be strange.<br>\nHowever, we could add todo to typeaheads and put that in, if it's considered polished enough? tictactoe seems a little broken and toylike, and I'm not sure trivia/zform is there yet either.<br>\nAlternatively, we could group the width commands?<br>\nIt strikes me that we don't have a discovery mechanism for slash commands, but perhaps we could add a tip to them to use <code>/slash</code> or similar, to list them all (in typeaheads, most likely), it not being in typeaheads?</p>",
        "id": 1020508,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600477237
    },
    {
        "content": "<p>Re naming 'theme', we currently use \"color scheme\" and day/night/light/dark \"mode\". Those other options seem to suggest less-concise 2-word solutions, so perhaps we should stick to theme, if we go ahead with this.</p>",
        "id": 1020511,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600477758
    },
    {
        "content": "<p>I’m still negative on the entire concept of slash commands, for the simple reason that they have no business being messages that you compose in the compose box. It’s illogical from a UI perspective, and it means that the failure mode of typos, or of commands supported in some server versions but not others, is immediate public embarrassment (I expect we’ll learn this the hard way as soon as someone sends “/setings password hunter2” to #general).</p>",
        "id": 1020522,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1600485032
    },
    {
        "content": "<p>What if we update that to send an error on any unsupported slash command? Wouldn't that be fairly simple?</p>",
        "id": 1020533,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600491377
    },
    {
        "content": "<p>I do agree that it is sort of shoe-horning a terminal-like interface into a box to compose messages, and it's not as clean a match as with eg. IRC. There are alternatives I can imagine, like switching the compose box into \"command mode\" or similar with a more complex command, but... that's ultimately what a leading <code>/</code> does.</p>",
        "id": 1020535,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600491806
    },
    {
        "content": "<blockquote>\n<p>What if we update that to send an error on any unsupported slash command?</p>\n</blockquote>\n<p>But then you can’t send an actual message starting with a slash.</p>\n<blockquote>\n<p>that's ultimately what a leading / does.</p>\n</blockquote>\n<p>It’s not though. This all started with <code>/me</code>, but <code>/me</code> is a message formatting directive, not a command. It’s not even a command in IRC.</p>",
        "id": 1020540,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1600492915
    },
    {
        "content": "<p>Are you arguing there are three categories of compose-box uses, to distinguish <code>/me</code> and something that doesn't generate a message but is a slash-command?</p>",
        "id": 1020563,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600495118
    },
    {
        "content": "<p>Re wanting to start regular messages with a slash: this server is only representative of one community, which of course has varied over time, but I'd be interested to see statistics on the number of messages starting with slashes that weren't mistyped slash-commands. I can imagine file paths being an issue - but if typing a message then I'd think it could sit within the message not right at the start and quoting would fix it anyhow. Pasting without quotes is the only issue I can see. Admittedly slash-command conflicts might filter some uses at the UI level, but that's a \"don't use slash commands\" argument, rather than \"check if a slash-command is valid\" one.</p>",
        "id": 1020564,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600495710
    },
    {
        "content": "<p><code>/me</code> is the same category as normal messages. </p>\n<p>Yes, the argument I’m making is indeed that we shouldn’t have slash commands, because they’re bad if you don’t validate them and bad if you do.</p>",
        "id": 1020565,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1600495914
    },
    {
        "content": "<p>If we want a command interface, we should <em>make a command interface</em>, not change the meaning of an existing non-command interface.</p>",
        "id": 1020566,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1600496059
    },
    {
        "content": "<p>That could make things tidy, but I'm not convinced, not yet at least. Want to break your first response onwards into a new topic?</p>",
        "id": 1020569,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600499812
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/.2Fnick.20command\">#feedback &gt; /nick command</a> by <span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell</span></p>",
        "id": 1020604,
        "sender_full_name": "Notification Bot",
        "timestamp": 1600518788
    },
    {
        "content": "<p>So I just moved the topic here, as you can see from the prior message.  I should really have named this topic \"slash interface\", or something similar, since \"slash commands\" is actually a misnomer for \"/me\", \"/poll\", and \"/todo\", as <span class=\"user-mention silent\" data-user-id=\"699\">Anders Kaseorg</span> pointed out.  I like his lingo that those three things are actually <strong>message formatting directives</strong>.</p>",
        "id": 1020608,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600518883
    },
    {
        "content": "<p>(I decided to name the topic \"slash commands\", just because I think folks are more likely to find it via search.)</p>",
        "id": 1020609,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600518923
    },
    {
        "content": "<p>Just to categorize the syntax we already have, here is the exhaustive list:</p>\n<ul>\n<li>formatting directives: /me, /poll, /todo</li>\n<li>UI shortcuts: /day, /light, /dark, /night, /settings, /fluid-width, /fixed-width, </li>\n<li>misc: /ping</li>\n</ul>\n<p>It's worth noting that we still don't tab-complete either /todo or /ping.  I put <strong>/ping</strong> under miscellaneous, because unlike the UI shortcuts, there is no other current mechanism to ping the server to get the round-trip time.  Whereas all the UI shortcuts are totally achievable by going into the settings menu.  Also, advanced users can get to settings with a couple keystrokes (esc/g/down/enter, roughly).</p>",
        "id": 1020612,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600519373
    },
    {
        "content": "<p><a href=\"https://zulip.readthedocs.io/en/latest/subsystems/widgets.html#simple-slash-commands\">https://zulip.readthedocs.io/en/latest/subsystems/widgets.html#simple-slash-commands</a> are relevant docs.  They're a bit out of date, but I think they're accurate still (if a bit incomplete).</p>",
        "id": 1020613,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600519622
    },
    {
        "content": "<p>I've been kind of wishy washy in this discussion, but if you put a gun to my head, I would basically agree with <span class=\"user-mention silent\" data-user-id=\"699\">Anders Kaseorg</span> here.  All of these functions would be better served by an actual <strong>command interface</strong>, to the extent that we need quick shortcuts for them:</p>\n<ul>\n<li>/day, /light, /dark, /night</li>\n<li>/fluid-width, /fixed-width</li>\n<li>/settings</li>\n<li>/ping</li>\n</ul>",
        "id": 1020614,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600520191
    },
    {
        "content": "<p>Seven of the eight things all literally answer the same problem--there's too much friction to get to common settings.</p>",
        "id": 1020615,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600520234
    },
    {
        "content": "<p>It's not even super clear to me that getting-to-settings-friction is a severe problem.</p>",
        "id": 1020616,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600520318
    },
    {
        "content": "<p>One of the reasons I've been wishy washy on actually opposing slash commands is that I think the current set of them are actually harmless.  The typo failure mode really only becomes an issue when slash commands become more powerful, as in the example of \"/setings password hunter2\".  I don't think anybody is gonna be embarrassed now by typing \"/dax\" or \"/nigxt\" or \"/fluxd-width\" by accident.</p>",
        "id": 1020617,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600520559
    },
    {
        "content": "<p>And even if we were to expand the power of slash commands, the simple remedy would be to warn users if they are sending malformed slash commands.  Basically, if a message starts with \"/\" in the client, we only send it to the server as message if it starts with /me or /poll or /todo.  (A user who is determined to say \"/etc/hosts needs to be updated\" could override.)</p>",
        "id": 1020618,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600520728
    },
    {
        "content": "<p>From here on out, unless I say otherwise, when I refer to slash commands, I am excluding the formatting directives (/me, /poll, /todo).</p>",
        "id": 1020619,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600520870
    },
    {
        "content": "<p>For historical perspective, the reason we built out slash commands in the first place was to keep up with Slack.  Slack has these: <a href=\"https://slack.com/help/articles/201259356-Use-built-in-slash-commands\">https://slack.com/help/articles/201259356-Use-built-in-slash-commands</a></p>",
        "id": 1020620,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600520900
    },
    {
        "content": "<p>Note that Slack is as nonrigorous as we have been in the past when it comes to distinguishing UI shortcuts from formatting directives.  Here is a sampling:</p>\n<ul>\n<li>message formatting: /me, /shrug</li>\n<li>IRC nostalgia: /invite, /join</li>\n<li>UI shortcuts: /away, /expand, /status</li>\n</ul>",
        "id": 1020621,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600521112
    },
    {
        "content": "<p>I wish I could find the article now, but back in ~2017 Slack did some great marketing hype where they were positioning Slack as sort of your workflow automation system.</p>",
        "id": 1020622,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600521285
    },
    {
        "content": "<p>I think they pitched something like you could basically do all your SalesForce tasks from Slack.  When your lead got a new comment, the integration would send a message to Slack saying \"ticket 99 has a comment: Mary get off the call, they are ready to purchase,\" and then you would do something slick directly from Slack like \"/update-ticket 99 high-priority\".</p>",
        "id": 1020624,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600521434
    },
    {
        "content": "<p>I was skeptical then, and I'm still skeptical now, that this type of automation with third party tools really makes sense.  I think it's almost always more logical to have integrations send a link to the actual third party app, like we do with our GitHub automation.  I think Slack just had enough engineers to build out some of these features, and it fed into their hype machine.</p>",
        "id": 1020625,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600521532
    },
    {
        "content": "<p>I don't know if any of this historical context should influence how we proceed now in 2020, given what our sunk costs are, but there you have it.</p>",
        "id": 1020626,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600521561
    },
    {
        "content": "<p>I guess one more important historical detail here is that Rishi wasn't merely responding to Slack hype.  I believe there were actual potential customers asking about slash commands, including potential customers who were considering leaving Slack.  I don't want to go too deep on that, though, because...</p>\n<ul>\n<li>all my info on customer desires was second hand</li>\n<li>my memory is fuzzy</li>\n<li>the competitive landscape now is probably different</li>\n</ul>",
        "id": 1020629,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600522109
    },
    {
        "content": "<p>I would be fine if the particular conversation about slash commands just kinda fizzles out, and then we decide to <strong>do nothing</strong> until we really have a compelling use case that is customer-driven, today, in 2020.</p>\n<p>There might be a more interesting broad conversation about how to make certain UI tasks easier to accomplish, but if we have that conversation, I hope we think more broadly about other solutions, such as dedicated command interfaces or better UI organization or a direct hotkey into display settings.</p>",
        "id": 1020631,
        "sender_full_name": "Steve Howell",
        "timestamp": 1600522386
    },
    {
        "content": "<p>As I hinted last night, I see the (perhaps blurry) distinction between the two types of \"commands\", but I'm not convinced it's worth making that move unless showing that difference is useful. Conceivably we could toggle into a 'command mode' (for those things not generating messages? in the current narrow?) via eg. <code>ctrl /</code> and not need the leading slashes (and avoid the possibility of posting messages) - but then things like <code>/me</code> will still be used in 'compose mode', which feels odd. Unless that kind of design becomes useful or clearer, I'm also inclined to stick with what we have - and independently of adding more dangerous/embarrassing commands, I think we can improve the interface.</p>",
        "id": 1020691,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1600533299
    },
    {
        "content": "<p>I sorta agree with Anders that it'd be better to have slash commands live in a separate namespace, at least for things in this settings space.  If you did some hotkey sequence (<code>alt+/</code> or something), we could pop up a modal for doing this sort of thing.</p>",
        "id": 1021952,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1600728560
    },
    {
        "content": "<p>(I think of /poll as a bit different, but ideally we'd end up with that becoming markdown syntax down the line)</p>",
        "id": 1021956,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1600728580
    },
    {
        "content": "<p>I opened <a href=\"https://github.com/zulip/zulip/pull/19081\">#19081</a> to distinguish between \"widgets\" and \"slash commands\" in the developer docs, and the criteria is roughly the one discussed here, so it'd be great of someone would take a look.</p>",
        "id": 1223595,
        "sender_full_name": "Abhijeet Bodas",
        "timestamp": 1625135567
    },
    {
        "content": "<p>Merged!  Thanks <span class=\"user-mention\" data-user-id=\"16839\">@Abhijeet Bodas</span></p>",
        "id": 1223601,
        "sender_full_name": "Steve Howell",
        "timestamp": 1625141236
    },
    {
        "content": "<p>Reviving this discussion, and thinking about next steps...</p>\n<p>Here are the slash commands we have (at least as of 2020-09-19):</p>\n<p><span class=\"user-mention silent\" data-user-id=\"58\">Steve Howell (showell)</span> <a href=\"#narrow/stream/101-design/topic/slash.20commands/near/1020612\">said</a>:</p>\n<blockquote>\n<p>Just to categorize the syntax we already have, here is the exhaustive list:</p>\n<ul>\n<li>formatting directives: /me, /poll, /todo</li>\n<li>UI shortcuts: /day, /light, /dark, /night, /settings, /fluid-width, /fixed-width, </li>\n<li>misc: /ping</li>\n</ul>\n<p>It's worth noting that we still don't tab-complete either /todo or /ping.  I put <strong>/ping</strong> under miscellaneous, because unlike the UI shortcuts, there is no other current mechanism to ping the server to get the round-trip time.  Whereas all the UI shortcuts are totally achievable by going into the settings menu.  Also, advanced users can get to settings with a couple keystrokes (esc/g/down/enter, roughly).</p>\n</blockquote>\n<p>What do folks think about simply removing the UI shortcut commands? Does anyone here actually make use of them and would feel sad if they disappeared?</p>\n<p>I think it would also be reasonable to implement <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> 's suggestion (quoted below), but I wonder if we can leave this as a later follow-up, if these commands are hardly being used in the first place.</p>\n<blockquote>\n<p>If you did some hotkey sequence (alt+/ or something), we could pop up a modal for doing this sort of thing.</p>\n</blockquote>",
        "id": 1228003,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1625773976
    },
    {
        "content": "<p>I use the <code>/night</code> / <code>/day</code> slash commands often to try to avoid theme-dependant UI bugs in the development environment without going through 5 clicks via settings.  I think that's a problem that could be solved other ways, but I would want to solve it.</p>",
        "id": 1228043,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1625777748
    },
    {
        "content": "<p>Hmm, that seems very specific to Zulip development, yeah. I suppose we could have keyboard shortcuts if we think it's important.</p>",
        "id": 1228048,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1625777896
    },
    {
        "content": "<p>The idea I was thinking about is a button for toggling the theme just for this session that could live in some corner, maybe next to the keyboard shortcuts button.</p>",
        "id": 1228055,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1625778160
    },
    {
        "content": "<p>And that could be a normal feature or a development-only feature depending on whether we think users would want that.</p>",
        "id": 1228056,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1625778178
    },
    {
        "content": "<p>Yeah, perhaps just for development, unless users tell us that they switch back and forth often.</p>",
        "id": 1228077,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1625779880
    },
    {
        "content": "<p>wouldn't you want said button to be 3 states? (light, dark, and system?)</p>",
        "id": 1228087,
        "sender_full_name": "Ken Clary",
        "timestamp": 1625780970
    },
    {
        "content": "<p>how about we keep the commands but just don't have them appear in typeahead?</p>",
        "id": 1228092,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1625781576
    },
    {
        "content": "<p>that seems like the easiest solution</p>",
        "id": 1228093,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1625781586
    },
    {
        "content": "<p>That does make them pretty invisible, and I suppose it's not that likely that someone would try to send a message with the contents <code>/night</code> and get a weird surprise.</p>",
        "id": 1228099,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1625781811
    },
    {
        "content": "<p>(By the way, the notification pop-up you see when you use the night/day commands has messed up alignment, so one definitely gets a janky experience right now by actually using them.)</p>",
        "id": 1228101,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1625781887
    },
    {
        "content": "<blockquote>\n<p>That does make them pretty invisible, and I suppose it's not that likely that someone would try to send a message with the contents /night and get a weird surprise.</p>\n</blockquote>\n<p>I'd expect that to be a typo rather than intentional. A <em>hilarious</em> one.</p>",
        "id": 1228118,
        "sender_full_name": "Ken Clary",
        "timestamp": 1625782808
    },
    {
        "content": "<p>(they probably meant to type <code>'night</code>)</p>",
        "id": 1228119,
        "sender_full_name": "Ken Clary",
        "timestamp": 1625782848
    },
    {
        "content": "<p>I don’t really buy the argument that folks are gonna accidentally invoke slash commands, especially with autocomplete.  OTOH I also think slash commands are mostly silly.</p>",
        "id": 1228126,
        "sender_full_name": "Steve Howell",
        "timestamp": 1625783296
    },
    {
        "content": "<p>I aware that expanding slash commands is a polarizing topic, but I would like to point out that an <code>/away</code> command would be most helpful to 'set yourself as unavailable'. I'm not aware of a string of keyboard commands that can do the same as succinctly as <code>/away</code> could. Is there a better way to do this via [web]?</p>",
        "id": 1230663,
        "sender_full_name": "Andy Molenda",
        "timestamp": 1626224000
    },
    {
        "content": "<p>Click on the <strong>⋮</strong> next to yourself in the Users menu, and click <strong>Set yourself as unavailable</strong>.</p>",
        "id": 1230665,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1626224165
    },
    {
        "content": "<p>I don’t think there’s opposition to adding some kind of command UI for power keyboard users—it just shouldn’t be one where the consequence of a typo or a server version mismatch is that you accidentally send a message to whatever stream you happened to be looking at.</p>",
        "id": 1230668,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1626224271
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"699\">Anders Kaseorg</span> <a href=\"#narrow/stream/101-design/topic/slash.20commands/near/1230665\">said</a>:</p>\n<blockquote>\n<p>Click on the <strong>⋮</strong> next to yourself in the Users menu, and click <strong>Set yourself as unavailable</strong>.</p>\n</blockquote>\n<p>Yeah, the fact that I cannot do this via keyboard shortcuts and pressing tab a few times in the web ui is what I was addressing. It's a common slash command to Slack and IRC users. I don't know if that's something that the Zulip community would agree is necessary, but it does point out that there are just some things you can't easily do without a mouse.</p>",
        "id": 1230674,
        "sender_full_name": "Andy Molenda",
        "timestamp": 1626224736
    },
    {
        "content": "<p>Keyboard accessibility problems should be addressed in a discoverable way, not (only) by hidden command features.</p>",
        "id": 1230679,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1626225230
    },
    {
        "content": "<p>For example, perhaps <code>w</code> <code>Enter</code> should take you to that <strong>⋮</strong> menu instead of directly to a private messages view?</p>",
        "id": 1230684,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1626225504
    },
    {
        "content": "<p>Not necessarily, I know several users who use that functionality for 'note to self' usage.</p>",
        "id": 1230688,
        "sender_full_name": "Andy Molenda",
        "timestamp": 1626225569
    },
    {
        "content": "<p>So do I, but you can get to the private messages from the <strong>⋮</strong> menu.</p>",
        "id": 1230689,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1626225698
    },
    {
        "content": "<p>And we could make navigating the menu easier with underlined accelerator shortcuts that show up if the menu was opened using the keyboard.</p>",
        "id": 1230691,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1626225806
    },
    {
        "content": "<p>Honestly, this would be more consistent from a keyboard-only use case and would allow for accessing user profiles more readily (not just the end user's profile).</p>",
        "id": 1230693,
        "sender_full_name": "Andy Molenda",
        "timestamp": 1626225875
    },
    {
        "content": "<p>Although I guess underlined accelerators would be tricky to internationalize.</p>",
        "id": 1230697,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1626226283
    },
    {
        "content": "<p>In zulip-terminal we allow navigation into the side panels, but also <code>w</code> and <code>q</code> achieve the same, and <code>i</code> pops up \"information\". I occasionally find myself wanting to do the same in the web app.</p>",
        "id": 1230704,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1626227652
    },
    {
        "content": "<p>I would definitely appreciate more focus on natural keyboard navigation vs. slash commands.  But I also think “/away” is a pretty natural candidate for a slash command, and I don’t have the same level of concern about accidents as Anders has here.</p>",
        "id": 1230962,
        "sender_full_name": "Steve Howell",
        "timestamp": 1626278314
    }
]