[
    {
        "content": "<p>I feel like we should think about leveraging the \"text-rendering\" property of CSS to all text on the zulip app. Currently, even though we are using a pretty good font  ( Source Sans Pro ) it still looks like its way too unpolished. By adding the text-rendering property the appearance of the app almost immediately becomes a lot more modern, readable and less strain on the eyes.</p>\n<p>Attaching a couple of screenshots for comparison with the text-rendering property on and off. <a href=\"/user_uploads/2/86/wsbH9QGlvNPYQplJ3t8PmQQT/Screen-Shot-2018-04-22-at-5.16.19-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-04-22-at-5.16.19-PM.png\">Screen-Shot-2018-04-22-at-5.16.19-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/86/wsbH9QGlvNPYQplJ3t8PmQQT/Screen-Shot-2018-04-22-at-5.16.19-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-04-22-at-5.16.19-PM.png\"><img src=\"/user_uploads/2/86/wsbH9QGlvNPYQplJ3t8PmQQT/Screen-Shot-2018-04-22-at-5.16.19-PM.png\"></a></div>",
        "id": 567769,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1524397841
    },
    {
        "content": "<p><a href=\"/user_uploads/2/3e/A_Z5o_NZ6D0NghXHIy5tCBWa/Screen-Shot-2018-04-22-at-5.23.05-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-04-22-at-5.23.05-PM.png\">Screen-Shot-2018-04-22-at-5.23.05-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/3e/A_Z5o_NZ6D0NghXHIy5tCBWa/Screen-Shot-2018-04-22-at-5.23.05-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-04-22-at-5.23.05-PM.png\"><img src=\"/user_uploads/2/3e/A_Z5o_NZ6D0NghXHIy5tCBWa/Screen-Shot-2018-04-22-at-5.23.05-PM.png\"></a></div>",
        "id": 567770,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1524398031
    },
    {
        "content": "<p>Interesting!  I guess my only concern would be whether this introduces perf problems.</p>",
        "id": 567865,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1524428118
    },
    {
        "content": "<p>Well its a native CSS property. I see it as a progressive enhancement. Its currently supported in the following browsers <a href=\"https://caniuse.com/#search=text-rendering\" target=\"_blank\" title=\"https://caniuse.com/#search=text-rendering\">https://caniuse.com/#search=text-rendering</a> ... it will gain support as you go along and for people on other browsers they would just see the text as they do right now.</p>",
        "id": 567879,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1524429361
    },
    {
        "content": "<p>And webkit has even deeper support behind a vendor prefix with -webkit-font-smoothing</p>",
        "id": 567881,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1524429508
    },
    {
        "content": "<p>I think Brock had some thoughts about this; might be good to ping him when we next run into him.</p>",
        "id": 568052,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1524460249
    },
    {
        "content": "<p>Considering potential values are <code>auto</code>, <code>optimizeSpeed</code>, <code>optimizeLegibility</code> and <code>geometricPrecision</code> it is almost a given that there will be a non-trivial performance cost.</p>",
        "id": 568370,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1524506177
    },
    {
        "content": "<p>Have you faced issues using text-rendering on this app before? I'm interested in how non-trivial this performance cost is. Considering we should be rendering rendering at maximum 10 - 20 messages at a time thats not an extremely large number of nodes to really be worried about text-rendering performance.</p>",
        "id": 568392,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1524507660
    },
    {
        "content": "<p>I feel like it may be worth the small penalty in painting / rendering performance considering it improves the reading experience significantly IMHO specially when parsing a large amount of text at once.</p>",
        "id": 568394,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1524507753
    },
    {
        "content": "<p>Perhaps a distinction could be made here between the web and mobile apps since I've noticed rendering could be an issue on mobile?<br>\nAs per <a href=\"https://marco.org/2012/11/15/text-rendering-optimize-legibility\" target=\"_blank\" title=\"https://marco.org/2012/11/15/text-rendering-optimize-legibility\">https://marco.org/2012/11/15/text-rendering-optimize-legibility</a> indeed this is an issue on mobile devices. Perhaps it could be applied selectively only to the web app?</p>\n<p>Note: I was suggesting using the geomtricPrecision setting just FYI</p>",
        "id": 568398,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1524507836
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"5837\">@Armaan Ahluwalia</span> rendering performance for the message feed is indeed very important, because it affects how quickly users see what they want to look at, and we render a few hundred messages at a time (which is critical for smooth pageup/pagedown)</p>",
        "id": 568410,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1524509116
    },
    {
        "content": "<p>I feel like the easiest thing to do is for anyone interested in how it affects rendering to go in and add text-rendering: geometricPrecision to the app css... i think you'll find it doesn't really affect anything.</p>",
        "id": 568412,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1524509227
    },
    {
        "content": "<p>This would only be a progressive enhancement for the web app as mobile seems to have trouble rendering this property.</p>",
        "id": 568414,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1524509275
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"5837\">@Armaan Ahluwalia</span> there is absolutely no chance that this does not affect performance. It is hardware accelerated on some platforms and some devices (who do have the hardware). And it isn't on the rest.<br>\nThat does not make it a bad idea. But the analysis should include how much slower it makes the rendering, on what platforms (browsers), OSes, devices etc.</p>",
        "id": 569141,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1524590229
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"284\">@Boris Yankov</span> I agree with you. But like I said I feel like adding that property involves some degree of trust in the browsers themselves. I think major performance impact would be on nodes that contains large amount of text together which makes it a really bad idea for long paragraphs but seeing as though zulip is mostly message oriented that shouldn’t be as much of an issue. Perhaps it could be selectively added as an enhancement. I’ll do a bit more research as I free up. Thanks for your input on this it’s definitely a very good point.</p>",
        "id": 569218,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1524591560
    },
    {
        "content": "<p>Just to clarify: I am in favor of improving text rendering ;) Just wanted to stress that the browsers offer great profiling tools for their rendering pipeline, so a more in-depth analysis is not only desirable, but very viable.</p>",
        "id": 569254,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1524592979
    },
    {
        "content": "<p>As examples, early Kindles did not offer good text layout because calculating kerning was too computationally intensive. Also Photoshop and Illustrator, both professional-grade software, do not offer their best letter rendering and typography calculations as defaults for perf reasons (they can be selected).</p>",
        "id": 569259,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1524593081
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"284\">@Boris Yankov</span> <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>  Alright after some brief research I've come to the conclusion we should opt for applying -webkit-font-smoothing: antialiased; instead of the text-rendering property I mentioned earlier. The latter was designed mostly for ligatures and indeed suffers from bugs across platforms and browsers. The former would make a fantastic replacement as it has the same desired effect. In terms of issues, it seems to be extremely widely used across projects ( including twitter bootstrap and zulip itself ) ... For some reason it hasn't been applied to the main app messages window and sidebars.</p>",
        "id": 569296,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1524594707
    }
]