[
    {
        "content": "<p>Hi!<br>\nDiscord has this feature which lets you sort the users list by role. I was wondering if something similar can be done in Zulip: can the online users be sorted by user groups they have been assigned?<br>\nI'm new around here, so it this has already been considered, I apologise for the spam (and could somebody direct me to an appropriate thread?). Thanks!</p>",
        "id": 1000213,
        "sender_full_name": "Neeraj Deshmukh",
        "timestamp": 1598456309
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"17101\">@Neeraj Deshmukh</span> I don't think we have an issue for that.  One thing that's a little tricky is that user groups aren't disjoint sets; so we could sort by role (owner/administrator/etc.), but not easily by user groups.</p>",
        "id": 1000316,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1598466269
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>  On Discord the way this works is you can list the \"Roles\" in a order of importance. Then the user get sorted into the \"Roles\" topmost role assigned to them. I don't know how tricky this will be to do since I don't have much coding experience.</p>",
        "id": 1002328,
        "sender_full_name": "Neeraj Deshmukh",
        "timestamp": 1598627517
    },
    {
        "content": "<p>I see, interesting.</p>",
        "id": 1002635,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1598641767
    },
    {
        "content": "<p>We're currently have a workaround for this by appending <code> - GroupName</code> tags on the Display Name until the Users panel can be grouped. We use LDAP and have Full Name modification turned off for Members. I think it would be beneficial to leverage the User Groups setting for this.</p>",
        "id": 1002772,
        "sender_full_name": "Andy Molenda",
        "timestamp": 1598651701
    },
    {
        "content": "<p>I would love to see the Users search field return @groups as well.</p>",
        "id": 1002774,
        "sender_full_name": "Andy Molenda",
        "timestamp": 1598651823
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16989\">@Andy Molenda</span> interesting re: user groups; what would you expect to be displayed if someone typed a user group in the right sidebar?</p>",
        "id": 1002876,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1598657004
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> Return the users who are members of the group, '@usergroup' itself listed top most. </p>\n<p>Selecting the @usergroup could also possibly lead to a PM to @usergroup similar to @all/@everyone. Members of the user group could receive notifications via @usergroup since it functions effectively like @all. There would need to be a Notification configuration option if this functions like I assume (haven't looked at the actual code yet). </p>\n<p>This would allow for membership visibility outside of Stream subscription and doesn't require Admin or Owner role permissions in Zulip to view it.</p>",
        "id": 1003013,
        "sender_full_name": "Andy Molenda",
        "timestamp": 1598659883
    },
    {
        "content": "<p>Also, typing @ in user search would  return @usergroups</p>",
        "id": 1003016,
        "sender_full_name": "Andy Molenda",
        "timestamp": 1598660021
    },
    {
        "content": "<p>For auto completion</p>",
        "id": 1003017,
        "sender_full_name": "Andy Molenda",
        "timestamp": 1598660035
    }
]