[
    {
        "content": "<p>This connects to <a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/Disabling.20show.20more\">#feedback &gt; Disabling show more</a> and <a class=\"stream-topic\" data-stream-id=\"138\" href=\"/#narrow/stream/138-user-community/topic/Quote.20selected.20text\">#user community &gt; Quote selected text</a>. I'm posting it in <a class=\"stream\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design\">#design</a> since this is more of a feature concept.</p>\n<h2>Connection to 'show more'</h2>\n<p>If I compose a single message that has a large number of short paragraphs, but put together into one long message, it is likely to be subject to hiding by 'show more'. However, if I compose it together, but manually split and send it in small chunks/paragraphs, then it should never trigger 'show more'.</p>\n<p>So for now, manually splitting messages is a work-around if users want to lessen the chance of people seeing 'show more'. Of course, single paragraphs/objects that are tall enough still have 'show more' apply to them - it's a useful feature, and having a setting as discussed in <a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/Disabling.20show.20more\">#feedback &gt; Disabling show more</a> will help ensure that.</p>",
        "id": 1625115,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692072258
    },
    {
        "content": "<h2>Long message advocacy vs practice?</h2>\n<p>I recall that Zulip has been advocated as being useful for longer messages, not just bursts of 'chat' involving short messages.</p>\n<p>However, I sense that frequent writers on czo often manually split their longer messages, and personally I do so in certain cases, perhaps more to simplify quoting of parts of my message by myself or others. This also naturally helps with other actions which apply per-message, including starring, reacting, and editing, where it is useful to do so to part of what would be otherwise a long message.</p>\n<p>I'd be interested to hear how frequently others do this manually, and for what reasons.</p>",
        "id": 1625118,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692072282
    },
    {
        "content": "<h2>Proposed solution</h2>\n<p>As per the topic title, the idea would be to <em>automatically</em> split (longer) messages, either on sending (in the backend, to avoid races/interleaving?), or perhaps on rendering (showing each part/paragraph as a separate logical message).</p>\n<p>Handled correctly, users would compose messages as now, with the exception that longer messages would be processed/appear as sequences of smaller messages with the same content. They should appear similar to multiple messages sent by the same user \"rapidly\" in sequence, just like manual splitting already produces.</p>\n<p>Depending on the implementation, user-visible changes would include:</p>\n<ul>\n<li>users not used to manually splitting, noticing multiple messages being produced from one composition</li>\n<li>focus moving over smaller parts of longer \"messages\", rather than the entire large message</li>\n<li>multiple unreads being generated per large message</li>\n</ul>",
        "id": 1625120,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692072485
    },
    {
        "content": "<p>Anticipated challenges and other factors drafted, but waiting for feedback before diving too deep <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 1625122,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692072552
    },
    {
        "content": "<p>I think ultimately the thing I'd like to be able to do is make it easy to select a paragraph from a message and hit <code>&gt;</code> or use a mouse option and quote-and-reply that section of the message; this would eliminate the \"reply\" motivation for splitting a message.</p>",
        "id": 1625139,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692074817
    },
    {
        "content": "<p>Though not the \"make this a thing people can emoji react to\".</p>",
        "id": 1625140,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692074830
    },
    {
        "content": "<p>I guess mainly I feel like doing message breaks is sort of a heavier form of organization than paragraph breaks, and is a useful tool for letting one communicate the boundaries between separate thoughts.</p>",
        "id": 1625143,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692075058
    },
    {
        "content": "<p>Yeah, the 'select a paragraph from a message' tack is the on-rendering approach, eg. the frontend identifies paragraphs, which can somehow be selected. Or if not already in the rendered message content, the backend could embed where to split instead.</p>",
        "id": 1625210,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692082190
    },
    {
        "content": "<p>I identified this as a limitation in the draft, but I appear to have lost it <span aria-label=\"confused\" class=\"emoji emoji-1f615\" role=\"img\" title=\"confused\">:confused:</span></p>",
        "id": 1625211,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692082270
    },
    {
        "content": "<p>If one does the split in the backend, something like a <code>composition_first_message_id</code> could be retained in later messages in a composition (split message), which would enable both the per-message interaction and the per-paragraph (or whatever) interaction.</p>",
        "id": 1625214,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692082546
    },
    {
        "content": "<p>One followup idea to this to explore was to scroll/move-focus at different tiers, since a large message would have smaller elements to move through (if eg. paragraphs). Then also switching to different larger time windows with one sender would mimic current behavior for both large messages with such an approach, as well as older manually-split messages.</p>",
        "id": 1625215,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692082824
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2406\">Neil Pilgrim (neiljp)</span> <a href=\"#narrow/stream/101-design/topic/splitting.20long.20compositions/near/1625118\">said</a>:</p>\n<blockquote>\n<p>I'd be interested to hear how frequently others do this manually, and for what reasons.</p>\n</blockquote>\n<p>I'm probably one of the folks you notice splitting long text into many smaller messages. I think as a person, I tend to like to gather / craft my thoughts all at once, hence the long text. But, I want folks to be able to respond to my thoughts (via reactions or quote/reply) easily.</p>\n<p>So I split the text into sections that I think work well for that. I don't always split on paragraphs. I think like <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> said above, I use the message breaks as an additional form of organizing the thoughts/text.</p>",
        "id": 1626160,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1692178149
    },
    {
        "content": "<p>To be clear, I wasn't suggesting necessarily splitting on every paragraph. If there <em>were</em> to be an algorithm that split messages automatically (\"forcibly\") then it could eg. keep a quote with the following paragraph, and lists with the text above.</p>",
        "id": 1626408,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692208857
    },
    {
        "content": "<p>However, when I was writing my original suggestion for this feature, it was very long, and I had divided sections with eg. <code>---</code> or topic headings. So either specific content could be determined as reliable/reasonable splitting points, or even only specific markers could be used to indicate splitting points.</p>",
        "id": 1626409,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692209000
    },
    {
        "content": "<p>At a minimal level, if I write a longer message, it'd be useful to not have to mess with copy/paste to split a message, particularly with lots of splits, and just send it and have it split either according to how I specifically want, or automatically.</p>",
        "id": 1626411,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692209218
    },
    {
        "content": "<p>I feel pretty cautious about doing something automatically, since I think people have pretty different plans for what they want to do with long messages.</p>",
        "id": 1626412,
        "sender_full_name": "Evy",
        "timestamp": 1692209378
    },
    {
        "content": "<p>Maybe a potential solution to this is some tool that lets you manually (but easily) split up a long message before you send it?</p>",
        "id": 1626413,
        "sender_full_name": "Evy",
        "timestamp": 1692209402
    },
    {
        "content": "<p>The counterpoint to messages as organizational structure, was that lots of smaller messages already sent might be better considered as one point in retrospect - which was my observation with eg. application of show more.</p>",
        "id": 1626414,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692209463
    },
    {
        "content": "<p>If a user sees their messages forcibly split, then various custom options are possible, like breakpoint markers in messages, or a toggle in the compose box to enable/disable the feature on a per-message basis, or a per-user and per-organization basis.</p>",
        "id": 1626415,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692209723
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2406\">Neil Pilgrim (neiljp)</span> <a href=\"#narrow/stream/101-design/topic/splitting.20long.20compositions/near/1625214\">said</a>:</p>\n<blockquote>\n<p>If one does the split in the backend, something like a <code>composition_first_message_id</code> could be retained in later messages in a composition (split message), which would enable both the per-message interaction and the per-paragraph (or whatever) interaction.</p>\n</blockquote>\n<p>Something like this would mean elements of larger messages would be individually-addressable for quoting/reacting/etc since they were literally messages in the backend. However, the frontend could combine adjacent messages via a tag along these lines and reproduce the existing UI, or optionally support the intra-composition features this would enable.</p>",
        "id": 1626417,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692210077
    },
    {
        "content": "<p>Implementation details could vary of course, eg. messages could be kept as they, and automatic markers introduced either dynamically on sending to clients, or before storing in the backend.</p>",
        "id": 1626418,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1692210078
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"21453\">Evy</span> <a href=\"#narrow/stream/101-design/topic/splitting.20long.20compositions/near/1626413\">said</a>:</p>\n<blockquote>\n<p>Maybe a potential solution to this is some tool that lets you manually (but easily) split up a long message before you send it?</p>\n</blockquote>\n<p>Hmm, yeah, I could imagine having Markdown syntax that's in the broad category of <code>----------------------</code> that represents a \"message break\" (though not that specifically, since it's an <code>&lt;hr&gt;</code> in Markdown), and Zulip would just cut your message up by those and send them together in a single transaction.</p>",
        "id": 1627122,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692300368
    },
    {
        "content": "<p>Right, I agree with that approach - I mentioned that in a few different ways above.</p>\n<p>I think that could be a good initial step upon which other guided splitting could build later, if we wished.</p>",
        "id": 1634580,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1693620965
    },
    {
        "content": "<p>One interesting thing about this 'markdown' would be that while it would need to coexist with what we have, it need only be present in the composition - it wouldn't need to form part of the actual content for the resulting messages, including if the raw markdown source was requested. So it would need a preview form, and to be compatible with other content, but after sending, the frontend could assume it was multiple messages without those elements present, and then be updated by the rendered content from what are regular messages. Depending upon the API selected to handle sending as a single transaction, the new markdown could even be removed on the client side before sending.</p>",
        "id": 1634581,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1693620977
    },
    {
        "content": "<p>Allowing this kind of 'markdown' could also permit a separation between maximum message length (technical constraint) and maximum composition length (logical/social constraint) - the latter being longer. So a client could shift from only requiring of a user that the content is below the former, to also suggesting \"message break\" markdown. It would allow the client to put more emphasis on shorter messages enabling eg. reactions on shorter parts of a longer composition, with less sense that it's a technical constraint.</p>\n<p>This separation could depend on the form of the extended API, and in what ways the current maximum message length is involved in current technical constraints, eg. database field length, composition <code>POST</code>.</p>",
        "id": 1634582,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1693620979
    },
    {
        "content": "<p>The thought I'd add to this thread is that I don't think there's any inconsistency here:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"2406\">Neil Pilgrim (neiljp)</span> <a href=\"#narrow/stream/101-design/topic/splitting.20long.20compositions/near/1625118\">said</a>:</p>\n<blockquote>\n<h2>Long message advocacy vs practice?</h2>\n<p>I recall that Zulip has been advocated as being useful for longer messages, not just bursts of 'chat' involving short messages.</p>\n<p>However, I sense that frequent writers on czo often manually split their longer messages, and personally I do so in certain cases, perhaps more to simplify quoting of parts of my message by myself or others. This also naturally helps with other actions which apply per-message, including starring, reacting, and editing, where it is useful to do so to part of what would be otherwise a long message.</p>\n</blockquote>\n<p>The thing is that the short \"chat\"-style messages that are the norm on IRC and often in other systems are <em>very</em> short, like up to a single line of text.</p>\n<p>In Zulip it's comfortable to write and read longer messages: complete, complex sentences, up to several paragraphs. That makes a real difference in the nature of the conversation compared to single lines, so it's an important aspect of the Zulip experience.</p>\n<p>The point where I find a Zulip message starts feeling awkwardly long, and good to break up, is as it gets to many hundreds of words — entire printed pages' worth of text.</p>",
        "id": 1637301,
        "sender_full_name": "Greg Price",
        "timestamp": 1694207773
    },
    {
        "content": "<p>Thanks Greg - I didn't mean to imply inconsistency, or that Zulip wasn't an improved experience for using with longer messages.</p>",
        "id": 1638553,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1694478785
    },
    {
        "content": "<p>I just lost my text with further background when my browser crashed, but my original aim was simply to set a context to explore how handling of longer messages could be improved. Let me try and summarize again, starting more from your point.</p>",
        "id": 1638630,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1694488772
    },
    {
        "content": "<p>I think a key part of what makes Zulip feel more comfortable is a reduced need/sense of urgency to get one's message(s) out there ASAP, due to a lower chance of getting interrupted. I'd attribute that to the increased namespace available via topics combined with the support we have for longer messages:</p>\n<ul>\n<li>Topics reduce the likelihood a given user is browsing or composing to a specific conversation, so it's easier to write a sequence of shorter messages that are related and flow from each other before another user responds</li>\n<li>Longer messages provide a guarantee that the flow won't be interrupted, since the long message is a single unit.</li>\n</ul>",
        "id": 1638631,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1694488791
    },
    {
        "content": "<p>My observations:</p>\n<ul>\n<li>people routinely compose long messages - it works well to group message content, and avoid interruptions by other posted messages</li>\n<li>when doing so, some people manually split long compositions when posting</li>\n<li>splitting compositions naturally enables various per-message actions (reacting, editing, quoting, ...)</li>\n<li>manual splitting is awkward, with risks of losing data if not careful</li>\n<li>while topics reduce the likelihood of interruption, it's preferable to post manually-split parts in quick succession, since there's no block in place compared to when posting a single \"long\" message</li>\n<li>somehow promoting (vertically) shorter messages in general would reduce the frequency of 'show more' and resolving related issues</li>\n</ul>",
        "id": 1638632,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1694488804
    },
    {
        "content": "<p>I accept my original composition-splitting proposal was an optimistic solution, though I'll emphasize again that I was not specifically suggesting enforcing breaking between every paragraph! However, whether occurring automatically upon sending, manually in markdown, or somewhere between those extremes, the concept is the same: loosen the 1:1 mapping between a \"composition\" and the resulting \"message\" to instead be 1:n.</p>",
        "id": 1638633,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1694488815
    },
    {
        "content": "<p>To whatever extent it's implemented, that loosening potentially enables various benefits:</p>\n<ul>\n<li>enable users to easily generate multiple messages from one composition safely from within Zulip</li>\n<li>naturally support existing actions on designated sub-elements of a composition - ie. messages - reactions, quoting, etc.</li>\n<li>lower the need to implement sub-message actions (excepting eg. select-and-quote)</li>\n<li>reduce the frequency of longer messages needing to be folded using 'show more'</li>\n<li>maintain the uninterruptable nature of long compositions by sending multiple messages as a transaction</li>\n<li>enable visual indication of messages belonging to a single composition</li>\n<li>support selection-based movement at a finer-grained level where compositions are long</li>\n<li>separate technical decisions on message length from technical/social decisions over composition length</li>\n</ul>",
        "id": 1638634,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1694488820
    },
    {
        "content": "<p>I really appreciate your thoughtful and highly scannable lists here, <span class=\"user-mention silent\" data-user-id=\"2406\">Neil Pilgrim (neiljp)</span>. One other data point: I often bring drafts to the table when I’m writing a sequence of longer messages, but want to split them up into shorter chunks for the sake of readers like <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> who want to be able to return to their reading position after being called away or otherwise interrupted. That’s just a +1 for the reader-focused nature of this feature, but also maybe a little kernel of an idea that this might somehow also be tied to drafts?</p>",
        "id": 1638784,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1694525688
    },
    {
        "content": "<p>Since it's fairly common to manually split up a message after writing it, having an automated way to do that does seem handy.</p>\n<p>I like the idea of having Markdown syntax for it; we'd also want to add a compose box button to make it discoverable. Maybe a button with a scissors icon, and a something like <code>&gt;&lt;</code> as a visual representation of those scissors? I dunno if that specific idea is problematic due to other uses of angle brackets.</p>",
        "id": 1644927,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695328222
    },
    {
        "content": "<p>I don't know about the technical details, but from a user perspective, I think it's fine if there's no visible relationship between the messages once they are sent. But it's important that they appear in the right order, even, e.g., on a bad connection.</p>",
        "id": 1644928,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695328286
    },
    {
        "content": "<p>In the first instance I'd expect the splitting could occur in the backend as a preprocessing step, before the messages are saved. Using multiple API calls to send messages of this form, splitting in a client, could be a follow-up to support the message- vs composition-length separation, but I expect would need additional support in the API to ensure ordering is maintained - which I think is critical.</p>",
        "id": 1644938,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1695329089
    },
    {
        "content": "<p>As I noted <a href=\"#narrow/stream/101-design/topic/splitting.20long.20compositions/near/1634581\">above</a> I don't see the syntax we'd introduce for this as being markdown in a normal sense, more of a preprocessor macro which needs to be compatible with it.</p>",
        "id": 1644945,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1695329609
    },
    {
        "content": "<p>In terms of a scissors representation, I've more often seen something like <code>8&lt;</code>?</p>",
        "id": 1644946,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1695329644
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> also just suggested a line of <code>===</code> as an option, or perhaps a special \"multi-message\" mode that takes over <code>---</code> and uses it as a message separator.</p>",
        "id": 1644949,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695329756
    },
    {
        "content": "<p>Anyway, from a UX perspective for composing these, I think the key thing is to be able to craft your message, and then split it up without having to do a copy-paste dance. (So, for example, one wouldn't want to manage it with multiple separate text input fields.)</p>",
        "id": 1644951,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695329833
    },
    {
        "content": "<p>Since it's a composition, it'd be user-specific, so could have a realm default to <code>8&lt;</code> or <code>---</code> (on it's own line, presumably), but also support other text if alone on their own line, if we wanted to take it that far <img alt=\":shrug:\" class=\"emoji\" src=\"/user_avatars/2/emoji/images/31.png\" title=\"shrug\"></p>",
        "id": 1644954,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1695329962
    },
    {
        "content": "<p>This kind of thing is guaranteed to be annoying to get right. For any syntax we invent, say <code>乂｡●́‿●̀｡乂</code> (to avoid expressing an opinion on any real proposal), some people are going to want to <em>use</em> <code>乂｡●́‿●̀｡乂</code>, and some people are going to want to <em>talk about</em> how to use <code>乂｡●́‿●̀｡乂</code>, which they might do using a code block:</p>\n<div class=\"codehilite\" data-code-language=\"Markdown\"><pre><span></span><code>Hi @<span class=\"gs\">**user**</span>, you can split your message by typing\n\n<span class=\"sb\">```</span>\n<span class=\"sb\">乂｡●́‿●̀｡乂</span>\n<span class=\"sb\">```</span>\n</code></pre></div>\n<p>Which means that whatever is in charge of parsing this syntax needs to have enough awareness of Markdown—and our crazy Markdown quirks—to be able to distinguish uses from mentions.</p>",
        "id": 1644955,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1695330104
    },
    {
        "content": "<p>It'd interfere with composition in the sense that it could accidentally split a message, and couldn't easily be undone, though we could prompt if the client/backend intends to do a split, under certain circumstances.</p>",
        "id": 1644956,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1695330230
    },
    {
        "content": "<p>If we want this as a feature, it’d be better to give it first-class UI support—have a button and perhaps a keyboard shortcut that literally splits the compose textarea into two textareas, or merges two textareas into one, at the current cursor location.</p>",
        "id": 1644957,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1695330321
    },
    {
        "content": "<p>That could work for a post-writing stage where one thinks about splitting later. I'd likely still use it - at least on web - but it would be less flexible while mid-writing, than knowing I can use either of my examples.</p>\n<p>In that case, I expect we'd need to extend the API, since we wouldn't embed anything into the message content?</p>",
        "id": 1645018,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1695331031
    },
    {
        "content": "<p>Hmm, I think my revised idea would be to support a syntax while composing, and confirm the split before sending - perhaps even doing a multiple textarea/display preview.</p>",
        "id": 1645020,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1695331176
    },
    {
        "content": "<p>Yeah I'd been thinking about a world where we make multiple text boxes stacked on top of each other; the challenge with that will I think be how to get the UI right so that you don't end up copy/pasting stuff around between different elements.</p>\n<p>From a composition standpoint it certainly would feel nicer to have it be one box that you can just arrow around in.</p>",
        "id": 1645033,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695331425
    },
    {
        "content": "<p>I generally like the idea of this being outside markdown. But I could imagine a UI where you cut up your line if messages in the normal compose box, using ===== or whatever as delimiters, and then can split into several with a menu item as a last step before hitting send.</p>\n<p>Just not sure what a clean UI would be. I like the idea of split at cursor for making two but like for a message you want to split into 10, I feel like you want to be able to stage your breakpoints so you can use your browser native editing features, undo, etc.</p>",
        "id": 1645071,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695333631
    },
    {
        "content": "<p>Like it seems totally fine if you can't use a lounge with all =s in a message using this feature; just send two messages the old fashioned way.</p>",
        "id": 1645072,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695333680
    },
    {
        "content": "<p>To keep this fresh, maybe it would help to consider aspects of what implementation might best look like to support this.</p>\n<ul>\n<li>If using quasi-markdown (a 'split string'), the server could do the snipping and ensure the uninterrupted sequential posting of messages. Clients wouldn't need changing for that, but we'd need to be sure that the quasi-markdown was feasible and the server would know where to cut safely. The API itself wouldn't change - the 'markdown API' would instead.</li>\n<li>The simplest REST API change would seem to be to support <code>content</code> as a list of strings - or perhaps to provide 'split point indices' in a new field, to make compatibility simpler. Clients would then determine split points and send the content in a pre-split form (or where to split it), and the server would post them sequentially.</li>\n<li>To enable the decoupling of composition length from content length, there would need to be synchronization between multiple send-message POST's. That seems like a bigger project that wouldn't necessarily overlap in terms of API changes.</li>\n</ul>",
        "id": 1648661,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1695862325
    },
    {
        "content": "<p>Discarding the latter as a separate project, this seems to more concisely come down to either:</p>\n<ul>\n<li>client sends content as before, but special 'split string' now has meaning; server splits composition, based on finding agreed-upon 'split string'</li>\n<li>client identifies split points (via client-specific 'split strings' or other UI); client sends content using updated API, specifying split points; server knows splits via API</li>\n</ul>\n<p>While the first approach has the appeal of transparently working with existing clients, introducing - and being stuck with - a specific new markdown element are certainly significant issues; thanks for emphasizing that <span class=\"user-mention silent\" data-user-id=\"699\">Anders Kaseorg</span>. The second approach seems like it would be semantically cleaner, and allow clients to explore different splitting techniques without needing to settle on one in particular - and without needing to discuss the fine details of text boxes and delimiters before proceeding.</p>",
        "id": 1648662,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1695862334
    }
]