[
    {
        "content": "<p>Starred topics akin to Starred messages for Topics that a user wants to keep a track of. Thoughts?</p>",
        "id": 751813,
        "sender_full_name": "Vinit Singh",
        "timestamp": 1560029124
    },
    {
        "content": "<p>Where would the ui to access these started topics be?</p>",
        "id": 751841,
        "sender_full_name": "Yash RE",
        "timestamp": 1560052875
    },
    {
        "content": "<p>Top left with starred messages I assume. Or if the Pinned Topics thing pans out that'd be even better.</p>",
        "id": 751865,
        "sender_full_name": "Vinit Singh",
        "timestamp": 1560068091
    },
    {
        "content": "<p>What do you think of \"Topics I follow\", as a thing on which you can set notification preferences?</p>",
        "id": 751887,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1560094078
    },
    {
        "content": "<p>That would be slightly different, no? This is a great idea, but having starred topics could be used for topics that I meant to save for future reference but don't necessarily won't to follow/get notified about.<br>\nRight now I usually have to star a message or two if I want to save the topic as a whole so that I can get back to it at a later date. It's still not ideal though.</p>",
        "id": 751890,
        "sender_full_name": "Vinit Singh",
        "timestamp": 1560097526
    },
    {
        "content": "<p>Would \"Topics I follow\" include access to the set of followed topics?  In which case I think these ideas would be more similar.</p>",
        "id": 751891,
        "sender_full_name": "Wyatt Hoodes",
        "timestamp": 1560097802
    },
    {
        "content": "<p>cool. I agree the feature you're suggesting would be very useful, though not totally sure yet how we would implement it. <br>\n(I think likely the UI for this will be easier to figure out once we figure out the UI for \"topics I follow\")</p>",
        "id": 751893,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1560100072
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"11072\">Wyatt Hoodes</span> I think yes, so one could use \"Topics I follow\" for this purpose.</p>",
        "id": 751894,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1560100163
    },
    {
        "content": "<p>If you consider expanding starred messages to have a topic list, would that be equivalent? We've discussed a little of how this might look like in <a class=\"stream\" data-stream-id=\"206\" href=\"/#narrow/stream/206-zulip-terminal\">#zulip-terminal</a> .</p>",
        "id": 751912,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1560134637
    },
    {
        "content": "<p>Yeah, possibly making a version of the prototype \"unread messages\" view that shows starred messages rather than unread messages would basically do this.</p>",
        "id": 752834,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1560304983
    },
    {
        "content": "<p>Probably not worth working on until we've merged \"unread messages\".</p>",
        "id": 752835,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1560304995
    },
    {
        "content": "<p>(Which I'll probably want to get someone involved in helping with, once I do an initial review of that branch)</p>",
        "id": 752836,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1560305020
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> I would love to help with unread messages branch, this will help me to implement \"topics I follow\" too. According to one of our past discussion, this was one of the issue that was blocking the work on \"my topics\" or \"topics I follow\" right? <br>\nPlease tag me on GitHub during the review of the branch if you think I can help with that <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span><br>\nTopics I follow feature is one of those feature I think fromwhich Zulip will benefit alot and I want to be a part of developing it <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 752870,
        "sender_full_name": "Mohit Gupta",
        "timestamp": 1560313450
    },
    {
        "content": "<p>Add a way that topics I post something to are automatically starred so I can see them quickly and check if something new was posted even when I'm not directly mentioned.</p>",
        "id": 753314,
        "sender_full_name": "Robert M. Münch",
        "timestamp": 1560409717
    },
    {
        "content": "<p>Otherwise I have to remember what topics I posted something to.</p>",
        "id": 753316,
        "sender_full_name": "Robert M. Münch",
        "timestamp": 1560409755
    },
    {
        "content": "<blockquote>\n<p>Add a way that topics I post something to are automatically starred so I can see them quickly and check if something new was posted even when I'm not directly mentioned.</p>\n</blockquote>\n<p>This would be the \"Topics I follow\" notification that <span class=\"user-mention silent\" data-user-id=\"131\">Rishi Gupta</span> mentioned. This would, ideally, \"subscribe\" you to every topic you create or respond to.</p>",
        "id": 753326,
        "sender_full_name": "Vinit Singh",
        "timestamp": 1560415419
    },
    {
        "content": "<p>It would bombard the user with notifications, though, if that is what we choose to do. Not sure what the best way forward is here</p>",
        "id": 753327,
        "sender_full_name": "Vinit Singh",
        "timestamp": 1560415615
    },
    {
        "content": "<p>(fwiw, <span class=\"user-mention silent\" data-user-id=\"131\">Rishi Gupta</span> did mention something about notification preferences)</p>",
        "id": 753500,
        "sender_full_name": "Wyatt Hoodes",
        "timestamp": 1560445375
    },
    {
        "content": "<p>yeah, I think the long-term solution here is to have a setting that allows you to pick between<br>\n- Never follow topics automatically<br>\n- Automatically follow any topic I start<br>\n- Automatically follow any topic I react to (star, send a message, emoji react)</p>\n<p>And then each notification for a topic allows you to unfollow that topic (at least the email notifications, not sure if you can embed sufficiently granular actions in mobile notifications).</p>",
        "id": 753507,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1560446692
    },
    {
        "content": "<p>Autofollow makes a lot of sense and then a single click-action to unsubscribe. Straight and simple.</p>",
        "id": 754242,
        "sender_full_name": "Robert M. Münch",
        "timestamp": 1560594176
    }
]