[
    {
        "content": "<p>Should we make it so that if you're in the Starred Messages narrow and click on \"Starred Messages\", it will update the narrow?  I feel like I've seen this request from somebody else.  The use case is that you go into starred messages, see a couple messages that you've already addressed, un-star them, and then want to see an updated list.</p>",
        "id": 849681,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586357497
    },
    {
        "content": "<p>For most sidebar actions, if they're already selected, we just short-circuit them, since they're already dynamic in terms of incoming messages and edit messages, but otherwise they don't mutate.  Starred messages are unique in that messages quickly go in and out of the view logically, but we don't necessarily want to immediately remove a message from the view when you unstar it.</p>",
        "id": 849682,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586357573
    },
    {
        "content": "<p>The more extreme proposal here would be to have an unstarred message just immediately disappear from the view.  That might actually be the superior solution, but we'd want some kind of \"undo\" mechanism, I'd think.</p>",
        "id": 849683,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586357661
    },
    {
        "content": "<p>In a related way, if an API call stars messages for you, how would it currently behave?</p>\n<p>I definitely think an undo would be useful. I proposed an 'undo' for ZT in general. This would cover not just text edits, but many actions, though some would cause a popup and potentially need to be limited to ensure this overloads the app/system.</p>",
        "id": 849719,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1586360890
    },
    {
        "content": "<p>We have a couple very feature-specific undo actions:</p>\n<ul>\n<li>you can undo a mute (try hitting \"m\")</li>\n<li>you can undo night mode (try the \"/night\" slash command)</li>\n</ul>",
        "id": 849721,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586361002
    },
    {
        "content": "<p>If anybody ever wants to build a feature in the webapp with \"undo\", it's useful to learn about <code>feedback_widget</code>, and just grep for example uses.</p>",
        "id": 849723,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586361152
    },
    {
        "content": "<p>Obviously, I think <span class=\"user-mention\" data-user-id=\"2406\">@Neil Pilgrim</span> is proposing something a bit more holistic, correct?</p>",
        "id": 849724,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586361177
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2406\">Neil Pilgrim</span> <a href=\"#narrow/stream/101-design/topic/starred.20messages/near/849719\" title=\"#narrow/stream/101-design/topic/starred.20messages/near/849719\">said</a>:</p>\n<blockquote>\n<p>In a related way, if an API call stars messages for you, how would it currently behave?</p>\n</blockquote>\n<p>We currently don't live-update the Starred Messages view.  I consider this a bug for the case that I star a message in another browser.  I consider it a design decision for the case where I unstar it in another browser.</p>",
        "id": 849726,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586361304
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"58\">@Steve Howell</span> If you mean more undoing across a frontend, then yes. At this point it was just a broad idea (originally in ZT). We actually have an (undocumented) text-entry undo via <code>urwid-readline</code>, and some things are blocked via popups, though still via <code>m</code> for muting streams.</p>",
        "id": 849729,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1586361385
    },
    {
        "content": "<p>Yeah, I think that proposal to update the narrow makes sense.</p>",
        "id": 849768,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1586363856
    },
    {
        "content": "<p>I'll create a somewhat open-ended issue...</p>",
        "id": 849778,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586364063
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> What are your thoughts on un-starring messages?  Should we never live-update those?  Or should we just make them sticky in the current view?</p>",
        "id": 849780,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586364192
    },
    {
        "content": "<p><a href=\"https://github.com/zulip/zulip/issues/14510\" title=\"https://github.com/zulip/zulip/issues/14510\">https://github.com/zulip/zulip/issues/14510</a></p>",
        "id": 849785,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586364543
    },
    {
        "content": "<p>I'm flexible.  The current behavior of unstarring messages not immediately disappear seems desirable in case you change your mind.</p>",
        "id": 849786,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1586364640
    }
]