[
    {
        "content": "<p>Prompted by the discussion in <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/.22Private.22.20vs.20.22Direct.22\">#design &gt; \"Private\" vs \"Direct\"</a>, I wanted to bring up an observed asymmetry between stream and private/direct messages terminology. While this is somewhat of a documentation issue, it's more regarding pinning down concepts/terms first, which may have impacts on the UI, before updating docs. Maybe to add to a future Zulip glossary?</p>\n<p>Examples:</p>\n<ul>\n<li>\"PMs\" gets used a lot as an abbreviation in text/discussion; hardly ever a stream equivalent? (SMs?)</li>\n<li>\"PMs and stream messages\" feels awkward to keep writing, as would \"private- and stream-messages\" (or similar for comparisons etc), at least in discussions</li>\n<li>Other than in a code/API aspect, I second-guess what phrase to use to best convey 'stream messages' (topic? stream-topic?)</li>\n<li>The UI points out they are PMs or \"PRIVATE MESSAGES\" (or \"DIRECT MESSAGES\"), not \"PRIVATE\" or \"DIRECT\" (cf \"STREAMS\")</li>\n</ul>\n<p>So, initial questions aimed at improving clarity:</p>\n<ul>\n<li>terms: should we use 'direct message' and 'stream message', or something clearer for the latter? (do we already define that?)</li>\n<li>abbreviations: should we avoid abbreviating DMs? Or is there a good equivalent abbreviation for our choice for 'stream message'?</li>\n<li>left panel: should we title the section 'DIRECT' in place of 'DIRECT MESSAGES'? Or extend 'STREAMS' to be 'STREAM MESSAGES'? (however, see below)</li>\n</ul>\n<p>Riffing from that last point and the UI a little further, do we have a written definition of 'conversation'?<br>\nI assume, but am unsure if I've seen it defined, as \"the set of private messages to the same group of users, or the set of messages to the same topic in a given stream\"?<br>\nThat would suggest that in the left panel, at risk of being too verbose:</p>\n<ul>\n<li>'DIRECT MESSAGES' is more accurately 'DIRECT CONVERSATIONS', which would tie into 'more conversations' expanding that list</li>\n<li>'STREAMS' may then be a reasonable title to keep, in tandem with expanding 'more topics' to 'more conversation topics'</li>\n</ul>",
        "id": 1502484,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1675486966
    },
    {
        "content": "<p>I think just \"DIRECT\" feels too brief/ambiguous, we're likely to stick with \"DIRECT MESSAGES\" for the heading.</p>",
        "id": 1503167,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675644507
    },
    {
        "content": "<p>I agree \"DIRECT MESSAGE CONVERSATIONS\" might be more accurate, but that's long in a way that I don't think is helpful.</p>",
        "id": 1503168,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675644533
    },
    {
        "content": "<p>Generally we have a project policy to avoid abbreviations; that likely should apply to \"DMs\" as well -- I'd want to only use the abbreviation when there isn't space to display it fully and it's difficult to adjust the design to avoid that constraint.</p>",
        "id": 1503169,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675644609
    },
    {
        "content": "<p>I think \"direct message\" and \"stream message\" would be terms we'd use conversationally and in Help Center documentation to explain the two types of messages, yes.</p>",
        "id": 1503170,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675644642
    }
]