[
    {
        "content": "<p>Question that's a bit hard to check for myself: are stream colors consistent across an organization, or set separately for each user?</p>",
        "id": 263195,
        "sender_full_name": "David Roe",
        "timestamp": 1501912940
    },
    {
        "content": "<p>each user can decide their own stream colors. If you hover over <code># design</code> in the left sidebar, and click on the down-chevron, you can see the color picker.</p>",
        "id": 263196,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1501915511
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 263199,
        "sender_full_name": "David Roe",
        "timestamp": 1501916898
    },
    {
        "content": "<p>Just chiming in on this one and wondering about the design choice. As it would be great for our Zulip Cloud instance to utilise a \"colour regime\" for all users -- i.e. streams that are working groups are seen as green for everyone, finance related groups blue, security related streams red, etc. So would it hard to move this from a personal setting to an organisational one? I think admins and moderators (and stream creator) should be able to set a colour initially (as it seems to be assigned randomly at the moment?) and from there, people can override with personal preference if they like (or perhaps not [if an organisation is looking for rigidity] as another organisational setting that controls this down the track?)...</p>\n<p>Thoughts?</p>",
        "id": 1241282,
        "sender_full_name": "Jore",
        "timestamp": 1627681607
    },
    {
        "content": "<p>How difficult would <a href=\"#narrow/stream/101-design/topic/stream.20colors/near/1241282\">this</a> be to implement? <span class=\"user-mention\" data-user-id=\"17945\">@Wesley Aptekar-Cassels</span> <span class=\"user-mention\" data-user-id=\"19275\">@Sai Rohitth Chiluka</span> <span class=\"user-mention\" data-user-id=\"15808\">@Felix (strifel)</span></p>",
        "id": 1250055,
        "sender_full_name": "Jore",
        "timestamp": 1630034604
    },
    {
        "content": "<p>It's not terribly difficult, but not trivial either. I don't think we have a detailed design for it yet, so making that would be the first step (picking what the UI would be for admins to set the default stream color, for users to override it, for users to reset it back to the default color, etc).</p>",
        "id": 1250104,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1630086680
    },
    {
        "content": "<p>That's a good point. Okay, great.</p>",
        "id": 1250146,
        "sender_full_name": "Jore",
        "timestamp": 1630115929
    },
    {
        "content": "<p>I believe this is issue <a href=\"https://github.com/zulip/zulip/pull/17968\">#17968</a>.</p>",
        "id": 1251015,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1630433297
    },
    {
        "content": "<p>Thanks for finding that <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> . I don't understand much of the technical aspects outlined in that issue, but sounds about almost there. I added a comment though, which is hopefully helpful, to clarify that I'd love to see this implemented where the admins can make a change to default stream colours and those changes are reflected for all users. I mean: people can/should be able to still change the colours to something else if they prefer, but it would be good if admins can make \"global\" and retrospective changes in this regard. i.e. if a user has not explicitly changed the colour from default, those changes should apply to everyone, even with multiple default colour changes.</p>",
        "id": 1251800,
        "sender_full_name": "Jore",
        "timestamp": 1630564803
    },
    {
        "content": "<p>Yep, makes sense. :)</p>",
        "id": 1251861,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1630596645
    },
    {
        "content": "<p>This is the kind of feature that someone who's done a few projects in our settings system can probably make happen but that probably isn't at the top of my near-term priorities for stream settings (which is doing a big permission overhaul); I'm happy to do the technical design for it once there's someone excited about doing the work.</p>",
        "id": 1256410,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1631835141
    }
]