[
    {
        "content": "<p>moving the small bit of conversation from <a class=\"stream-topic\" data-stream-id=\"49\" href=\"/#narrow/stream/49-development-help/topic/UI.2FUX\">#development help &gt; UI/UX</a> <br>\nWe do not seem to have anything to announce (to all other sub members) when someone joins or leaves a sub? <span aria-label=\"astonished\" class=\"emoji emoji-1f632\" role=\"img\" title=\"astonished\">:astonished:</span></p>\n<p>It seems to be a well in place standard. that we don't have...<br>\nA simple solution is to just have a default topic which gets all these X/Y has joined/left messages (like how we announce new streams).</p>",
        "id": 848405,
        "sender_full_name": "Yash RE",
        "timestamp": 1586212526
    },
    {
        "content": "<p>zulip's \"imported from slack\" topic in every stream that is imported from slack <strong>does</strong> currently (contrary to what is says at <a href=\"https://zulipchat.com/help/import-from-slack#caveats\" title=\"https://zulipchat.com/help/import-from-slack#caveats\">https://zulipchat.com/help/import-from-slack#caveats</a>) include slack's join (and presumably leave?) messages, so if zulip implements its own version of such messages as a special type of message it would be nice if the corresponding slack messages were imported as first-class zulip join/leave messages too.</p>",
        "id": 848410,
        "sender_full_name": "cypherpunks",
        "timestamp": 1586213526
    },
    {
        "content": "<p>Those messages are spammy, which is the main reason we don't do them.  E.g. on this server, such messages would result in messages on every one of the ~20 public streams every day.</p>",
        "id": 848476,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1586220550
    },
    {
        "content": "<p>We do have plans to add a join/leave notification feature for private streams, since that's a use case where they're likely not spam.</p>",
        "id": 848477,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1586220607
    },
    {
        "content": "<p>But couldn't we just put these into their own topic and if someone didn't want to see them they could just mute the topic?</p>",
        "id": 848541,
        "sender_full_name": "Yash RE",
        "timestamp": 1586234898
    },
    {
        "content": "<p>Isn't this really just a substitute for either showing presences, or knowing if specific people have 'read' a message?</p>",
        "id": 848564,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1586236925
    },
    {
        "content": "<p>I don't really think so... it's impossible to achieve the results of join/leave (I know that my coworker will now see these conversations / I know that they will no longer see these conversations) at the scale Zulip supports through just presence/user-list or read-receipts.</p>",
        "id": 848571,
        "sender_full_name": "Yash RE",
        "timestamp": 1586238375
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/sub.20join.2Fleave.20message/near/848476\" title=\"#narrow/stream/101-design/topic/sub.20join.2Fleave.20message/near/848476\">said</a>:</p>\n<blockquote>\n<p>Those messages are spammy, which is the main reason we don't do them.  E.g. on this server, such messages would result in messages on every one of the ~20 public streams every day.</p>\n</blockquote>\n<p>yeah i can certainly see why they would be spammy on a big server like this, but i think they're desirable even for public streams on small instances where users are added infrequently. So, perhaps it would be an option? (never, only private streams, always)</p>",
        "id": 848750,
        "sender_full_name": "cypherpunks",
        "timestamp": 1586262277
    },
    {
        "content": "<p>I'll push back on this a bit.   I've used enough chat alternatives, particularly IRC, to have an opinion about the join/leave messages.  They're almost universally annoying and spammy.  Also, it's nice to be able to quietly join/leave a stream at times from the perspective of the person who is joining or leaving.  And if people are joining a stream, they are typically gonna say something eventually if they don't intend to lurk.</p>",
        "id": 848759,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586263169
    },
    {
        "content": "<p>If we wanted to do this, we'd probably want a per-stream setting for the announcements, and we'd want users to control what they see, instead of just admins.  And we'd probably want users to be able to suppress things on the outbound side.  And it can turn into a lot of settings clutter.  So to do this right could be complicated</p>",
        "id": 848760,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586263276
    },
    {
        "content": "<p>That does sound fair.</p>",
        "id": 848769,
        "sender_full_name": "Yash RE",
        "timestamp": 1586264994
    },
    {
        "content": "<p>My earlier question relied on the idea that previously entering/leaving was often equivalent to connecting to the server, and also in many cases shown as your name added to the user list (eg. IRC). The only way to determine if a message was read was identifying who was online when you posted, unless there was someone/a-bot logging the channel. For large channels, signalling 'read by &lt;x&gt;' is noise in any case, much like the user lists or join/leave spam.</p>",
        "id": 848932,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1586275095
    },
    {
        "content": "<p>for private streams configured to not show users history from before they joined, i think join/leave messages are an essential feature for knowing who has seen what.</p>",
        "id": 849694,
        "sender_full_name": "cypherpunks",
        "timestamp": 1586358715
    },
    {
        "content": "<p>for public streams, it isn't as important, but i've found it helpful when reading history to have a reminder that \"oh, this happened a bit before so and so was hired\". I agree that users should be able to configure if they see these messages, but I think letting users control whether they emit them is probably not worth the ui complexity.</p>",
        "id": 849695,
        "sender_full_name": "cypherpunks",
        "timestamp": 1586358743
    },
    {
        "content": "<blockquote>\n<p>I think letting users control whether they emit them is probably not worth the ui complexity.</p>\n</blockquote>\n<p>Also, defeats the purpose. </p>\n<p>Anyway, I suppose if you have a company and you do need these kinds of logs in some channels, you can just make a private channel and invite everyone, so we really don't need to add this for public streams.</p>",
        "id": 849696,
        "sender_full_name": "Yash RE",
        "timestamp": 1586358855
    },
    {
        "content": "<blockquote>\n<p>We do have plans to add a join/leave notification feature for private streams</p>\n</blockquote>\n<p><del>Do we have an issue/WIP someone could follow?</del></p>",
        "id": 849697,
        "sender_full_name": "Yash RE",
        "timestamp": 1586358907
    },
    {
        "content": "<p>issue: <a href=\"https://github.com/zulip/zulip/pull/2746\" title=\"https://github.com/zulip/zulip/pull/2746\">#2746</a></p>",
        "id": 849698,
        "sender_full_name": "Yash RE",
        "timestamp": 1586359067
    },
    {
        "content": "<p>I think there’s a strong use case for “lurking “.  I know you can’t truly privately lurk, but sometimes you want to lurk without bringing unnecessary attention to yourself.</p>",
        "id": 849699,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586359101
    },
    {
        "content": "<p>yeah, thinking about it more, since you can read streams without being subscribed, maybe it is really nobody else's business who is subscribed to which public stream.</p>",
        "id": 849700,
        "sender_full_name": "cypherpunks",
        "timestamp": 1586359303
    },
    {
        "content": "<p>It fine to create a new issue for this, so it doesn’t get lost as easily.  Just link back to the issue and summarize the most salient points.</p>",
        "id": 849701,
        "sender_full_name": "Steve Howell",
        "timestamp": 1586359319
    }
]