[
    {
        "content": "<p>Hey folks! With the unmuting topics feature <a href=\"#narrow/stream/101-design/topic/unmuting.20in.20muted.20streams/near/1555713\">merged</a> ( <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span> ), we can start thinking about the next major feature in this direction, which will be the ability to subscribe to a topic (<a href=\"https://github.com/zulip/zulip/pull/6027\">#6027</a>). This will let users receive notifications for topics they care about, along with other features like a Recent conversations filter,  and other TBD details (e.g., see ideas in this <a href=\"https://github.com/zulip/zulip/issues/6027#issuecomment-605726226\">comment</a>).</p>\n<p>The first design question it would be useful to settle is what we should actually call this feature. Some ideas that have come up in the past:</p>\n<ol>\n<li>\"Follow topic\" / \"Followed topic\" is what we've been primarily calling this in our internal discussions.</li>\n<li>\"Subscribe to topic\" / \"Subscribed topic\" is how <a href=\"https://github.com/zulip/zulip/pull/6027\">#6027</a> describes it. I don't love this one, because it's a significantly different concept from subscribing to a stream, and we don't want to conflate them.</li>\n<li>\"Watch topic\" / \"Watched topic\" (used in the description for <a href=\"https://github.com/zulip/zulip/pull/6027\">#6027</a>).</li>\n</ol>\n<p>There is also some discussion of \"starred topics\" (<a href=\"https://github.com/zulip/zulip/pull/4271\">#4271</a>) and  \"my topics\", but I think these concepts are a bit different.</p>\n<p>Thoughts?</p>",
        "id": 1555783,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1682465775
    },
    {
        "content": "<p>I like \"Follow topic\" more, I agree subscribing and following are two different things. I don't like \"Watch topic\" but it sounds ok to me.</p>",
        "id": 1555900,
        "sender_full_name": "Lalit",
        "timestamp": 1682478712
    },
    {
        "content": "<p>I think the \"Watch topic\" name idea might have come from GitHub's repository \"watch\" feature instead of it being called \"follow\"?</p>",
        "id": 1555901,
        "sender_full_name": "Lalit",
        "timestamp": 1682478876
    },
    {
        "content": "<p>I recommend going with \"Follow topic\" or \"Followed topic\". It's a clear and concise term that accurately conveys the action being taken by the user. \"Subscribe to topic\" is too similar to subscribing to a stream, which could cause confusion. \"Watch topic\" could also work.</p>",
        "id": 1556031,
        "sender_full_name": "Akarsh Jain",
        "timestamp": 1682511641
    },
    {
        "content": "<p>I really like the idea of <code>Follow</code> topics because it gives you a sense that you intentionally want to know everything about something, just like how we follow someone on social media. On the other hand, <code>Watch</code> is more of a Github terminology and does not convey the full meaning.</p>",
        "id": 1556121,
        "sender_full_name": "Palash Baderia",
        "timestamp": 1682518852
    },
    {
        "content": "<p>The term \"follow\" is a common one, but it usually means something different from this: it means something more like the effect of subscribing to a stream, or unmuting a topic in a muted stream.</p>\n<p>In particular, if you \"follow\" an account on Facebook or Twitter (rip) or Mastodon or other social media, that typically means that you'll get that account's activity in your feed, mixed in with lots of others, whenever you go and check Facebook or Twitter or Mastodon or etc. The effect is pretty similar to what happens when you subscribe to a stream or unmute a topic in Zulip, and start getting it in your home view on Zulip (be that \"Recent conversations\", or \"All messages\", or the mobile inbox screen.)</p>",
        "id": 1556689,
        "sender_full_name": "Greg Price",
        "timestamp": 1682565600
    },
    {
        "content": "<p>\"Follow\" on social media typically does <em>not</em> mean that every message on the followed account gets raised to the same level as a direct message to you or an @-mention of you, so that you get actively notified. But that's what this feature would do.</p>\n<p>So I think if we call this feature \"follow\", we're going to have a lot of people recognize the term… and then be surprised at what the feature does. So that's unhappy.</p>\n<p>And then it'll also make it harder for people to figure out the \"unmute topic\" feature. When they're looking for that feature, and they see \"Follow topic\", they'll choose \"Follow topic\" because the name seems to pretty clearly tell them it's the option they're looking for.</p>",
        "id": 1556690,
        "sender_full_name": "Greg Price",
        "timestamp": 1682565748
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/subscribing.20to.20topics.20terminology/near/1555783\">said</a>:</p>\n<blockquote>\n<p>This will let users receive notifications for topics they care about, along with other features like a Recent conversations filter,  and other TBD details (e.g., see ideas in this <a href=\"https://github.com/zulip/zulip/issues/6027#issuecomment-605726226\">comment</a>).</p>\n</blockquote>\n<p>That comment is interesting. It's on <a href=\"https://github.com/zulip/zulip/pull/6027\">#6027</a>, which is titled \"Subscribing to topics within a stream for push notifications\". But the comment lists 6 different behaviors they want, and… none of them involve notifications:</p>\n<blockquote>\n<p>A few of us ended up <a href=\"https://julialang.zulipchat.com/#narrow/stream/137793-zulip/topic/threads.20view.3F\">talking about this on the Julia zulip</a> and we'd really like this feature as more people migrate over from our busier slack community. Are there any blockers on it happening or is it just a matter of somebody finding the time to write it?</p>\n<p>Explicitly, the changes I'd like are:</p>\n<ol>\n<li>Users can subscribe and unsubscribe to/from topics</li>\n<li>Creating or replying to a topic automatically subscribes you (default, optional)</li>\n<li>A view or pseudo-stream is provided that contains only your subscribed topics</li>\n<li>A new keybind is provided to \"go to next unread subscribed topic\"</li>\n<li>A new row in the notifications setting window for subscribed topics</li>\n<li>The unread count can be changed from \"unread in all subscribed streams\" to \"unread in subscribed topics\"</li>\n</ol>\n</blockquote>\n<p>In particular, now that we have <a href=\"https://github.com/zulip/zulip/pull/2517\">#2517</a> unmuted topics, you can get all of these points except (2) by muting the topic, and translating \"subscribe\" as \"unmute\".</p>\n<p>(And we should do (2) anyway: when you write a message in a muted stream, we should automatically unmute that topic for you. Do we have an issue for that?)</p>",
        "id": 1556691,
        "sender_full_name": "Greg Price",
        "timestamp": 1682566017
    },
    {
        "content": "<blockquote>\n<p>(And we should do (2) anyway: when you write a message in a muted stream, we should automatically unmute that topic for you. Do we have an issue for that?)</p>\n</blockquote>\n<p>The current behavior is to show a banner informing the user if and when they send a message to a muted topic / stream. It also has a button to unmute the topic. -- <a href=\"https://github.com/zulip/zulip/pull/25112\">#25112</a><br>\n<a href=\"/user_uploads/2/ea/mt69qP_NmSBku6JvIzDj8JZI/Screenshot-from-2023-04-27-10-30-17.png\">unmute-banner</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/ea/mt69qP_NmSBku6JvIzDj8JZI/Screenshot-from-2023-04-27-10-30-17.png\" title=\"unmute-banner\"><img src=\"/user_uploads/2/ea/mt69qP_NmSBku6JvIzDj8JZI/Screenshot-from-2023-04-27-10-30-17.png\"></a></div>",
        "id": 1556759,
        "sender_full_name": "Prakhar Pratyush",
        "timestamp": 1682571939
    },
    {
        "content": "<blockquote>\n<p>In particular, now that we have <a href=\"https://github.com/zulip/zulip/pull/2517\">#2517</a> unmuted topics, you can get all of these points except (2) by muting the topic, and translating \"subscribe\" as \"unmute\".</p>\n</blockquote>\n<p>I Agree. (Except point 5)</p>\n<p>We don't have: A new row in the notifications setting window for subscribed topics.<br>\nI think the user's perspective was to be able to configure per-topic notification_settings like email/push? </p>\n<p>(But as <span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> mentioned \"none of them involve notifications\"; so for controlling the mentioned behaviors, we have 'Topics' setting panel).</p>",
        "id": 1556761,
        "sender_full_name": "Prakhar Pratyush",
        "timestamp": 1682572106
    },
    {
        "content": "<p>Regarding notifications:</p>\n<p>The expected behavior is to get notified for @-mention and/or any message in the 'Followed topic'. -- <a href=\"https://github.com/zulip/zulip/pull/12309\">#12309</a></p>\n<p><a href=\"https://github.com/zulip/zulip/issues/12309#issuecomment-493275629\">First bullet point</a> from <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> 's comment.</p>\n<blockquote>\n<p>We should have a new category in \"notification settings\" called \"Topics I follow\" (or something like that) that lets one configure email/push/etc. notifications (similar to \"Private messages and mentions\" in prominence).</p>\n</blockquote>",
        "id": 1556772,
        "sender_full_name": "Prakhar Pratyush",
        "timestamp": 1682575324
    },
    {
        "content": "<p>Yeah, like <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> suggested, I think we'll make the notifications configurable, but the default config would probably be notifying for every message, like @-mentions and PMs.</p>",
        "id": 1556941,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1682611172
    },
    {
        "content": "<p>So a few details of the design to lay out, using \"follow\" as the term just to avoid ambiguity:</p>\n<ul>\n<li>As we're currently imagining it, the current mute/inherit/unmute topic set of options would become a set of 4 options for your notification preferences for a stream: \"mute/default/unmuted (even if stream muted)/follow\". I except generally the set of options would always appear together in contexts where we're not presenting just \"The current configuration for this stream\". </li>\n<li>The current plan is definitely to have a row in the \"notification settings\" table for \"topics I follow\" -- so you'd be able to set a potentially different notifications policy for them -- or not, at your discretion. (I can imagine some users wanting to not get email/push notifications for followed topics, but still wanting to be able to filter to them in \"Recent conversations\" or the future Inbox view).</li>\n<li>I expect we'd auto-follow a topic when you a send a message to it, but we might want to make that configurable -- I can imagine some users preferring to only do it explicitly. For example, one setting might be \"Follow topics I started\", another \"Follow topics where I send a message\", and another \"Follow topics manually only\".</li>\n</ul>",
        "id": 1557020,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1682614167
    },
    {
        "content": "<p>One data point on terminology is that Discord uses \"Follow\" for which conversations in a Forum Channel that you're subscribed to. (Though by default every user is subscribed to every channel, and Discord only very recently added the ability to unsubscribe at all). Sending a message in a forum channel thread automatically marks you as \"Following\" the thread. I think that \"Follow\" behavior is probably most similar to a model of \"All forum channels are muted streams, and Follow is similar to unmuting a topic/thread within one of those channels\". (For example, Discord doesn't show the forum channel as unread if the only new unread messages are in threads you haven't Followed.). </p>\n<p>To be honest I'm not sure their design totally makes sense (E.g. AFAIK there's no way to just \"Follow\" every new thread in a forum channel so you get to see when there's new content), but it is the main use case I'm aware of \"Following a thread\" in a chat app, so surely is relevant to how users will perceive the name.</p>\n<p><a href=\"https://support.discord.com/hc/en-us/articles/6208479917079-Forum-Channels-FAQ\">https://support.discord.com/hc/en-us/articles/6208479917079-Forum-Channels-FAQ</a> talks about the feature in general but mostly other aspects of it's settings; there's probably a better link.</p>",
        "id": 1557023,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1682614598
    },
    {
        "content": "<p>I think it's worth thinking a little about the user-level use cases. Like, one use case is that you're a user who mostly just watches the community, or a new user who joined only to ask a single question, and like 90% of your interest in seeing replies to that one conversation where you asked it. And for that case, I think what's really important is that the default is that you to automatically follow topics you post in and be automatically setup for that to result in your getting notifications when someone replies.</p>\n<p>This would basically eliminate the need to mention users who post questions in <a class=\"stream\" data-stream-id=\"31\" href=\"/#narrow/stream/31-production-help\">#production help</a>, for example, which is the main situation right now where Zulip's notifications model requires one to mention users just to make sure they see something that surely of interest to them.</p>",
        "id": 1557028,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1682614833
    },
    {
        "content": "<p>From a product design standpoint, that's the core problem that I think something like \"Follow topic\" is there to solve that \"Unmute topic\" cannot -- in a busy community where you're default-subscribed to streams with hundreds of messages a day, it's easy for your own conversations to get lost in the noise, even when you haven't muted anything.</p>",
        "id": 1557032,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1682614965
    },
    {
        "content": "<p>What I worry about with a term like \"Subscribe\" is that we currently use it to refer to your subscription to a stream, and if we renamed \"Unmute\" to \"Subscribe\", then you could be \"Subscribed to stream <a class=\"stream\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design\">#design</a>\", which you've muted, and be offered the ability to \"Subscribe to <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/redesign.20tweaks\">#design &gt; redesign tweaks</a>\", and I'm not sure how to explain that situation clearly.</p>",
        "id": 1557035,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1682615084
    },
    {
        "content": "<p>Whereas with something like \"Follow this topic\", the vision would be that we'd have things like an item in the left sidebar (maybe implemented as a filtered version of Recent conversations) to see just the topics you're following (where you can also filter to just the Unread ones) and get them prioritized over other content in the organization. </p>\n<p>And for example, maybe in the left sidebar, unread messages in topics you follow would be prioritized over other unread messages for what to include without opening \"more topics\".</p>\n<p>And in addition to that, you'd be able to configure email/push notifications if that's your preference.</p>",
        "id": 1557037,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1682615314
    },
    {
        "content": "<p>I think folks generally agree that we don't want to use \"subscribe\" to topics, but I'm not sure <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> 's comments above give a strong indication as to whether we're better off with \"follow\", \"watch\", or some other new term we come up with?</p>",
        "id": 1557088,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1682618518
    },
    {
        "content": "<p>I guess the main question <span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> flagged is whether thinking of the Zulip feature we plan to build (laid out in more detail by <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> ) as similar to \"following\" that folks might be familiar with from social apps is helpful or unhelpful.</p>",
        "id": 1557089,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1682618655
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/subscribing.20to.20topics.20terminology/near/1557035\">said</a>:</p>\n<blockquote>\n<p>What I worry about with a term like \"Subscribe\" is that we currently use it to refer to your subscription to a stream, and if we renamed \"Unmute\" to \"Subscribe\", then you could be \"Subscribed to stream <a class=\"stream\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design\">#design</a>\", which you've muted, and be offered the ability to \"Subscribe to <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/redesign.20tweaks\">#design &gt; redesign tweaks</a>\", and I'm not sure how to explain that situation clearly.</p>\n</blockquote>\n<p>This really nails the issue (in a way that makes my head hurt a bit--but that's the issue itself, not Tim's summary here).</p>\n<p>I wonder if a word like <em>monitor</em> wouldn't be useful to try on for size? I think of myself as monitoring the news when there's a world event of import, or monitoring my dog when he's out in the yard unsupervised. Maybe it's too idiolectic, but <em>following the news</em> or <em>following the dog</em> has a much more persistent connotation than <em>monitoring</em>.</p>\n<p>Of course, would users understand what it means to <em>monitor a topic</em>, even with really rock-solid UI copy explaining their actions, choices, etc....</p>",
        "id": 1557186,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1682622346
    },
    {
        "content": "<p>Not sure how I feel about it, but maybe \"track topic\" is another alternative?</p>",
        "id": 1557288,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1682625162
    },
    {
        "content": "<p>I like \"monitor,\" though that's probably slightly from being familiar with its use in radio terminology, where it means \"I'm listening on this frequency, hangin' out\"</p>",
        "id": 1557291,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1682625227
    },
    {
        "content": "<p>/poll What term should we use for subscribing to a topic for notifications (perhaps alongside some special treatment in the UI)?<br>\nFollow topic / Followed topic<br>\nWatch topic / Watched topic<br>\nMonitor topic / Monitored topic<br>\nTrack topic / Tracked topic</p>",
        "id": 1561174,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1683146773
    },
    {
        "content": "<p>Heh, I guess \"follow topic\" is the clear favorite above. I don't think we've fully resolved <span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> 's concern that our \"follow topic\" isn't quite the same as following an account on Twitter/Facebook/Instagram, but maybe it still makes sense to move forward with it for now.</p>\n<p>Chatting with <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> offline, his take on that concern is that (a) \"follow\" is not totally consistent between other apps, so user expectations won't be super clearly defined, and (b) our \"follow topic\" concept if flexible (with configurable notification settings), so you can tweak the configuration to match what you want.</p>",
        "id": 1563624,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1683563167
    },
    {
        "content": "<p>FTR <a href=\"https://github.com/zulip/zulip/pull/25673\">#25673</a> is the issue for this, and <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/notifications.20of.20Followed.20Topics\">#design &gt; notifications of Followed Topics</a> has more discussion.</p>",
        "id": 1572526,
        "sender_full_name": "Abhijeet Bodas",
        "timestamp": 1684493157
    }
]