[
    {
        "content": "<p>When playing with the Inbox view, I noticed that it can be a bit confusing when your search results are inside collapsed streams.</p>\n<p><a href=\"/user_uploads/2/35/F_iubhJuBiQJWMBKjzwiWdfR/Screen-Shot-2023-09-14-at-12.38.10-PM.png\">Screen-Shot-2023-09-14-at-12.38.10-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/35/F_iubhJuBiQJWMBKjzwiWdfR/Screen-Shot-2023-09-14-at-12.38.10-PM.png\" title=\"Screen-Shot-2023-09-14-at-12.38.10-PM.png\"><img src=\"/user_uploads/2/35/F_iubhJuBiQJWMBKjzwiWdfR/Screen-Shot-2023-09-14-at-12.38.10-PM.png\"></a></div><p>I think keeping streams with search results in them collapsed is <em>probably</em> good. But I was thinking that it would be helpful if the stream unread counts only included unreads from the conversations your search results (e.g., <code>8</code> for <a class=\"stream\" data-stream-id=\"2\" href=\"/#narrow/stream/2-general\">#general</a> in the screenshot above). This would apply to both collapsed and uncollapsed streams.</p>\n<p>Does that sound right? Should this rule apply in the left sidebar as well (e.g., <code>10</code> for <a class=\"stream\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design\">#design</a> in the screenshot below)?</p>\n<p><a href=\"/user_uploads/2/b/9aWwnmUVwQn4DJnkl76FQVxC/Screen-Shot-2023-09-15-at-9.37.17-AM.png\">Screen-Shot-2023-09-15-at-9.37.17-AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/b/9aWwnmUVwQn4DJnkl76FQVxC/Screen-Shot-2023-09-15-at-9.37.17-AM.png\" title=\"Screen-Shot-2023-09-15-at-9.37.17-AM.png\"><img src=\"/user_uploads/2/b/9aWwnmUVwQn4DJnkl76FQVxC/Screen-Shot-2023-09-15-at-9.37.17-AM.png\"></a></div>",
        "id": 1641239,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1694796119
    },
    {
        "content": "<p>If we had a design for showing unread <em>topic</em> counts rather than unread <em>message</em> counts, I could also see that being helpful in the search results context. (I know <span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> did some brainstorming around that idea for the left sidebar.)</p>",
        "id": 1641240,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1694796252
    },
    {
        "content": "<p>I feel the left sidebar doesn't have the same issue, since the search box is below the total?</p>",
        "id": 1641269,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1694797676
    },
    {
        "content": "<p>For the Inbox, only including counts from the filter would be useful, but also could be confusing if reducing the totals and it not being clear that a filter is being used?</p>\n<p>There could be a toggle which hides those which don't match, like you say. Possibly if toggled the other way, it could also show a column with the full unread total for that narrow, as an illustration akin to <code>matches / total</code>.</p>",
        "id": 1641275,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1694797968
    },
    {
        "content": "<p>Yeah I like this proposed change for inbox but think it doesn't feel right for the left sidebar; in part because the main top-level filtering in the left sidebar that is above stream rows exclusively targets stream names -- it doesn't look at topics at all.</p>",
        "id": 1641322,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1694801164
    },
    {
        "content": "<p>Ah, just to clarify -- the screenshot/proposal was for filtering <em>topics</em> in the \"more topics' view. I don't think this question arises for filtering stream names, since there's no overall counter in that area.</p>",
        "id": 1641683,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1694824908
    },
    {
        "content": "<p>I suppose a similar summary may come up if/when we add stream groups in the left sidebar, but let's leave that aside for now.</p>\n<p>The key difference here is that the inbox filtering feature filters topic names, i.e. the second-level objects.</p>\n<p>We have the capability to do that in the left sidebar if we really wanted to -- we do know the topic name for every unread count in the sidebar when doing the calculations.</p>\n<p>Anyway my proposal is that we do nothing in the left sidebar for now and get the inbox view experience working how we want it, and then see if anyone asks for the left sidebar to work like the inbox does with filters. If nobody asks to change that, I think that's a pretty good case for preserving the current behavior.</p>",
        "id": 1642236,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1695051287
    },
    {
        "content": "<p>OK, I filed <strong>Filter stream unread counts in Inbox view</strong> <a href=\"https://github.com/zulip/zulip/pull/26773\">#26773</a> just for the Inbox part of this.</p>",
        "id": 1642426,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695065228
    }
]