[
    {
        "content": "<p>tab navigation is currently quite broken -- see <a href=\"https://github.com/zulip/zulip/pull/5024\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/5024\">#5024</a>, <a href=\"https://github.com/zulip/zulip/pull/5024\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/5024\">#5024</a>, and discussion in <a href=\"https://github.com/zulip/zulip/pull/5479\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/5479\">#5479</a> -- there are many cases in which the tab sequence does not follow a logical order, such as:</p>\n<ul>\n<li>press enter while focused on a PM/thread message so compose box pops up &amp; focuses</li>\n<li>\n<p>shift+tab to go 'back' -&gt; focuses on URL</p>\n</li>\n<li>\n<p>when focused on compose box, press escape to close it</p>\n</li>\n<li>attempt to navigate with shift+tab: focus on URL<br>\n*ENTER while focused on a PM/thread so the compose box pops up</li>\n</ul>\n<p>as mentioned in one of the issues, there are also a bunch of hidden elements that hinder accessibility-- in the above use cases, shift+tabbing might take a while to get to the URL. <br>\nwe should think about what the most intuitive behaviour for tab navigation would be and how to go about sorting out these issues!<br>\nping <span class=\"user-mention\" data-user-email=\"showell@zulipchat.com\" data-user-id=\"58\">@Steve Howell</span> !</p>",
        "id": 234340,
        "sender_full_name": "Vaida Plankyte",
        "timestamp": 1498124613
    },
    {
        "content": "<p>I think our overall strategy for fixing tab navigation should be as follows:</p>\n<ul>\n<li>Fix all accessibility issues first.</li>\n<li>Then fix productivity issues.</li>\n</ul>\n<p>Some of our accessibility fixes will actually fix general productivity by fixing obscure tabbing bugs like some of the ones that <span class=\"user-mention\" data-user-email=\"vaidaplankyte@gmail.com\" data-user-id=\"1906\">@Vaida Plankyte</span> mentions above.</p>",
        "id": 234618,
        "sender_full_name": "Steve Howell",
        "timestamp": 1498147184
    },
    {
        "content": "<p>When it comes to productivity issues, our bar for success should be that a user should be able to complete all common tasks on Zulip...</p>\n<ul>\n<li>without having to use a mouse (or similar pointing device)</li>\n<li>without having to memorize a zillion hotkeys</li>\n</ul>\n<p>A good example of where we are currently successful is the message pane.  If you want to navigate the message pane without a mouse, you can use the following fairly intuitive sequence:</p>\n<ul>\n<li>Hit escape to either close the compose box or any popup menus.</li>\n<li>Use the arrow keys for fine-grained navigation.</li>\n<li>Use page-up, page-down, home, and end for quicker navigation.</li>\n<li>Hit enter to reply to a message.</li>\n</ul>\n<p>For users that don't like to get out of normal typing position and are willing to do a few advanced things, the situation is even better:</p>\n<ul>\n<li>map caps lock to escape</li>\n<li>use vim keys (hjkl) instead of arrow keys</li>\n<li>use space/shift-space instead of page-down/page-up</li>\n</ul>",
        "id": 234624,
        "sender_full_name": "Steve Howell",
        "timestamp": 1498147485
    },
    {
        "content": "<p>The rest of our app is basically atrocious when it comes to keyboard navigation:</p>\n<ul>\n<li>The sidebars support tabbing, but trying to focus on a sidebar element is difficult.  And then we also do the wrong things when you have topics expanded, etc.</li>\n<li>The settings pages don't always focus on elements to allow you to do things like arrow through the various settings panes.</li>\n<li>The icons for emojis, attachments, markdown help, and previews aren't reachable by the keyboard in the compose box.</li>\n</ul>",
        "id": 234635,
        "sender_full_name": "Steve Howell",
        "timestamp": 1498147704
    },
    {
        "content": "<p>Once we get the app in a good state from accessibility, I am hoping we can get a few different folks to work on some of the navigation quirks.  We'll probably want to have some up front discussion on strategies.  Some things will be easy to fix by just using correct markup and basic jQuery.  For some of the more advanced tabbing issues, like making the stream sidebar work and accessing popup menus, there might be some up front decisions.</p>",
        "id": 234653,
        "sender_full_name": "Steve Howell",
        "timestamp": 1498147888
    },
    {
        "content": "<p>i'll focus on the errors the audit tool throws &amp; accessibility issues, and also create issues for the audit tool ones.</p>",
        "id": 235324,
        "sender_full_name": "Vaida Plankyte",
        "timestamp": 1498206554
    }
]