[
    {
        "content": "<p>Is threading done textually or is there an ID assigned to each thread?</p>",
        "id": 567824,
        "sender_full_name": "Dave Gilbert",
        "timestamp": 1524418409
    },
    {
        "content": "<p>textually</p>",
        "id": 567825,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1524418417
    },
    {
        "content": "<p>oh, that's interesting, so I guess the clients dont search back far to wire threads up, since someone could have used the same topic a while ago</p>",
        "id": 567826,
        "sender_full_name": "Dave Gilbert",
        "timestamp": 1524418472
    },
    {
        "content": "<p>The backend does. Let me see if I can find an example of it :)</p>",
        "id": 567827,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1524418587
    },
    {
        "content": "<p>I guess \"no topic\" is probably the easiest example. <a href=\"#narrow/stream/101-design/topic/(no.20topic)\" title=\"#narrow/stream/101-design/topic/(no.20topic)\">https://chat.zulip.org/#narrow/stream/101-design/topic/(no.20topic)</a>, and hit the \"Home\" key or \"page up\" a bunch of times.</p>",
        "id": 567828,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1524418639
    },
    {
        "content": "<p>A good example of a long-running topic is my daily checkins:</p>\n<p><a href=\"#narrow/stream/65-checkins/topic/Steve\" title=\"#narrow/stream/65-checkins/topic/Steve\">https://chat.zulip.org/#narrow/stream/65-checkins/topic/Steve</a></p>",
        "id": 567829,
        "sender_full_name": "Steve Howell",
        "timestamp": 1524418701
    },
    {
        "content": "<p>Interesting; not how I'd imagined, but it seems to work</p>",
        "id": 567830,
        "sender_full_name": "Dave Gilbert",
        "timestamp": 1524418811
    },
    {
        "content": "<p>We treat any two messages with the same topic name as being in the same topic narrow.  This is usually a happy coincidence, although you occasionally get the \"bark\" problem (somebody was talking about tree bark five days ago, now you're talking about your dog).  We allow you to re-assign topic names to messages with some limitations.</p>",
        "id": 567831,
        "sender_full_name": "Steve Howell",
        "timestamp": 1524418848
    },
    {
        "content": "<p>but on the WebUI (which is all I've tried) you don't aggressively reorder to connect threads, so it doesn't make that much difference - although does that mean you get notifications on the wrong bark?</p>",
        "id": 567832,
        "sender_full_name": "Dave Gilbert",
        "timestamp": 1524418929
    },
    {
        "content": "<p>When you view a stream, we keep the messages in chronological order, but you can narrow to a topic.  For the \"bark\" case, assuming you scroll back enough, you would see the \"tree\" and \"dog\" messages, and  you could edit the topic names going forward from the first dog message you sent.  (I think there may be some org settings at play here that restrict that to a degree, not sure off the top of my head.)</p>",
        "id": 567833,
        "sender_full_name": "Steve Howell",
        "timestamp": 1524419034
    },
    {
        "content": "<p>nod, thanks;  how do bridges handle it?   I guess for a room that's irc bridged you could either just keep one thread name or bridge different threads to different irc rooms</p>",
        "id": 567834,
        "sender_full_name": "Dave Gilbert",
        "timestamp": 1524419108
    },
    {
        "content": "<p>It kind of depends on what we're bridging from.  For tools that are sort of channel-only, we just have a single topic per stream.</p>",
        "id": 567837,
        "sender_full_name": "Steve Howell",
        "timestamp": 1524419295
    },
    {
        "content": "<p>nod; thanks</p>",
        "id": 567838,
        "sender_full_name": "Dave Gilbert",
        "timestamp": 1524419317
    }
]