[
    {
        "content": "<p>We have a complex set of time-based restrictions on topic editing, which can result in unexpected behavior when editing and resolving topics (cf. <a class=\"stream-topic\" data-stream-id=\"9\" href=\"/#narrow/stream/9-issues/topic/if.20marked.20as.20resolved.20it.20duplicates.20the.20argument\">#issues &gt; if marked as resolved it duplicates the argument</a> for a recent example). Rather than specifically trying to patch resolving topics, I  think it's worth discussing whether we should change/simplify the system overall.</p>\n<p>Based on the spelunking <span class=\"user-mention\" data-user-id=\"10242\">@Sahil Batra</span> did for the <a class=\"stream-topic\" data-stream-id=\"9\" href=\"/#narrow/stream/9-issues/topic/topic.20resolution.20error\">#issues &gt; topic resolution error</a> discussion and the help center docs, the current time-based rules are (with some caveats below):</p>\n<ol>\n<li>In general, only administrators and moderators can edit the topics of messages that were sent more than 3 days ago, regardless of what topic editing permissions are set to. (<a href=\"https://zulip.com/help/configure-who-can-edit-topics\">https://zulip.com/help/configure-who-can-edit-topics</a>)</li>\n<li>If you are a moderator or admin, the 3-day restriction does not affect you.</li>\n<li>If message editing is allowed, editing the topic of your own message is <em>also</em> controlled by the time limit for editing messages (<a href=\"https://zulip.com/help/configure-message-editing-and-deletion\">https://zulip.com/help/configure-message-editing-and-deletion</a>). In particular, if the time limit for editing messages is N days and N &gt; 3, you can edit topics of your messages for N days. (Someone should check what happens when N &lt; 3, but I would think editing the topic would be allowed.)</li>\n</ol>",
        "id": 1357753,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1648771406
    },
    {
        "content": "<p>In general, if you can't edit the topic of a message, you just won't see the menu option for that message. But based on testing on <code>dev</code>,  the behavior doesn't entirely match the above description.</p>\n<p>In particular, consider this situation:</p>\n<ul>\n<li>You are a regular user (not a moderator/admin).</li>\n<li>You're allowed to edit your messages (say, without a time limit).</li>\n</ul>",
        "id": 1357755,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1648771585
    },
    {
        "content": "<p>If you sent a message to some topic more than three days ago, it turns out you can change the topic of that message and all messages that were sent afterwards to the same topic. This is regardless of whether they were sent more than 3 days ago, or who they were sent by.</p>",
        "id": 1357761,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1648771921
    },
    {
        "content": "<p>You can do it via the three-dot message menu by by choosing the \"Change later messages to this topic\" option. You can also do it by editing the topic in the message header bar, as long as you can get a header bar. You always have one if your message was the first in the topic, but you can also get one via search, and it works the same way.</p>",
        "id": 1357784,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1648773082
    },
    {
        "content": "<p>The motivation for the 3-day time limit:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/9-issues/topic/topic.20resolution.20error/near/1261383\">said</a>:</p>\n<blockquote>\n<p>Do we just want to remove the \"3 days\" restriction?  In general I don't think that sort of restriction with a hardcoded time limit is a good pattern.</p>\n<p>However, the feature as presently designed does protect against a potentially very annoying possible form of abuse, where a random user renames all the historical topics in a stream, destroying information.  </p>\n<p>So I'm not sure I see a straightforward way to remove the topic editing limitation without creating the other.  </p>\n<p>I do think for resolving topics in particular, that we could exempt \"resolve topic\" from the 3-day restriction, since the worst a bad actor could do is toggling the resolved status of every topic, which is not particularly destructive.</p>\n</blockquote>",
        "id": 1357786,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1648773196
    },
    {
        "content": "<p>However, the present situation is super complicated! And while it prevent sabotage by a <em>random</em> user, it doesn't do that if the user sent a message to that topic earlier.</p>",
        "id": 1357789,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1648773366
    },
    {
        "content": "<p>I think the core of what makes it tricky to manage the UI is being able to edit the topic for some messages but not others. We have a couple of layers of this:</p>\n<ol>\n<li>The concept of having a time limit for editing topics.</li>\n<li>The idea of having different topic editing permissions for your own messages vs. someone else's.</li>\n</ol>\n<p>Even (1) creates some complexity, but (2) is what we are currently failing to fully implement. And fundamentally being able to move your own messages but not other people's is useful only in a subset of situations when you might want to change a topic.</p>",
        "id": 1357802,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1648773675
    },
    {
        "content": "<p>So one possible direction would be:</p>\n<ol>\n<li>Topic editing permissions are always the same, regardless of whether the message was sent by you or someone else. Being able to edit message content does not mean that you can edit the topic.</li>\n<li>Change the \"3 days\" restriction to be a variable, and make it not apply in the special case of resolving topics.</li>\n</ol>",
        "id": 1357805,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1648773837
    },
    {
        "content": "<blockquote>\n<p>If message editing is allowed, editing the topic of your own message is also controlled by the time limit for editing messages (<a href=\"https://zulip.com/help/configure-message-editing-and-deletion\">https://zulip.com/help/configure-message-editing-and-deletion</a>). In particular, if the time limit for editing messages is N days and N &gt; 3, you can edit topics of your messages for N days. (Someone should check what happens when N &lt; 3, but I would think editing the topic would be allowed.)</p>\n</blockquote>\n<p>I don't think this is the current behavior as per the code. Topic editing depends on message editing permission only in one way, i.e. - we do not allow topic editing when message editing is set to <code>Never</code>. Otherwise if time limit of editing messages is set to N days (doesn't matter if N &gt; 3 or N &lt; 3), editing topic of one's own message is allowed always. <del>We should altleast make this clear in the docs, till we decide what should the correct behavior here.</del></p>",
        "id": 1358021,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1648810281
    },
    {
        "content": "<p>Also, the docs mentions this in the bullet points below the table -</p>\n<blockquote>\n<p>Allow message editing can be set to Never, Any time or Up to [a customizable time limit] after posting. If set to Never, users cannot edit message topics either. For any other value, users can edit message topics at any time.</p>\n</blockquote>",
        "id": 1358022,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1648810490
    },
    {
        "content": "<p>Ohh, interesting. That is perhaps even more confusing than I thought. :)</p>",
        "id": 1358195,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1648841216
    },
    {
        "content": "<p>OK, let me try to repost the summary of the situation; I think the discussion above is all still applicable.</p>\n<ol>\n<li>In general, only administrators and moderators can edit the topics of messages that were sent more than 3 days ago, regardless of what topic editing permissions are set to. (<a href=\"https://zulip.com/help/configure-who-can-edit-topics\">https://zulip.com/help/configure-who-can-edit-topics</a>)</li>\n<li>If you are a moderator or admin, the 3-day restriction does not affect you.</li>\n<li>If message editing is allowed in the organization, you can <em>always</em> edit the topic of <strong>your own messages</strong> (no time limit). This is the case <em>regardless</em> of the time limit set on message content editing. (<a href=\"https://zulip.com/help/configure-message-editing-and-deletion\">https://zulip.com/help/configure-message-editing-and-deletion</a>)</li>\n</ol>",
        "id": 1358200,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1648841397
    },
    {
        "content": "<p><em>bump</em> for feedback on this, at least from <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> .</p>",
        "id": 1360830,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649201457
    },
    {
        "content": "<p>I filed <a href=\"https://github.com/zulip/zulip/pull/21739\">#21739</a> after some live discussion/feedback. <span class=\"user-mention\" data-user-id=\"10242\">@Sahil Batra</span> would you be up for taking this on?</p>",
        "id": 1363138,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649458782
    },
    {
        "content": "<p>I think one detail that we need to think about is the case that you sent a message to a new topic and that topic name has a typo -- I think that corner case is that motivated the extra permissions for moving your own topics. It feels like a bad experience to not be able to fix your own typo.</p>",
        "id": 1363151,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649459048
    },
    {
        "content": "<p>I don't think we should do anything about that corner case. Suppose someone sends a reply 5 seconds after your message... now what?</p>",
        "id": 1363153,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649459113
    },
    {
        "content": "<p>Well, I was thinking about a refinement that lets you rename a topic that contains only messages that you yourself sent.</p>",
        "id": 1363154,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649459141
    },
    {
        "content": "<p>The org admins can allow topic editing for 2 minutes if they just want typo fixes to be possible.</p>",
        "id": 1363156,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649459198
    },
    {
        "content": "<p>Well, but they probably want to allow moderators to allow topic editing for any period of time but normal users to be able to do it for 2 minutes.</p>",
        "id": 1363160,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649459220
    },
    {
        "content": "<p>And that preference would I think not be possible to represent with the currently imagined model?</p>",
        "id": 1363161,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649459231
    },
    {
        "content": "<p>We can add that level of fine-grained permission as a follow up.</p>",
        "id": 1363162,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649459251
    },
    {
        "content": "<p>But these settings shouldn't involve complex rules about who sent messages to what topic.</p>",
        "id": 1363163,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649459291
    },
    {
        "content": "<p>Well I think we need to think about this type of problem statement in order to think about the data model we want for settings.</p>",
        "id": 1363164,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649459321
    },
    {
        "content": "<p>Sure, so in a future iteration (but not now), I can imagine setting time limits on a per-role basis.</p>",
        "id": 1363166,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649459350
    },
    {
        "content": "<p>OK, I think that means we should name variables for the settings (etc.) in a way that imagines such a refinement might happen.</p>",
        "id": 1363170,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649459442
    },
    {
        "content": "<p>What do you think we'd recommend (or set as the default values) of these settings for an open organization?</p>",
        "id": 1363171,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649459494
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/time.20restrictions.20on.20topic.20editing/near/1363170\">said</a>:</p>\n<blockquote>\n<p>OK, I think that means we should name variables for the settings (etc.) in a way that imagines such a refinement might happen.</p>\n</blockquote>\n<p>Sure, added a note to the issue.</p>",
        "id": 1363172,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649459601
    },
    {
        "content": "<p>Hm, I was thinking allowing topic editing any time might be fine, but I guess something like 1 week is closer to the current state.</p>",
        "id": 1363174,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649459743
    },
    {
        "content": "<p>My concern here is that I think many open organizations might pick something like \"Open organization where only moderators can move topics\" -- that's certainly our configuration here. And that this change might make it impossible for normal users to fix typos in new topics that they started without asking a moderator for help (which I expect to feel frustrating).</p>",
        "id": 1363175,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649459765
    },
    {
        "content": "<p>An alternative refinement to this plan would be to allow you to change the topic for a message that you yourself if you also have permission to edit the content of the message at the current moment. (Possibly as an independent checkbox setting).</p>",
        "id": 1363176,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649459775
    },
    {
        "content": "<p>I think it's hard to avoid super-weird experiences when topic editing permissions for your own messages are not the same as for other users'. Keep in mind that our current experience is <em>buggy</em>.</p>",
        "id": 1363177,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649459836
    },
    {
        "content": "<p>That still feels like it'd be frustrating, I can imagine the thread where the first reply is \"You mispelled the topic name\" and now you're stuck.</p>",
        "id": 1363178,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649459851
    },
    {
        "content": "<p>I understand the current experience is buggy -- but the context is that we created this special 3-day permission thing in response to some very frustrated user complaints, and I'm trying to figure out how to avoid reintroducing the combination of permissions that prompted them.</p>",
        "id": 1363179,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649459920
    },
    {
        "content": "<p>Well, if you think this is critical, then maybe having per-role time limits should be part of this issue. Then you can make it 2 or 10 minutes for members and any time for moderators+, for instance.</p>",
        "id": 1363180,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649459926
    },
    {
        "content": "<p>Let me see if I can track down the original discussions around this feature.</p>",
        "id": 1363182,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649460026
    },
    {
        "content": "<p>In your proposal, when your first reply is \"You mispelled the topic name\", you can move your message, but not that reply. So it's still a mess.</p>",
        "id": 1363183,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649460076
    },
    {
        "content": "<p>Yeah, maybe I can't come up with a proposal that's better than having a different time limit for different roles.</p>",
        "id": 1363185,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649460314
    },
    {
        "content": "<p>Or at least having two time limits -- one for everyone and one for moderators. I'll need to think a bit about how to do this in the upcoming Groups model in a way that feels sane.</p>",
        "id": 1363186,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649460381
    },
    {
        "content": "<p>OK, I'll leave the issue as-is for now?</p>",
        "id": 1363187,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649460412
    },
    {
        "content": "<p>Or would you like to have multiple time limits immediately? There is already no time limit for admins, as it's written.</p>",
        "id": 1363188,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649460435
    },
    {
        "content": "<p>I think if we want to avoid unhappy users complaining about a substantial regression, we probably need it to be possible to generate a configuration where:</p>\n<ul>\n<li>Admins/moderators can move topics without a deadline.</li>\n<li>Full Members can move topics within a limited window of time (less than a week), potentially only within a stream.</li>\n</ul>\n<p>Since I think that's what I'd want for <a href=\"http://chat.zulip.org\">chat.zulip.org</a>, and expect many larger open organizations to want.</p>\n<p>There's a few configurations through which we could do this -- e.g. one option would be to have a separate \"Who + time limit\" for \"Moving messages anywhere\" and another for \"Move to a different topic within current stream\". I'm not thrilled with the complexity of the overlap possibility there, but it at least feels like it could be clearly explained with some effort.</p>",
        "id": 1363189,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649460756
    },
    {
        "content": "<p>Would resolving topics be limited in the same way, or be its own carve-out?</p>",
        "id": 1363193,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1649460916
    },
    {
        "content": "<p>I was imagining that the time limitations for moving within vs. across streams would be the same... hmm.</p>\n<p>Is it common to set different role permissions for those two? What are the use cases?</p>",
        "id": 1363199,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649461217
    },
    {
        "content": "<p>Ok, what if we just turn off the time limit for topic editing for both admins and moderators (without a setting)? And assume it's very rare to want moderators to be able to edit topics, but only for a limited time period?</p>",
        "id": 1363202,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649461298
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"12178\">Alex Vandiver</span> <a href=\"#narrow/stream/101-design/topic/time.20restrictions.20on.20topic.20editing/near/1363193\">said</a>:</p>\n<blockquote>\n<p>Would resolving topics be limited in the same way, or be its own carve-out?</p>\n</blockquote>\n<p>I was thinking that this would ideally be controlled separately, but can be a follow-on. The note on the issue:</p>\n<ul>\n<li>Ideally, resolving topics would be controlled separately from other types of topic editing; cf. <a href=\"https://github.com/zulip/zulip/pull/19955\">#19955</a>.</li>\n</ul>",
        "id": 1363206,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649461364
    },
    {
        "content": "<p>We may want to pull out the global \"resolve topic\" setting into its own issue, I guess.</p>",
        "id": 1363210,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649461467
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/time.20restrictions.20on.20topic.20editing/near/1363138\">said</a>:</p>\n<blockquote>\n<p>I filed <a href=\"https://github.com/zulip/zulip/pull/21739\">#21739</a> after some live discussion/feedback. <span class=\"user-mention silent\" data-user-id=\"10242\">Sahil Batra</span> would you be up for taking this on?</p>\n</blockquote>\n<p>Yes sure.</p>",
        "id": 1363415,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1649479915
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/time.20restrictions.20on.20topic.20editing/near/1363202\">said</a>:</p>\n<blockquote>\n<p>Ok, what if we just turn off the time limit for topic editing for both admins and moderators (without a setting)? And assume it's very rare to want moderators to be able to edit topics, but only for a limited time period?</p>\n</blockquote>\n<p>Yes, I think we can remove time limit for admins and moderators (as we do now) to handle situations like typos in topic that Tim mentioned.</p>",
        "id": 1363416,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1649480034
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"10242\">Sahil Batra</span> <a href=\"#narrow/stream/101-design/topic/time.20restrictions.20on.20topic.20editing/near/1363416\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/time.20restrictions.20on.20topic.20editing/near/1363202\">said</a>:</p>\n<blockquote>\n<p>Ok, what if we just turn off the time limit for topic editing for both admins and moderators (without a setting)? And assume it's very rare to want moderators to be able to edit topics, but only for a limited time period?</p>\n</blockquote>\n<p>Yes, I think we can remove time limit for admins and moderators (as we do now) to handle situations like typos in topic that Tim mentioned.</p>\n</blockquote>\n<p>I updated the issue accordingly.</p>",
        "id": 1363434,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649482365
    },
    {
        "content": "<p>I guess revamping the topic editing permission can also resolve some problems faced in issue <a href=\"https://github.com/zulip/zulip/pull/19886\">#19886</a> (PR <a href=\"https://github.com/zulip/zulip/pull/20293\">#20293</a>)</p>",
        "id": 1363720,
        "sender_full_name": "shlok (madrix01)",
        "timestamp": 1649531021
    },
    {
        "content": "<p>But getting the first message of the topic will still will be an issue.</p>",
        "id": 1363724,
        "sender_full_name": "shlok (madrix01)",
        "timestamp": 1649531420
    },
    {
        "content": "<p>I have started working on this issue.</p>\n<p>What we want to do if user sets time limit for editing as 0 after selecting <code>custom</code> option from the dropdown? Currently we set the dropdown to <code>never</code> in that case.<br>\nFor the delete message limit setting, we do not allow 0 as value and we show error while doing so.</p>",
        "id": 1364257,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1649677176
    },
    {
        "content": "<p>I think requiring all those custom times to be <code>&gt; 0</code> is good, including the editing time limit, since we're moving the question of whether editing is allowed into a separate checkbox.</p>",
        "id": 1364292,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649689632
    },
    {
        "content": "<p>Can we disable the \"Save\" button when the time is not valid in all these fields, and show something like, \"Time must be greater than zero.\" in the tooltip? Should I file a separate issue?</p>\n<p>If that's difficult for some reason, we should at least update the error message to be user-friendly; currently it's: <code>Save failed: Bad value for 'message_content_delete_limit_seconds': -60</code>.</p>",
        "id": 1364293,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649689846
    },
    {
        "content": "<p>Should not be much work to disable the button. Will do this in the same PR.</p>",
        "id": 1364478,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1649701068
    },
    {
        "content": "<p>Also, in some cases we currently enable/disable the other dependent settings on first saving the original setting. I think we should do that as soon as setting is changed. Like initally the <code>Allow message editing</code> was unchecked and the time limit setting was disabled. Now when I check the <code>Allow message editing</code> setting, the dropdown should be enabled just after that, not after I click <code>Save changes</code> button and then change the time limit setting again.</p>",
        "id": 1364479,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1649701204
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"10242\">Sahil Batra</span> <a href=\"#narrow/stream/101-design/topic/time.20restrictions.20on.20topic.20editing/near/1364479\">said</a>:</p>\n<blockquote>\n<p>Also, in some cases we currently enable/disable the other dependent settings on first saving the original setting. I think we should do that as soon as setting is changed. Like initally the <code>Allow message editing</code> was unchecked and the time limit setting was disabled. Now when I check the <code>Allow message editing</code> setting, the dropdown should be enabled just after that, not after I click <code>Save changes</code> button and then change the time limit setting again.</p>\n</blockquote>\n<p>Agreed!</p>",
        "id": 1364524,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649704507
    },
    {
        "content": "<p>Opened <a href=\"https://github.com/zulip/zulip/pull/21837\">#21837</a> as a first PR for this.</p>",
        "id": 1369794,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1650362341
    },
    {
        "content": "<p>I came here after trying to understand the existing documentation and searching on czo :)</p>\n<p>ZT supports most editing other than 'community' settings, but with <a href=\"https://github.com/zulip/zulip-terminal/pull/1235\">#T1235</a> <span class=\"user-mention\" data-user-id=\"22454\">@Shivam Deotarse</span> is looking at topic renaming and resolution. In ensuring I was understanding the logic I was relying on <a href=\"https://zulip.com/help/configure-message-editing-and-deletion\">https://zulip.com/help/configure-message-editing-and-deletion</a>. As per the above discussion, there are nuances on 'your' vs 'others' topics when renaming all messages in a topic, which are confusing from that page alone. That page also doesn't mention the community time limit (for topics), which I understand to be distinct from the editing time limit, and then there's the 3-day factor too - which is apparently on another page entirely! (<a href=\"https://zulip.com/help/configure-who-can-edit-topics\">https://zulip.com/help/configure-who-can-edit-topics</a>)</p>\n<p>Is there any unified (draft/developer/API) documentation(/code?) for the existing/past and any future topic editing constraints?<br>\nIn a worst case UI we can assume the user has no messages in the topic, to avoid the user id issue, but beyond that...</p>",
        "id": 1427478,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1661824586
    },
    {
        "content": "<p>Others may be more aware than me of API or developer documentation... In general, I'm hoping folks don't spend significant time improving how clients handle topic editing permissions until we can resolve <a href=\"https://github.com/zulip/zulip/pull/21739\">#21739</a>, which <span class=\"user-mention\" data-user-id=\"10242\">@Sahil Batra</span> is working on.</p>",
        "id": 1427542,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1661838191
    },
    {
        "content": "<p>I'm looking forward to future clarity too, but there will be older server versions out there to support for a while, so it needs to be handled somehow.</p>",
        "id": 1427574,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1661840857
    },
    {
        "content": "<p>I am working on adding a setting for configuring time limit for moving messages (both within and across streams). We intended to revamp the topic edit permissions such that we could show/hide the options in left sidebar popover correctly for all cases (<a href=\"#narrow/stream/9-issues/topic/topic.20resolution.20error/near/1261658\">some previous discussion</a>).</p>\n<p>But now after considering the messages as same irrespective of sender, we would still need a message object to find whether a user has permission to move message because we would check whether the time limit has passed or not. Till now moving messages across streams was independent of the message since there was no time limit, but now as per <a href=\"https://github.com/zulip/zulip/pull/21739\">#21739</a> the new setting would be applicable for both moving messages within and across streams, and there would be same issue for showing <code>Move topic</code> option as well.</p>",
        "id": 1448541,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1665596568
    },
    {
        "content": "<p>Hmm, yeah, so for users to whom the time limit applies (non-admins/non-moderators), I think ideally:</p>\n<ol>\n<li>\n<p>In the left sidebar, we would show the \"Move topic\" option if <em>all</em> messages in the topic are recent enough to move. <br>\nThough ideally we'd do something fancier for <a href=\"https://github.com/zulip/zulip/pull/20502\">#20502</a> down the line.</p>\n</li>\n<li>\n<p>In the message three-dot menu, we would only show the \"Move message\" option if the message is recent enough to move.</p>\n</li>\n<li>In the \"Move messages\" UI, we'd remove or disable the \"Move all messages in this topic\" option if the user is not allowed to move some of the messages.</li>\n</ol>\n<p>How difficult would this be?</p>",
        "id": 1448750,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1665611517
    },
    {
        "content": "<p>(2) is the current behavior and will remain as it is.</p>\n<p>For (1), we would need the first message of topic and in many cases we would not have that data in the client and would need to fetch it from server, which means a request to server everytime the popover is opened and would be quite inefficient I think. Not sure if there is any other way by which we can avoid this request to the server.</p>\n<p>Similarly for (3) we would need to get the first message of topic from server every time the modal is opened. Less inefficient than (1) but still.</p>",
        "id": 1449045,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1665641387
    },
    {
        "content": "<p>Hmm, if we offer the options, and the user tries to move messages they are not allowed to move, could we give a confirmation prompt? Something that says, roughly, \"You can't move all the messages in this topic, but you can move the latest X messages. Do you want to go ahead and do that? Y messages will remain in the current topic.\"</p>",
        "id": 1449227,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1665674117
    },
    {
        "content": "<p>For the left sidebar, do we know when the user isn't allowed to move <em>any</em> of the messages in the topic, i.e. they are all too old?</p>",
        "id": 1449228,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1665674163
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/time.20restrictions.20on.20topic.20editing/near/1449227\">said</a>:</p>\n<blockquote>\n<p>Hmm, if we offer the options, and the user tries to move messages they are not allowed to move, could we give a confirmation prompt? Something that says, roughly, \"You can't move all the messages in this topic, but you can move the latest X messages. Do you want to go ahead and do that? Y messages will remain in the current topic.\"</p>\n</blockquote>\n<p>I think this should be possible.</p>",
        "id": 1449300,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1665683611
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/time.20restrictions.20on.20topic.20editing/near/1449228\">said</a>:</p>\n<blockquote>\n<p>For the left sidebar, do we know when the user isn't allowed to move <em>any</em> of the messages in the topic, i.e. they are all too old?</p>\n</blockquote>\n<p>Not always. For this we need to check the first message of the topic, and the client may not have that and would need to fetch it from server.</p>",
        "id": 1449301,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1665683659
    },
    {
        "content": "<p>Sigh, do we really  need time-based editing options? ;)</p>",
        "id": 1449307,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1665684992
    },
    {
        "content": "<p>Anyway, it sounds like the confirmation prompt is our best path forward, then. Would it help to write out the details in an issue, or is this discussion enough to start with?</p>",
        "id": 1449308,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1665685051
    },
    {
        "content": "<p>This discussion is enough. I can start with it and will ask here only if I will need any clarifications.</p>",
        "id": 1449628,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1665729213
    },
    {
        "content": "<p>On thinking more, if we not allow moving messages whose limit has been passed, then user would have to break the topic if they really want to edit the topic. Not sure how much problem that would be.</p>",
        "id": 1449655,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1665731824
    },
    {
        "content": "<p>Do you mean that might be a problem when editing from the topic bar, or in general?</p>",
        "id": 1449661,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1665732104
    },
    {
        "content": "<p>I meant in general, user would be allowed to only move some part of the topic.</p>",
        "id": 1449669,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1665732635
    },
    {
        "content": "<p>Yeah, that's the situation where I think we should give a confirmation/warning dialog.</p>",
        "id": 1449675,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1665733079
    },
    {
        "content": "<p>This will need some thinking about how to implement. I have started a discussion at <a class=\"stream-topic\" data-stream-id=\"3\" href=\"/#narrow/stream/3-backend/topic/restrict.20topic.20editing.20for.20old.20messages\">#backend &gt; restrict topic editing for old messages</a>. <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> FYI.</p>",
        "id": 1449886,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1665767934
    }
]