[
    {
        "content": "<p>I would like to start a new discussion about what to do for the mute topic shortcut key after <a href=\"https://github.com/zulip/zulip/pull/24243\">#24243</a> is resolved.</p>\n<p>Currently, the <code>Shift + M</code> shortcut mutes or inherits a topic. However, we don't provide an option to mute topics in a muted stream, but this shortcut still works and mutes the topic in a muted stream. Should we alter this shortcut to toggle topic mute in unmuted streams and toggle topic unmute in muted streams? <br>\nAlternatively, should we alter this shortcut to only work in unmuted streams and then introduce a new shortcut to toggle unmuted topics?</p>",
        "id": 1546996,
        "sender_full_name": "Hardik Dharmani",
        "timestamp": 1681407898
    },
    {
        "content": "<p>It makes sense to me to use the same shortcut to <em>unmute</em> a topic in a muted stream, but I'd be curious to hear from other folks (it's not a shortcut I currently use).</p>",
        "id": 1547568,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1681427536
    },
    {
        "content": "<p>Yeah, agreed, it should act like the topic menu item in that respect, so if it's a muted stream, you can move it to the unmuted state.</p>",
        "id": 1547626,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1681429968
    },
    {
        "content": "<p>By the way, the <code>?</code> menu is already basically consistent with this (\"Toggle topic mute\"), though we'd want to think about explaining it more clearly.</p>",
        "id": 1547669,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1681431843
    },
    {
        "content": "<p>I will create a PR soon to alter the shortcut to work as per the stream. Once finalized in this thread, I will also update the PR to include the explanation in the <code>?</code> menu.</p>",
        "id": 1547812,
        "sender_full_name": "Hardik Dharmani",
        "timestamp": 1681457555
    },
    {
        "content": "<p>I filed <strong>Shift + M should unmute topics in muted streams</strong> <a href=\"https://github.com/zulip/zulip/pull/25125\">#25125</a>. Let's do any documentation changes in a separate pass.</p>",
        "id": 1548007,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1681490062
    },
    {
        "content": "<p>(We can keep discussing here if folks have ideas.)</p>",
        "id": 1548008,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1681490070
    }
]