[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/narrow.20to.20topic.2Fpms.20when.20composing/near/1331761\">said</a>:</p>\n<blockquote>\n<p>There's a lot of space in the stream/topic row, at least for wide windows.  (We should keep mobile widths in mind as well).</p>\n<p>I don't think we want to spend that on things that will feel like clutter, but I think \"You're not looking at the topic you're sending to, want to go there?\" is a pretty reasonable thing to spend space on.</p>\n</blockquote>\n<p>I'll also note that we should at some point revisit the width of the topic box -- the current design was chosen with the goal of making very long topics feel inconvenient to encourage brevity, and I think that is a good design goal, but we could also decide that we want to push for that goal in other ways.  (Or at least align the length to what looks good in the left sidebar, which is probably 5-10 characters longer)</p>",
        "id": 1331762,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1645231693
    },
    {
        "content": "<p>I feel like it should be a bit longer in a world where it's pretty easy to edit topics.  (BTW I edited this topic due to the \"widtth\" typo.)</p>",
        "id": 1331880,
        "sender_full_name": "Steve Howell",
        "timestamp": 1645269627
    },
    {
        "content": "<p>There's an art to short topics, and I'm not sure our currently small window is sufficient to teach people it.  We still get topics that start with \"question about\" and similar phrases.</p>",
        "id": 1331881,
        "sender_full_name": "Steve Howell",
        "timestamp": 1645269734
    },
    {
        "content": "<p>OK, my immediate proposal is that we adjust the visual width to match fits in the left sidebar without a <code>...</code>. I think we can do further iteration from there, but that seems like it'd help you simulate whether your topic is going to look nice or not based on whether you can see the whole thing in the compose box.</p>",
        "id": 1333071,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1645574428
    },
    {
        "content": "<p>We may then want to do additional things, like having a contextual hint the first time you type a topic longer than 40 characters or something.</p>",
        "id": 1333073,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1645574455
    },
    {
        "content": "<p>Matching the left sidebar sounds good to me.</p>",
        "id": 1333079,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1645574668
    },
    {
        "content": "<p>Cool, we can wait for a few more folks to see this discussion and then open an issue if appropriate.</p>",
        "id": 1333130,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1645577247
    },
    {
        "content": "<p>I was reminded of this thread again. A couple more questions:</p>\n<ol>\n<li>Should we have the topic box expand with the text in it?</li>\n<li>Should we add an <code>x</code> to clear the text in the topic box? It would make the workflow easier for anyone starting a new topic via the \"Message...\" button on some existing topic.</li>\n</ol>",
        "id": 1344299,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647292757
    },
    {
        "content": "<p>I don't think it should expand with the text; I think it's better to indicate to the user visually that their topic is too long to be fully displayed in the UI.</p>",
        "id": 1344520,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647304437
    },
    {
        "content": "<p>I think we could add an \"X\" but I'm not sure it's important, and worry a bit about it being distracting / confusing (E.g. it might create unexpected expectations about whether you need to \"Create a topic\" in some other way before using it), so wouldn't want to couple that change to adjusting the text box size.</p>",
        "id": 1344522,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647304509
    },
    {
        "content": "<p>Did we end up making the change to match the width to what's in the left sidebar? That should be a self-sufficient change to make, and I agree it'd be a good one.</p>",
        "id": 1346611,
        "sender_full_name": "Greg Price",
        "timestamp": 1647476196
    },
    {
        "content": "<p>Filed <a href=\"https://github.com/zulip/zulip/pull/21461\">#21461</a> for just the width change.</p>",
        "id": 1347050,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647543128
    },
    {
        "content": "<p>Filed <a href=\"https://github.com/zulip/zulip/pull/21464\">#21464</a> for doing an experiment with adding the <code>x</code> clear button.</p>",
        "id": 1347098,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647546971
    },
    {
        "content": "<p>We can potentially get back to other discussion of the topic box width after <a href=\"https://github.com/zulip/zulip/pull/21461\">#21461</a>. In any case, in <span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> 's latest redesign proposal, it's quite a bit longer.</p>",
        "id": 1347102,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647547113
    },
    {
        "content": "<p>Since it's been bugging me when looking at screenshots in the release blog post, I just went ahead and implemented <a href=\"https://github.com/zulip/zulip/commit/2f929bee2f4faa7cec6dc06a844e80d6c9ab59f3\">2f929bee2f4faa7cec6dc06a844e80d6c9ab59f3</a>, which changes the compose box recipient input width to match the width that works well for a topic in the left sidebar with a single-digit unread count. </p>\n<p>We can potentially tune a bit more, but there's basically no world in which the original width of \"calc(20%) + 14px\" for how wide that component should be makes sense, so I feel confident this is an improvement.</p>",
        "id": 1350054,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647975483
    },
    {
        "content": "<p>Hey, anyone! I am working on issue <a href=\"https://github.com/zulip/zulip/issues/21461\">#21461</a> which requires to update the compose_box topic input width.  <a href=\"https://github.com/algo-byte/zulip/blob/33af1c1cd65ac6cbdc5e54622688198ced355cdb/static/styles/compose.css#L436\">The CSS related to the element</a> seems to have width, min-width and max-width as its attribute. Updating the min-width should do the job but am not sure how does it affects the width and max-width. Any suggestions?</p>",
        "id": 1350079,
        "sender_full_name": "Yash",
        "timestamp": 1647977190
    },
    {
        "content": "<p>Here's that CSS rule in the code you linked to:</p>\n<div class=\"codehilite\"><pre><span></span><code>#stream_message_recipient_topic.recipient_box {\n    width: calc(20% + 14px);\n    min-width: 120px;\n    max-width: 165px;\n}\n</code></pre></div>\n<p>At a quick experiment (I took my window and resized it down to very narrow, and out to very wide, and watched the whole way in between), it seems like the actual width is always equal to the min-width. That element's parent is always narrow enough that the formula we give for <code>width</code> is always less than the min-width.</p>\n<p>In that case, probably a good prep commit would be to replace all three of those attributes with <code>width: 120px;</code> -- it'll have the same effect in a more transparent way.</p>\n<p>Then as a commit on top of that, change the 120px to something else.</p>",
        "id": 1350123,
        "sender_full_name": "Greg Price",
        "timestamp": 1647978810
    },
    {
        "content": "<p>Oh ha, but it looks like <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> just made a change here. I'll move that message into this topic.</p>",
        "id": 1350125,
        "sender_full_name": "Greg Price",
        "timestamp": 1647978861
    },
    {
        "content": "<p>(done; it's the one just above yours, i.e. <span class=\"user-mention silent\" data-user-id=\"22581\">Yash</span>'s)</p>",
        "id": 1350126,
        "sender_full_name": "Greg Price",
        "timestamp": 1647978901
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"22581\">@Yash</span> yeah, I think you can proceed with just adding the <code>x</code>, since I did end up doing this one without checking if there was active work.</p>",
        "id": 1350129,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647978993
    },
    {
        "content": "<p>Thanks for informing. The other issue seems to be already taken, guess I will move on to some other issue :)</p>",
        "id": 1350137,
        "sender_full_name": "Yash",
        "timestamp": 1647979455
    },
    {
        "content": "<p>I added the <code>x</code> in <a href=\"https://github.com/zulip/zulip/pull/21473\">#21473</a></p>\n<p>On another note, the placeholder text in the message box updates with the new topic name when you shift focus to the message box or re-focus on the topic name.  Should we have it update live as they're typing the topic name?</p>",
        "id": 1364563,
        "sender_full_name": "Donald Riedl",
        "timestamp": 1649708379
    },
    {
        "content": "<blockquote>\n<p>Should we have it update live as they're typing the topic name?</p>\n</blockquote>\n<p>Sure, that seems like an improvement to me if it's reasonable to implement.</p>",
        "id": 1364813,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1649741375
    },
    {
        "content": "<p>I'm not sure it'd be an improvement; it's possible it'd prove distracting to have two places change as you type. We should try it out and see. (It should be easy to implement).</p>",
        "id": 1367945,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1650060851
    },
    {
        "content": "<p>Sure. <span class=\"user-mention\" data-user-id=\"23162\">@Donald Riedl</span> would you like to submit a PR for us to try the experiment?</p>",
        "id": 1369304,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1650310685
    },
    {
        "content": "<p>Yeah, I'll submit a PR later tonight</p>",
        "id": 1369325,
        "sender_full_name": "Donald Riedl",
        "timestamp": 1650311406
    },
    {
        "content": "<p>Alright, here's that small PR for the placeholder text<br>\n<a href=\"https://github.com/zulip/zulip/pull/21848\">#21848</a></p>\n<p>Also I messed up when merging the compose clear button.  Here's a fresh PR for that.<br>\n<a href=\"https://github.com/zulip/zulip/pull/21845\">#21845</a></p>",
        "id": 1369660,
        "sender_full_name": "Donald Riedl",
        "timestamp": 1650330603
    }
]