[
    {
        "content": "<p>Is there a discussion why zulip don't have any kind of topic-level permissions somewhere? I can't find any mentions of this feature. Does anybody know?</p>",
        "id": 1644259,
        "sender_full_name": "Andrew",
        "timestamp": 1695264142
    },
    {
        "content": "<p>On second thought It's more about noisy notifications than permissions: users don't want to be notified about something they don't interested in. When I'm looking at left side bar here I see <code>All messages</code> and counter <code>767</code> and list of <code>26</code> streams streams describes how this number come from. Every stream here is public. <br>\nFor what reason I receive that notifications? Just because I was subscribed to them. Why I was subscribed to them? A welcome bot do that just to inform me about their existence. Do I need to be informed about every event in them? Definitely no. Every time I  check zulip's chat I have to go to <code>Recent conversations</code> click <code>Participated</code> box (it's not saved between sessions). All that counters are absolutely useless for me. After that I have to mark every messages to read, just to not have tens of thousands of unread messages and get lost.<br>\nMaybe there is a lack in public stream behavior?<br>\nIt's be much better if every message of a public stream for me was READED by default. Not muted, because I can't imagine my using of unread message counter in them. It must be 0 unless I send a messege to one of them or implicitly subscribe/follow some topic in one of that streams. There's no circumstance even to count that for me at this stage. It seems I'm expecting all of that streams was not subscribed by default, but instead be just visible to me. And it's be a lot better to be able subscribe (enabling notifications and unread counter) to individual topics of public streams, not the whole public stream.</p>",
        "id": 1644303,
        "sender_full_name": "Andrew",
        "timestamp": 1695266847
    },
    {
        "content": "<p>This topic was moved to <a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/noisy.20unread.20message.20counts\">#feedback &gt; noisy unread message counts</a> by <span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span>.</p>",
        "id": 1644908,
        "sender_full_name": "Notification Bot",
        "timestamp": 1695326004
    }
]