[
    {
        "content": "<p>We're working on <code>@topic</code> mentions project which mentions all the topic participants.</p>\n<p>Topic participants: Users who either sent or reacted to the messages in the topic.</p>",
        "id": 1617818,
        "sender_full_name": "Prakhar Pratyush",
        "timestamp": 1690688937
    },
    {
        "content": "<p>Currently, the stream wildcard mention <a href=\"https://zulip.com/help/restrict-wildcard-mentions\">restrictions</a> also apply for topic mentions.</p>\n<ul>\n<li>Organization administrators can set a policy for which users are allowed to use wildcard mentions in large streams</li>\n<li>Zulip allows anyone to use wildcard mentions in streams with at most 15 subscribers.</li>\n<li>The default allows only organization administrators to use wildcard mentions in large streams.</li>\n</ul>",
        "id": 1617819,
        "sender_full_name": "Prakhar Pratyush",
        "timestamp": 1690688958
    },
    {
        "content": "<p>Should we make <code>@topic</code> mentions independent of such restrictions?</p>\n<p>Topic participants are mostly small number of users.</p>",
        "id": 1617820,
        "sender_full_name": "Prakhar Pratyush",
        "timestamp": 1690689123
    },
    {
        "content": "<p>Presumably the stream restrictions are to prevent annoyance and abuse. It wouldn’t at all be surprising to see large topics, especially when the topic stretches back a long length of time. But of course such restrictions also potentially reduce the utility of the feature itself, when it would otherwise be used appropriately.</p>",
        "id": 1618062,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1690807747
    },
    {
        "content": "<p>It's going to be quite rare for an individual topic to have more than 15 participants. For example scrolling back through my \"Recent conversations\" view here on <a href=\"http://chat.zulip.org\">chat.zulip.org</a>, the latest such topic is <a class=\"stream-topic\" data-stream-id=\"6\" href=\"/#narrow/stream/6-frontend/topic/typescript.20migration\">#frontend &gt; typescript migration</a> — 17 days ago, so there's probably hundreds of other topics I scrolled past before finding that one.</p>",
        "id": 1618157,
        "sender_full_name": "Greg Price",
        "timestamp": 1690827677
    },
    {
        "content": "<p>I think a pretty reasonable approach would be to say that the rules are the same as for stream mentions, in the sense that if there are more than 15 people in the set you'd be trying to notify then the restriction applies.</p>\n<p>We would not want it to be the same as for stream mentions in the sense that you can only use <code>@topic</code> in the same streams where you could use <code>@stream</code>. That would defeat a lot of the point of the feature, as <span class=\"user-mention silent\" data-user-id=\"26369\">Karl Stolley</span> says.</p>",
        "id": 1618159,
        "sender_full_name": "Greg Price",
        "timestamp": 1690827787
    },
    {
        "content": "<p>To summarize:</p>\n<p>For <code>@stream</code> mentions</p>\n<ul>\n<li>If the stream has less than 15 subscribers, anyone can use <code>@all</code> mentions.</li>\n<li>For more than 15, the policy will determine who can use <code>@all</code> mentions.</li>\n</ul>\n<p>For <code>@topic</code> mentions:</p>\n<ul>\n<li>If the topic has less than 15 <strong>participants</strong> , anyone can use <code>@topic</code> mentions</li>\n<li>For more than 15, the same policy will determine who can use <code>@topic</code> mentions.</li>\n</ul>",
        "id": 1618198,
        "sender_full_name": "Prakhar Pratyush",
        "timestamp": 1690832154
    },
    {
        "content": "<p>As <span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> mentioned:</p>\n<blockquote>\n<p>It's going to be quite rare for an individual topic to have more than 15 participants. For example scrolling back through my \"Recent conversations\" view here on <a href=\"http://chat.zulip.org\">chat.zulip.org</a>, the latest such topic is #frontend &gt; typescript migration — 17 days ago, so there's probably hundreds of other topics I scrolled past before finding that one.</p>\n</blockquote>\n<p>I think,<br>\nWe have restrictions for <code>@all</code>, because it is quite common to have streams with more than 15 subscribers &amp; we want to avoid spamming a lot of users i.e Notifying thousands of users in an active stream.</p>\n<p>But since there are very less topics having &gt; 15 participants, is it worth to put such restrictions?<br>\nWhat if a user actually meant to mention more than 15 participants of that topic -- I think it should be fine to allow them. It is still not a spam + we're not notifying 100s of users (so not a lot of work for servers).</p>\n<p>Maybe we can just add a warning banner in the case of &gt; 15 participants? (We do it currently for stream mentions)</p>",
        "id": 1618199,
        "sender_full_name": "Prakhar Pratyush",
        "timestamp": 1690832177
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"22341\">Prakhar Pratyush</span> <a href=\"#narrow/stream/101-design/topic/topic.20wildcard.20mention.20permission/near/1618199\">said</a>:</p>\n<blockquote>\n<p>But since there are very less topics having &gt; 15 participants, is it worth to put such restrictions?<br>\nWhat if a user actually meant to mention more than 15 participants of that topic -- I think it should be fine to allow them. It is still not a spam + we're not notifying 100s of users (so not a lot of work for servers).</p>\n</blockquote>\n<p>Yeah, because it's probably unusual for a topic to have so many participants, it won't hugely matter whether we apply the rule there or not.</p>\n<p>Probably the main downside if we do make the rule apply to <code>@topic</code> is that people may find it confusing or arbitrary — they may have used it previously in the same topic, and then another participant chimes in and now they can't.</p>\n<p>And I guess in particular there's less to gain from the rule — less of a downside to going without it — in that although the threshold is 15, the rule is most valuable when there are hundreds or thousands of subscribers. And it's going to be quite rare to have that many <em>participants</em>, particularly in one topic.</p>\n<p>Still, though. Consider some community that uses a \"general chat\" topic in one or more of their high-traffic streams. Over the years, that accumulates hundreds of people who've ever spoken in it. Then someone goes and uses <code>@topic</code> there.</p>\n<p>If the mention succeeds, the admins are going to be annoyed, and wonder why the wildcard-mention restrictions didn't work. I feel like there isn't going to be a good answer for them to say why the restrictions didn't work; it's going to seem like clearly just an inconsistency, an incompletely implemented feature.</p>",
        "id": 1618234,
        "sender_full_name": "Greg Price",
        "timestamp": 1690836784
    },
    {
        "content": "<p>Makes sense. Thanks <span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> for the explanation.</p>\n<p>I think  we should wait for a week for more feedback/views (if any) on this. Otherwise we are good to move forward with the <a href=\"#narrow/stream/101-design/topic/topic.20wildcard.20mention.20permission/near/1618198\">decision above</a>.</p>",
        "id": 1618391,
        "sender_full_name": "Prakhar Pratyush",
        "timestamp": 1690870814
    },
    {
        "content": "<p>Setting the threshold at 15 (for either stream or topic) reminds me of living under the you-can-only-edit-your-message-within-an-hour regime.  I kind of hate arbitrary limits for doing things.  I would try to just make it a warning if somebody tries to do a mention for a topic with lots of participants.</p>",
        "id": 1618410,
        "sender_full_name": "Steve Howell",
        "timestamp": 1690880745
    },
    {
        "content": "<p>I don't think a warning suffices for something that would trigger thousands of notifications; the reason the wildcard mention thing exists is that it's in part a permissions restriction.</p>",
        "id": 1625919,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692139475
    },
    {
        "content": "<p>So I would argue for going with the rule Greg suggested above if it's easy to do so.</p>",
        "id": 1625920,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1692139501
    },
    {
        "content": "<p>Just to check, did the restriction for <code>@topic</code> end up getting implemented? If so, we'll need to change the name of the setting that controls the behavior (currently: \"Who can use @all/@everyone mentions in large streams\"), and update the linked <a href=\"https://chat.zulip.org/help/restrict-wildcard-mentions\">help center page</a>.</p>",
        "id": 1646953,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695681150
    },
    {
        "content": "<p>Not implemented yet!</p>",
        "id": 1646954,
        "sender_full_name": "Prakhar Pratyush",
        "timestamp": 1695681191
    },
    {
        "content": "<p>OK. Anyway, the plan above sounds good to me, but we should rename the setting on the same PR, and update the help center page either there or as a quick follow-up.</p>\n<p>For the setting name, something like \"Who can notify a large number of users with a wildcard mention\"?</p>",
        "id": 1646957,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695681333
    },
    {
        "content": "<p>Oh, and just flagging that <a href=\"https://zulip.com/help/restrict-wildcard-mentions\">https://zulip.com/help/restrict-wildcard-mentions</a> will need to be updated accordingly.</p>",
        "id": 1648758,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1695880102
    }
]