[
    {
        "content": "<p>Hey! We recently had a user email support requesting topic filtering (<a href=\"https://github.com/zulip/zulip/pull/18505\">#18505</a>), and specifically asking for it to be accessible via keyboard shortcut. Thoughts on what would be a good keyboard shortcut for it? CC <span class=\"user-mention\" data-user-id=\"17546\">@Purushottam Tiwari</span> <span class=\"user-mention\" data-user-id=\"10349\">@Mateusz Mandera</span> </p>\n<p>(The idea for the feature was originally suggested by another user, so it seems like it's a common need!)</p>",
        "id": 1189224,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1622064006
    },
    {
        "content": "<p>I had to check to clarify which topic filtering this is - this is in the left side bar.<br>\nFor comparison, this is supported in zulip-terminal by the same <code>q</code> key as for streams, since <code>t</code> toggles between stream&lt;-&gt;topic view (we used <code>t</code> before recent topics). I'd welcome an alternative/extra key to <code>q</code> for this that we could use in ZT :)<br>\nThe bigger question I have is where the search box would go in the webapp? For ZT we switch between stream and topic context, so the same area gets reused (hence <code>q</code> searches the left-bar using whatever search box is currently present).</p>",
        "id": 1189239,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1622065556
    },
    {
        "content": "<p>For the webapp, we'd have it appear under the stream's label (e.g. under <a class=\"stream\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design\">#design</a>) in the left sidebar, possibly only visible when you're in the zoomed \"more topics\" view.</p>",
        "id": 1189245,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1622065782
    },
    {
        "content": "<p>So one theory is that this could be a \"go to more topics\" shortcut that takes you to that view with keyboard focus in the filter text area.</p>",
        "id": 1189247,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1622065810
    },
    {
        "content": "<p>Yeah, that seems reasonable.</p>",
        "id": 1189252,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1622065998
    },
    {
        "content": "<p>I strongly feel we need to eliminate the zoomed topics view, which is an awkward UI already, and we should instead just redirect “more topics” to Recent Topics with an appropriate filter.  The janky UI we have now is something that I have opposed since 2013.  (I support the functionality.)</p>",
        "id": 1189256,
        "sender_full_name": "Steve Howell",
        "timestamp": 1622066245
    },
    {
        "content": "<p>Oh, that's interesting... I suppose a step in that direction would be to enable filtering by stream in <strong>Recent topics</strong>, which seems useful regardless.</p>",
        "id": 1189290,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1622066980
    },
    {
        "content": "<p>I guess a downside of redirecting to <strong>Recent topics</strong> like that is that it would reset the filters. One way of using RT is to have the \"Participated\" filter set and none of the others, and default to it as a way to view incoming message traffic.</p>",
        "id": 1189292,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1622067135
    },
    {
        "content": "<p>We should definitely add a way to filter by stream in \"Recent topics\" regardless, just as a natural extension of that feature.  I think the main thing we need for that is to find space for the UI control.</p>\n<p>I think that as long as we have the zoomed view, which I'm not ready to deprecate (since it is extremely useful, and we don't have a clear replacement), it makes sense to do the tiny feature of adding a filter box on it.  (We might feel the need to port it to use <code>ListWidget</code>; I'm not sure).</p>",
        "id": 1189327,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1622069223
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/topic.20filter/near/1189327\">said</a>:</p>\n<blockquote>\n<p>We should definitely add a way to filter by stream in \"Recent topics\" regardless, just as a natural extension of that feature.  I think the main thing we need for that is to find space for the UI control.</p>\n</blockquote>\n<p>We could have a filter icon next to the <code>Streams</code> header?</p>",
        "id": 1189404,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1622071838
    },
    {
        "content": "<p>I was also expecting <code>stream: foo</code> to work in the search box.</p>",
        "id": 1189405,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1622071861
    },
    {
        "content": "<p>Currently <code>q</code> is used as keyboard shortcut, for toggling filter streams input in left sidebar. So how about using same <code>q</code> for toggling filter topics input in zoomed view.</p>",
        "id": 1189758,
        "sender_full_name": "Purushottam Tiwari",
        "timestamp": 1622111160
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"17546\">Purushottam Tiwari</span> <a href=\"#narrow/stream/101-design/topic/topic.20filter/near/1189758\">said</a>:</p>\n<blockquote>\n<p>Currently <code>q</code> is used as keyboard shortcut, for toggling filter streams input in left sidebar. So how about using same <code>q</code> for toggling filter topics input in zoomed view.</p>\n</blockquote>\n<p>Ah, this is a bad idea considering the fact we are expecting topic filter to be opened from normal view(not zoomed view) in left sidebar.</p>",
        "id": 1189776,
        "sender_full_name": "Purushottam Tiwari",
        "timestamp": 1622113169
    },
    {
        "content": "<p>I think we might end up wanting to go with something like <code>Q</code>, basically to be a variant of the <code>q</code> shortcut?  Not sure.</p>\n<p>We probably should just build the feature so we can play with it before finalizing a shortcut decision; you're welcome to prototype with <code>Q</code> in the meantime (but please keep the keyboard shortcut as a separate final commit, since we may want to keep that on <a href=\"http://chat.zulip.org\">chat.zulip.org</a> for further discussion of the keyboard UI after merging the main feature to master)</p>",
        "id": 1189986,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1622137407
    },
    {
        "content": "<p>We just merged the topic filter box via <a href=\"https://github.com/zulip/zulip/pull/18724\">#18724</a>.  Thanks <span class=\"user-mention\" data-user-id=\"17546\">@Purushottam Tiwari</span>!  </p>\n<p>I haven't deployed the changes to <a href=\"http://chat.zulip.org\">chat.zulip.org</a> yet, but that should happen with a master deployment later today.  </p>\n<p>We haven't added a keyboard shortcut and I'm not sure we're using the right filtering algorithm.  (What we have in master calls the same function that we use for the STREAMS filter box and nowhere else, which basically does a prefix match between what you typed and each \"word\" of the stream/topic name.  (Also supports <code>,</code> for an OR gate).</p>",
        "id": 1204406,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1623190455
    },
    {
        "content": "<p>(Triggering a <a href=\"http://chat.zulip.org\">chat.zulip.org</a> deploy now)</p>",
        "id": 1204409,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1623190499
    },
    {
        "content": "<p>Hmm, I was expecting the \"x\" button to close the search box, but it just removes the current query.</p>",
        "id": 1204456,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1623193763
    },
    {
        "content": "<p>Yeah, that's the other thing I noticed that seems wrong.  I suspect we want the <code>x</code> button to only appear if there's something in the search box, or to not exist, since I don't think we want such a button to be a weirdly placed duplicate of the \"BACK TO STREAMS\" button.</p>",
        "id": 1204508,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1623195909
    },
    {
        "content": "<p>Ohh I had forgot about <code>Q</code> keyboard shortcut. So, I'll prototype that soon. Regarding <code>x</code> button, from above discussion I am not clear what it is expected to do, like do we want to remove the search box, or should we show it when there is some text in input and clears the input text on clicking.<br>\nI would also be happy to get any other suggestions.</p>",
        "id": 1205194,
        "sender_full_name": "Purushottam Tiwari",
        "timestamp": 1623255646
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"17546\">@Purushottam Tiwari</span> I would consider just not showing the <code>X</code> button if the input is empty.</p>",
        "id": 1205623,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1623280580
    },
    {
        "content": "<p>Mm, yeah, perhaps the button always being there cued the idea that the search box could be closed.</p>\n<p>Ideally, though, the behavior should be consistent across search/filter boxes unless there's a specific reason to be inconsistent. Currently:</p>\n<ol>\n<li>x always shown and removes input but doesn't close the box: Recent topics, user search (right sidebar), stream filter (<code>Manage streams</code> menu)</li>\n<li>x always shown and closes the box: top search bar</li>\n<li>No x at all: Filters in the <code>Settings</code> and <code>Organization settings</code> menus, including users, muted users, bots, etc.</li>\n</ol>",
        "id": 1205690,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1623286294
    },
    {
        "content": "<p>I think if we don't show the \"x\" in the topic filter when the input is empty, we should make the same change to all the cases in (1).</p>",
        "id": 1205691,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1623286331
    },
    {
        "content": "<p>And perhaps we should add <code>x</code> to the boxes in (3).</p>",
        "id": 1205692,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1623286359
    },
    {
        "content": "<p>The top search bar is maybe a bit special/more tricky.</p>",
        "id": 1205693,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1623286379
    },
    {
        "content": "<p>There is an open PR(<a href=\"https://github.com/zulip/zulip/pull/17772\">#17772</a>) for (3).</p>",
        "id": 1205725,
        "sender_full_name": "Purushottam Tiwari",
        "timestamp": 1623298453
    },
    {
        "content": "<p>We probably need someone to pick up finishing <a href=\"https://github.com/zulip/zulip/pull/17772\">#17772</a>, since <span class=\"user-mention\" data-user-id=\"17653\">@Nikhil Maske (nikhilmaske-2001)</span> seems no longer active.</p>",
        "id": 1206506,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1623358358
    },
    {
        "content": "<p>One thing that's strange about this is that it shows for streams that have very few topics, which feels like a bug. (If \"more topics\" isn't shown, the search bar is shown, it seems)</p>",
        "id": 1206592,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1623363928
    },
    {
        "content": "<p>Mm, yeah, maybe we need a minimum number of topics in order to show it.</p>",
        "id": 1206594,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1623364026
    },
    {
        "content": "<p>So the reproducer <span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> showed me is this:</p>\n<ul>\n<li>Find a stream that has fewer than 5 topics that appear in the most recent few hundred messages in the stream.  This is a weird condition, but effectively means that when you click into the stream, the data of \"most recent N messages\" that we'll fetch from the server at that time will include fewer than 5 topics.</li>\n<li>In this situation, Zulip will offer you a \"more topics\" button, since the client doesn't know how many more topics exist.</li>\n<li>Clicking \"more topics\" will fetch from the server the full set of topics in the stream's history, which might be just 3 topics for a small stream with all of its recent traffic in the 2 other topics.</li>\n<li>And of course that'll take you to the \"zoomed topics\" view with a filter widget.</li>\n<li>If you then click out of it, you won't be able to get back to said \"zoomed topics\" view without reloading, because the client has now cached the reality that this stream only has 3 topics in its full history.</li>\n</ul>",
        "id": 1206689,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1623371687
    },
    {
        "content": "<p>Given that, I think there's two possibilities:</p>\n<ul>\n<li>We decide to do that \"all topics\" data fetch from the server when narrowing to a stream, at least if the data we get from clients contains &lt;5 topics, the main cost of which is extra server load.</li>\n<li>We do something specific to have the filter widget's presence depend on how many topics there are.</li>\n</ul>",
        "id": 1206690,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1623371777
    },
    {
        "content": "<p>I feel like the first approach is probably less hacky, though it might still leave an opening for getting into a bad state if we're not thoughtful about races with the two requests.</p>",
        "id": 1206692,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1623371797
    },
    {
        "content": "<p>I think we should always have a link to expand the topics view, and when a stream has fewer than five topics, we can add other content, such as pro tips, list of senders, add-topic button, etc.  And we would change the wording from “more topics” to something slightly more generic like “explore”.</p>",
        "id": 1206699,
        "sender_full_name": "Steve Howell",
        "timestamp": 1623372221
    },
    {
        "content": "<p>Or just launch recent topics in the middle pane with the stream filtered, as has been suggested before.  The current UI is just kinda janky.</p>",
        "id": 1206706,
        "sender_full_name": "Steve Howell",
        "timestamp": 1623372542
    },
    {
        "content": "<p>I think while going to zoomed topic view we have data/count for how many topics we are going to show in zoomed topic view so based on that we can not render filter widget for such streams.<br>\n(But I understand that problem is about not being able to go to zoomed view(without reload) for such streams, so this is not the solution for the problem being discussed.)</p>",
        "id": 1206731,
        "sender_full_name": "Purushottam Tiwari",
        "timestamp": 1623377790
    },
    {
        "content": "<p>What should be the behavior for <code>Q</code> hotkey when left sidebar is a sidebar popover(opened using hamburger icon in top left) in small screen? Should we open the left sidebar and show zoom topic view for highlighted stream?</p>",
        "id": 1207080,
        "sender_full_name": "Purushottam Tiwari",
        "timestamp": 1623424460
    },
    {
        "content": "<p>Also I recall seeing some function to check if left-sidebar is in that state(hidden state), but now I am searching about that for a while but not able to find it so in case someone remembers(if exists) and point out if possible.</p>",
        "id": 1207082,
        "sender_full_name": "Purushottam Tiwari",
        "timestamp": 1623424799
    }
]