[
    {
        "content": "<p>What do you think about adding an option to allow anyone to edit topics? I'm trying to think of what could help with the problem of \"no topic discipline in the first few weeks of trying out the app -&gt; bad experience with zulip\".<br>\nAllowing anyone to edit topics at the beginning would allow any one person who's rooting for zulip to save the whole org.</p>",
        "id": 258827,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1501203248
    },
    {
        "content": "<p>I think that's a pretty reasonable idea.</p>",
        "id": 258829,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1501203559
    },
    {
        "content": "<p>A related (much more work to implement) feature would be the ability to edit the topic of individual messages, not just recipient blocks. Thoughts on that?</p>",
        "id": 258847,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1501206811
    },
    {
        "content": "<p>That's probably not a lot of work.  You can do that already for messages you sent.  So it's just a tweak to to the message menu.</p>",
        "id": 258880,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1501216258
    },
    {
        "content": "<p>I guess I imagined we'd want a slightly nicer UI, but fair enough / totally reasonable for a V1.<br>\nI'll open an issue tomorrow barring other thoughts.</p>",
        "id": 258897,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1501217830
    },
    {
        "content": "<p>FWIW I agree with <span class=\"user-mention\" data-user-email=\"rishig@zulipchat.com\" data-user-id=\"131\">@Rishi Gupta</span> that we should try to get to a V2 UI for editing topics fairly soon.  I assume he's thinking of something where, if you're really just changing the topic, you don't have the more cluttered UI that people use to edit their own messages?</p>",
        "id": 258920,
        "sender_full_name": "Steve Howell",
        "timestamp": 1501238699
    },
    {
        "content": "<p>yeah, exactly. Some other things that I think would help with topic clean-up (if it seems like cleaning up others topics becomes an important part of onboarding):</p>\n<ul>\n<li>Local echo; currently it's very slow to change a topic (I guess local echo for message editing would include most of this)</li>\n<li>Hotkey for getting to the \"change topic\" state</li>\n</ul>",
        "id": 258963,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1501253810
    },
    {
        "content": "<p>Fwiw, if a topic is bad but not interspersed with other messages, somebody can already fix it by sending a message, and then editing their message with the past messages option. I do this a fair bit at work. (It's not really clear to me how far back that changes, though. )</p>",
        "id": 259508,
        "sender_full_name": "Alex Dehnert",
        "timestamp": 1501281063
    },
    {
        "content": "<p>It would be nice to clean up the three-option dropdown for only-this-message, only-forward, and all-messages.  I don't have an exact proposal in mind, but there might be some way to easily rename the whole topic without selecting a particular message.</p>",
        "id": 259701,
        "sender_full_name": "Steve Howell",
        "timestamp": 1501323490
    },
    {
        "content": "<p>one could imagine \"rename topic\" in the left sidebar, in the topic-popover. Then the 3-option thing could turn into an input box +  checkmark for \"also change topic for messages following this\"</p>",
        "id": 259767,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1501348599
    },
    {
        "content": "<p>It's possible we should also have warnings and stuff when people make topics with 5+ words <br>\n(actually, on reflection I think this is a bad idea, much better for people to just send whatever they have and be corrected later)</p>",
        "id": 259773,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1501348647
    },
    {
        "content": "<p>A concrete proposal for a first step: Add a \"Rename &lt;topic name&gt;\" in the topic popover, which allows you to edit the topic directly in the left sidebar. It should appear if you-are-an-admin or users-can-edit-topics (and message editing is on).</p>",
        "id": 263204,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1501919261
    },
    {
        "content": "<p>actually, I just realized we already allow users to edit topics, if you've sent even a single message to the topic. So changing the proposal to:<br>\n\"It should appear if message editing is on\".</p>",
        "id": 263320,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1501960754
    },
    {
        "content": "<p>A slight UI suggestion with topic editing.  Right now you can edit a topic, but if you just change capitalization it appears to revert to the old topic, even though the change was successful.  If you narrow to another stream and then come back, it appears correctly (and the change also happens immediately in the list of streams on the left).</p>",
        "id": 263577,
        "sender_full_name": "David Roe",
        "timestamp": 1502042128
    },
    {
        "content": "<p>Can you file an issue for that?  That's not intentional behavior and sounds like a typical quirk of dealing with case-insensitive data.</p>",
        "id": 263578,
        "sender_full_name": "Steve Howell",
        "timestamp": 1502042301
    },
    {
        "content": "<p>Sure.</p>",
        "id": 263579,
        "sender_full_name": "David Roe",
        "timestamp": 1502042572
    },
    {
        "content": "<p>See <a href=\"https://github.com/zulip/zulip/issues/6042\" target=\"_blank\" title=\"https://github.com/zulip/zulip/issues/6042\">https://github.com/zulip/zulip/issues/6042</a></p>",
        "id": 263580,
        "sender_full_name": "David Roe",
        "timestamp": 1502042759
    }
]