[
    {
        "content": "<p>The webapp's current UX greatly emphasizes interleaved views over topic views, which I think is the wrong strategy for new users. My proposal is that we bring the mobile \"home\" view into the left sidebar. For a first pass, I'm imagining:</p>\n<ul>\n<li>A toggle that switches between the current left sidebar, and the unreads view. Not sure where the toggle should go, but maybe at the top of the left sidebar</li>\n<li>The unreads view would just show every PM and every non-muted stream and topic (that had non-zero unreads)</li>\n</ul>\n<p>Thoughts?</p>",
        "id": 683165,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1547657574
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> We can worry about the toggle position later.  For the unreads view...</p>\n<ul>\n<li>do we replace the entire sidebar (including \"All messages\", \"Starred message\", \"Mentions\")?</li>\n<li>do we still have headers for \"Private messages\" and \"Streams\"?</li>\n<li>do we have a big header for \"Unread messages\"</li>\n<li>do we preserve pinning of streams?</li>\n<li>do we alphabetize everything within category? (as opposed to recency)</li>\n<li>do we have message previews? (I assume no for v1)</li>\n<li>do we exclude muted streams and topics (I assume we do exclude, even if there are unreads)</li>\n<li>we'll need messaging for the all-caught-up-case (and it might like a bit funny)</li>\n<li>do we nest topics?</li>\n<li>do we limit topics?</li>\n<li>do we still have popup menus?</li>\n<li>do we disable the streams filter feature?</li>\n<li>do we make the stream names clickable (and if so, do they go into an interleaved view)?</li>\n</ul>",
        "id": 683168,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547659043
    },
    {
        "content": "<p>Also, should the PMs and Streams have separate scrolling containers or scroll as one big unit?</p>",
        "id": 683169,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547659422
    },
    {
        "content": "<p>Some other edge-case-y things are what happens once I read the last message in a topic?  Does it immediately disappear from the list?  And if I go to a caught-up-topic via search, do we do anything in the sidebar?</p>",
        "id": 683170,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547659513
    },
    {
        "content": "<p>great questions.</p>\n<blockquote>\n<p>do we replace entire sidebar</p>\n</blockquote>\n<p>yes</p>\n<blockquote>\n<p>headers</p>\n</blockquote>\n<p>we can decide that later. I think no headers to start</p>\n<blockquote>\n<p>pinning of streams / alphabetize</p>\n</blockquote>\n<p>basically, the same order it would appear in the current sidebar. So yes to pinning of streams. Streams ordered by alpha within category.</p>\n<blockquote>\n<p>message previews</p>\n</blockquote>\n<p>I'm not sure what this is referring to</p>\n<blockquote>\n<p>do we exclude muted streams and topics</p>\n</blockquote>\n<p>yes</p>\n<blockquote>\n<p>messaging for the all-caught-up case</p>\n</blockquote>\n<p>yes. It can just be \"No unread messages\" for now</p>\n<blockquote>\n<p>nest topics</p>\n</blockquote>\n<p>Not sure what this means?</p>\n<blockquote>\n<p>limit topics</p>\n</blockquote>\n<p>Not for V1</p>\n<blockquote>\n<p>popup menus</p>\n</blockquote>\n<p>yes</p>\n<blockquote>\n<p>disable streams filter feature</p>\n</blockquote>\n<p>yes</p>\n<blockquote>\n<p>stream names clickable, they go into interleaved view</p>\n</blockquote>\n<p>yes</p>\n<blockquote>\n<p>do PMs and streasm have separate scrolling, or do they scroll as one unit</p>\n</blockquote>\n<p>they scroll as one unit</p>\n<blockquote>\n<p>once you read last message in a topic, does it disappear from the list</p>\n</blockquote>\n<p>no, same behavior that we currently use when you read the last message in a topic in a stream with &gt;5 visible topics </p>\n<blockquote>\n<p>does doing stuff via search affect the left sidebar</p>\n</blockquote>\n<p>no, going to narrows via search should not do anything in the left sidebar</p>",
        "id": 683173,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1547660143
    },
    {
        "content": "<p>One thing to be aware of is that streams are alpha now, but topics and PMs are by recency.  I think in an unreads view, doing everything alpha may be less confusing, but not sure.</p>",
        "id": 683175,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547660285
    },
    {
        "content": "<p>By \"nesting topics,\" I just mean topics will be indented under the streams, similar to the current sidebar.</p>",
        "id": 683176,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547660384
    },
    {
        "content": "<p>If click on a stream name, I assume the interleaved view is fair game to include caught-up topics?  If so, does that change the sidebar unreads view at all?</p>",
        "id": 683177,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547660442
    },
    {
        "content": "<p>I don't understand \"same behavior we currently use when you read the last message\".  How can I clear my sidebar if catching up on topics doesn't make them disappear?</p>",
        "id": 683179,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547660529
    },
    {
        "content": "<p>oh, I meant: streams by alpha, and topics and PMs by recency. I think that's how we do it in the mobile home view.</p>\n<blockquote>\n<p>nesting topics </p>\n</blockquote>\n<p>ah, got it. Yeah, topics indented under streams, similar to the current sidebar</p>\n<blockquote>\n<p>click on a stream name</p>\n</blockquote>\n<p>yeah, it should just go to <code>/#narrow/stream/101-design</code>. As you scroll down you're right stuff will get read and disappear from the left sidebar.</p>",
        "id": 683180,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1547660559
    },
    {
        "content": "<p>Once I'm completely caught up on a stream, I assume the stream itself will disappear as well?</p>",
        "id": 683181,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547660615
    },
    {
        "content": "<blockquote>\n<p>I don't understand \"same behavior we currently use when you read the last message\".  How can I clear my sidebar if catching up on topics doesn't make them disappear?</p>\n</blockquote>\n<p>oh, I meant that </p>\n<ul>\n<li>click on a topic, it gets highlighted, and has 10 unreads.</li>\n<li>scroll to end. topic is still highlighted, and has 0 unreads</li>\n<li>click on any other topic/streams/PM narrow on left sidebar. topic disappears</li>\n</ul>",
        "id": 683182,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1547660643
    },
    {
        "content": "<blockquote>\n<p>Once I'm completely caught up on a stream, I assume the stream itself will disappear as well?</p>\n</blockquote>\n<p>correct</p>",
        "id": 683183,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1547660647
    },
    {
        "content": "<p>Let's drill down on the getting-caught-up scenario.</p>",
        "id": 683184,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547660772
    },
    {
        "content": "<p>Backing up a sec, there are kinda two strategies here:</p>\n<ul>\n<li>Define the contents of the stream list as a function of what's-unread + where-you're-narrowed (so it's kind of like an invariant, and we can redraw for things like incoming messages without knowing any other state)</li>\n<li>Go to more of a \"sticky\" strategy, where you draw the sidebar, and then nothing disappears from it until you click to another narrow.  (We'll update unread counts, but that's about it.)</li>\n</ul>",
        "id": 683187,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547660918
    },
    {
        "content": "<p>I'm imagining the first</p>",
        "id": 683190,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1547660961
    },
    {
        "content": "<p>Actually, one more quick thing to think about: If I have several unread topics, and I catch up on \"annoying thread\", the only way I can truly close that out is to go to another topic, correct?  (which means I then have to address that topic)</p>",
        "id": 683192,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547661029
    },
    {
        "content": "<p>The first is a bit easier to reason about, so let's go down that road.</p>",
        "id": 683193,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547661059
    },
    {
        "content": "<blockquote>\n<p>Actually, one more quick thing to think about: If I have several unread topics, and I catch up on \"annoying thread\", the only way I can truly close that out is to go to another topic, correct?  (which means I then have to address that topic)</p>\n</blockquote>\n<p>yeah</p>",
        "id": 683195,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1547661076
    },
    {
        "content": "<p>I don't want to dwell too deeply on the \"annoying topic\" scenario, because that's kind of a problem with the current sidebar.  Just keep in the back of our minds.</p>",
        "id": 683196,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547661114
    },
    {
        "content": "<p>Let's say I have unreads from Tim, Rishi, Alice/Bob (group PM), dev/python, dev/js, social/lunch, and I'm narrowed to general.</p>",
        "id": 683197,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547661200
    },
    {
        "content": "<p>It will look something like below (unread counts are only on left since I can't justify in text):</p>\n<div class=\"codehilite\"><pre><span></span>2 Alice/Bob\n2 Rishi\n4 Tim\n7 dev\n-- 5 js\n-- 2 python\n0 general\n3 social\n-- 3 lunch\n</pre></div>",
        "id": 683198,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547661307
    },
    {
        "content": "<p>(if general didn't have any unreads when you first went to the unreads view, it would not be in the sidebar at all)</p>",
        "id": 683200,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1547661396
    },
    {
        "content": "<p>(i.e. this scenario is that general had some unreads, you clicked on it or got to #narrow/stream/general via search, and then scrolled down to the end, right?)</p>",
        "id": 683202,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1547661447
    },
    {
        "content": "<p>Ok, now we're in stateful land.</p>",
        "id": 683203,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547661459
    },
    {
        "content": "<p>yeah, the \"don't disappear until you click somewhere else\" does require that state</p>",
        "id": 683205,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1547661496
    },
    {
        "content": "<p>I'd argue it's simpler to just <strong>always</strong> show <code>general</code> if I'm narrowed to general.  Since unread messages may be coming in for that in the future, too.  I think it's less jitter that way.</p>",
        "id": 683208,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547661530
    },
    {
        "content": "<p>the stateful thing is how we currently do it in the left sidebar for streams with &gt; 5 unread topics, right?</p>",
        "id": 683211,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1547661565
    },
    {
        "content": "<p>Not really, it's stateless.</p>",
        "id": 683212,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547661597
    },
    {
        "content": "<p>At any given time, we rebuild the sidebar and the topics are a function of what's unread, what's recent, and what's the limit (5), but no actual state is involved.</p>",
        "id": 683214,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547661646
    },
    {
        "content": "<p>oh, I think I see. ok, I think the stateless approach is fine here as well. (which is to show all unreads + the current narrow, if it is a stream or topic narrow?)</p>",
        "id": 683215,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1547661668
    },
    {
        "content": "<p>There are gonna be some edge cases with search, but I think we can work through those later.  (If I just search for  keyword \"foo\", I don't think any streams should get special treatment, but if I search for keyword \"foo\" within stream \"general\", I may or may not want \"general\" to be in the sidebar.  And I probably don't care whether unread counts reflect messages that don't match the search--we definitely don't do that now.)</p>",
        "id": 683218,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547661862
    },
    {
        "content": "<p>Can you send me a quick PM? (I wanna take a look at mobile with an unread there.)</p>",
        "id": 683221,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547661983
    },
    {
        "content": "<p>Got it, thanks!</p>",
        "id": 683224,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547662105
    },
    {
        "content": "<p>I don't know how valuable people think aggregated counts are -- like you see now next to \"All messages\" and \"Private messages\" in the web app.  The mobile app doesn't show these, and I've never really missed them on mobile.  V1 of this probably won't have those.</p>",
        "id": 683225,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547662208
    },
    {
        "content": "<p>I guess you'd still have the big count in the favicon.</p>",
        "id": 683226,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547662232
    },
    {
        "content": "<p>yeah, don't think it's needed (maybe we'll miss them, but if so fine with figuring that out for the V2). Also agreed that I've never missed it on mobile</p>",
        "id": 683227,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1547662288
    },
    {
        "content": "<p>I think the most likely complaints we'll get is that the sidebar churn might end up being a bit distracting.  In the current webapp, churn is less of an issue, because we never add/remove streams; we only clear unread counts.  (There's some churn for new topics).  And in the mobile app, they have the luxury that when you're in a message view and composing, the unreads view is not visible.</p>",
        "id": 683230,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547662508
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"284\">@Boris Yankov</span> Do you have any war stories from the mobile unreads view that I should be aware of?  Were there any things that you didn't think of up front that surprised you in terms of complexity?  I assume it's mostly straightforward, but if there were any \"mobile regrets...\" lessons, let me know, please <span class=\"emoji emoji-1f603\" title=\"smiley\">:smiley:</span></p>",
        "id": 683231,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547662620
    },
    {
        "content": "<p>I think grand total count isn't as important in this mobile view because you kinda get a feel of it from just \"how tall is the list of topics with unreads\"</p>",
        "id": 683272,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1547665534
    },
    {
        "content": "<p>This is an interesting discussion; this concerns just a different view/rendering of data already available through the API, right? I've thought of having a different view in ZT already, since I end up scrolling through to unreads quite frequently, but I want a choice of streams rather than what eg. <code>n</code> would provide.</p>",
        "id": 683350,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1547671654
    },
    {
        "content": "<p>Correct.</p>",
        "id": 683373,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547672390
    },
    {
        "content": "<p>In essence, all we're really doing here is porting the mobile unreads view to the web app.</p>",
        "id": 683374,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547672416
    },
    {
        "content": "<p>And there's not much data work to be done in the web app, as the left sidebar is basically a superset of the mobile view in terms of data.  It's all UI effort on the webapp side to copy mobile's cleaner presentation.  Mostly geared to new users, but actually helpful for users of all levels.</p>",
        "id": 683376,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547672488
    },
    {
        "content": "<p>I think it would make perfect sense to have a similar view in ZT.</p>",
        "id": 683378,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547672511
    },
    {
        "content": "<p>For ZT, I would actually consider putting the view in a popup that you just launch with a key.</p>",
        "id": 683380,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547673182
    },
    {
        "content": "<p>I'm not sure I follow that logic, if I understand you right.</p>",
        "id": 683526,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1547706563
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> Personally, I'd like to see a new menu item under All Messages that simply says Unread Messages and contains an almost exact copy of what we see on mobile. I would argue it should even be the default thing that people land on when they enter the realm. </p>\n<p>I think the current left sidebar has its use-cases and confusing the UX around it with an alternate view replacing may do more harm than good.</p>",
        "id": 683596,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1547728556
    },
    {
        "content": "<p>Yeah I feel like jamming the view into the sidebar feels wrong too, and I would rather have it be more like a landing page, like mobile.</p>",
        "id": 683620,
        "sender_full_name": "Steve Howell",
        "timestamp": 1547736160
    },
    {
        "content": "<p>One advantage of having it as a sidebar is you can jump to different topics without clicking back. With this in mind I would like to propose for ( probably the third time but I don’t give up easy ) that this new view follow an all new layout.</p>\n<p>Buddy list becomes collapsible and the unread topics take over the right part of the screen allowing you to jump to topics easily. Better yet buddy list becomes an expandable widget like Facebook. This is honestly quite trivial to implement since it just means positioning and collapsing the list with a toggle button.</p>",
        "id": 683639,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1547740585
    },
    {
        "content": "<p>I think it would be good to have some wireframe/mockup  for this. that makes it a lot easier to talk about these ideas.</p>",
        "id": 683957,
        "sender_full_name": "Alex-CL",
        "timestamp": 1547813402
    },
    {
        "content": "<p>I agree with this view in general. The benefits of this approach far outweigh the costs.</p>",
        "id": 683966,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1547815280
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"9830\">@Alex-CL</span> What is your preferred tool for generating wireframes/prototypes? Anything thats free to use?</p>",
        "id": 683967,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1547815316
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"5837\">@Armaan Ahluwalia</span>  tbh, I never found such software that is free and easy to use.   I always end up using pen + paper :)</p>",
        "id": 683975,
        "sender_full_name": "Alex-CL",
        "timestamp": 1547816550
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"9830\">@Alex-CL</span> <span class=\"emoji emoji-1f642\" title=\"slight smile\">:slight_smile:</span><span class=\"emoji emoji-1f44d\" title=\"+1\">:+1:</span>🏽 I’ve been really wanting to try out storybook. I’m seeing a lot of hype around the new kid on the block figma. More like photoshop less like a wire framing software but I feel like those lines are slightly blurry at least for me. I’ve tried out atomic and honestly really enjoyed the experience. Was super easy to create a clickable prototype on it. It’s really well done.</p>",
        "id": 683976,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1547816751
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"58\">@Steve Howell (showell)</span>  has any more consideration been given to a nested topic option in streams? It just seems that topics can get out of control when not nested</p>",
        "id": 1320135,
        "sender_full_name": "Mark Lemm",
        "timestamp": 1643701042
    },
    {
        "content": "<p>I haven't heard anything recently about that.</p>",
        "id": 1320314,
        "sender_full_name": "Steve Howell",
        "timestamp": 1643732931
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"22993\">@Mark Lemm</span> I don't think we're likely to add a feature of that form soon.  I would expect you can simulate whatever benefits one would get with nesting either creating additional streams or using naming conventions for particular classes of topics, e.g. <code>redesign / avatar style</code> or whatever.</p>",
        "id": 1324368,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1644288154
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> for the reply I am sorry to hear that but I can imagine you have lots of things to get to these days. I like the idea of grouping topics via nesting versus naming but yes I can do that for now.</p>",
        "id": 1324396,
        "sender_full_name": "Mark Lemm",
        "timestamp": 1644289678
    },
    {
        "content": "<p>The problem with adding additional layers of nesting is that it creates all these UI issues with how you display the nesting situation clearly, how do you search for those topics, etc.  I'm not going to say it's impossible, but it forces a set of tradeoffs that would likely make the experience worse for normal topics.</p>",
        "id": 1324398,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1644289784
    },
    {
        "content": "<p>I see the benefit of \"thread\" in a topic, similar to Slack, but it's a huge feature to do and with every new big feature there should be user education and edge cases coverage. I guess if many people request it that increases chances of being design/implemented. </p>\n<p>I think after the main redesign effort and other straightforward improvements it's possible to discuss \"threads\" or something addresses that pain.</p>\n<p>From my experience thread is useful when you might start discussion something off-topic. And there are multiple people in the conversations, so in one linear view there are multiple threads going on. I'm not a fan of this feature implementation in Slack. And Instead of expanding a thread I might prefer viewing it and collapsing. But kind of the same could be achieved with reply tree too.</p>",
        "id": 1324415,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1644292404
    }
]