[
    {
        "content": "<p>I think it would be really useful to add a topic pane to zulip. Here's what I mean -</p>\n<p>1) Move buddy list to a widget on the bottom right much like you see on facebook. <br>\n2) Add a 'Topic Pane' to the right sidebar in place of the buddy list. This means that whatever view you're in you're able to easily browse through the topics in that context organized by the time of last message.</p>\n<p>So for -<br>\n<strong>All messages view</strong> you would see a list of all topics and allow you to easily browse through all topics in zulip across all streams. Particularly useful when reading back through the history of a realm or catching up since you can easily mark topics you dont care about as read with right-click.</p>\n<p><strong>Private, messages starred messages and mentions</strong> - This could have a list of messages or topics but is more of a bonus to have this. Not particularly necessary but still nice to have</p>\n<p><strong>Streams</strong> - A list of topics within the stream chronologically much like you see in the left sidebar currently.</p>\n<p><strong>Search Results</strong> - This is something I've wanted since the beginning of using zulip. A list of topics for the search results page.</p>\n<p>I believe this could be a significant improvement to the user-experience of zulip and would like to get your thoughts. <span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> <span class=\"user-mention\" data-user-id=\"58\">@Steve Howell</span></p>",
        "id": 646115,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1537791820
    },
    {
        "content": "<p>Interesting thought. My experience is that I rarely try to access anything past the last 10 topics or so. Do you find yourself reaching back further?</p>",
        "id": 646128,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1537805325
    },
    {
        "content": "<p>Yes I went all the way back to the beginning of history in the design stream on the mobile app. It was a super useful UX flow to be able to browse by topic and I think it’s something we should try to replicate across zulip as a whole. It’s in line with the fact that zulip is indeed topic-oriented as opposed to message-oriented and makes most use-cases easier.</p>\n<p>I believe the space taken by the buddy list can be put to much better use by way of this kind of topic-oriented widget.</p>",
        "id": 646129,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1537805497
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"5837\">@Armaan Ahluwalia</span> to be more persuasive with feature ideas, I've found out that it is useful to split suggestions into two very separate parts. First would be the 'problem' and then the 'solution'. Once convinced a thing is a problem, a solution is easier to agree upon. Even if it is not the same solution, something will be done about it. When giving directly the solution, people focus a lot on what might be wrong with that approach <span class=\"emoji emoji-1f642\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 646147,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1537808888
    },
    {
        "content": "<p>To clarify: I am quite supportive of the suggestions, possibly in different forms <span class=\"emoji emoji-1f642\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 646148,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1537808928
    },
    {
        "content": "<p>We are advertising Zulip as 'the world’s most productive group chat'. I agree completely with this statement, if we look at it in the same way 'VIM is the most productive IDE' - definitely true for some part of the population of IDE consumers, but also totally not true for the rest.</p>",
        "id": 646150,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1537809053
    },
    {
        "content": "<p>I think our left and right panes can be reworked dramatically and improved significantly for only moderate amount of effort. That seems to me to be one of the most visible thing that can be improved.</p>",
        "id": 646151,
        "sender_full_name": "Boris Yankov",
        "timestamp": 1537809135
    },
    {
        "content": "<p>Thanks for your input <span class=\"user-mention\" data-user-id=\"284\">@Boris Yankov</span> . I believe the following user flows would be far improved by this feature -</p>\n<p>1. <strong>Catching up on a lot of missed messages</strong></p>\n<p>Usually a user scrolls through all messages or within a narrow. In either case, the new feature would allow you to more easily “scroll” or rather read through a bunch of missed messages By either clicking on that topic to read it or clicking on an icon to mark as read aka skipping that topic completely. This is an improvement over having to manually scroll through a topic they don’t have interest in which I often find myself doing when catching up. A mark as read icon could appear when hovering the topic on the right sidebar, or could be an additional menu on right click.</p>\n<p>2. <strong>Discovery / Search</strong> Since topics are first class citizens in zulip, it follows that their discovery should also be just as easy. Having the right sidebar on the search page makes topics listable discoverable much easier.</p>\n<p>The overarching idea with this feature is essentially enabling topics to become truly first class citizens within the design.<br>\nStreams are omnipresent within the app no matter what action you’re taking. The same should go for topics since the idea behind them is to abstract a bunch of information together. It follows that this level of granularity deserves a more permanent and reliable form of interaction in the UI.</p>",
        "id": 646158,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1537810256
    },
    {
        "content": "<p>For catching up on missed messages, I use <code>n</code> with <code>End</code> a lot. <br>\nI agree a \"mark this topic as read\" button could make sense, and maybe could be added to a revamped nav bar.</p>\n<p>One issue with topic discovery/search is that topics are menat to be really lightweight, similar to email subject lines or branch names in git. So topic names are not necessarily that well thought out.</p>",
        "id": 646159,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1537810507
    },
    {
        "content": "<p>You make a good poInt . I do think however that the interaction they would afford, would become an enabler for more efficient catching up and discovery. I can imagine a situation where one builds a “preview” feature that allows you to hover over a topic and it’s contents are temporarily previewed somehow.</p>",
        "id": 646181,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1537814198
    },
    {
        "content": "<p>Also, I don’t use shortcuts at all. I feel like a lot of users like me prefer mouse and click interactions and may not be that shortcut friendly at all. I’m curious about this though.</p>",
        "id": 646182,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1537814252
    },
    {
        "content": "<p>I think there is a key feature that the webapp is missing that the mobile app did a good job on, which is the main unreads view. <br>\nThe solution I've been imagining for that is to have a toggle on the left sidebar between the current \"All streams\" view, and an \"Unreads\" view. </p>\n<p>I think that would solve the catching up problem, at lesat?</p>",
        "id": 646186,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1537816099
    },
    {
        "content": "<p>I think the mobile app does do a good job of this. And I think having at least that as a minimum is a good thought for sure.<br>\nMy point here is we have more real estate to work with on the web app — it may be better to take advantage of this and provide a more standardised way of seeing content organised by topics whether it’s for searching, catching up or digging into older message history.</p>\n<p>I’m not sure of which approach is better from a code perspective though.</p>",
        "id": 646213,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1537821903
    }
]