[
    {
        "content": "<p>One big issue new folks have with zulip is confusion with interleaved views. What would folks think of the following change:</p>\n<ul>\n<li>Clicking on a stream name shows only the first topic.</li>\n<li>You have to click a second time (or use the <code>s</code> shortcut) to see the full stream view</li>\n</ul>\n<p>I think the main cost for experienced users is that when catching up on streams you don't care about, often you do want the stream-level interleaved view, so that you can hit <code>End</code> if nothing else. Also the double-click thing will be pretty hard to discover.</p>\n<p>(Note: If we do do such a change, I think we would absolutely want to try it on <a href=\"http://chat.zulip.org\" target=\"_blank\" title=\"http://chat.zulip.org\">chat.zulip.org</a> for a few days first :).)</p>",
        "id": 345417,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1511905315
    },
    {
        "content": "<p>So I'm definitely biased here by the way my brain works, but I've never been a big fan of the interleaved view.  So I support a more topic-centric approach in Zulip.  I'm 100% in favor of having clicking on a stream name show the first topic, which I assume you mean is the first one in the sidebar, aka the most recent topic.  In order to widen, I think we want to think about making a more obvious mechanism than the <code>s</code> shortcut to do it.  You can click on the recipient bar, of course, but that's not totally obvious either.</p>",
        "id": 345462,
        "sender_full_name": "Steve Howell",
        "timestamp": 1511906835
    },
    {
        "content": "<p>One brainstorm is to do something more obvious in the left sidebar when you're narrowed to a topic, so that the current stream has an obvious call-to-action for widening.</p>",
        "id": 345464,
        "sender_full_name": "Steve Howell",
        "timestamp": 1511906922
    },
    {
        "content": "<p>interesting. Maybe have the stream name look something like <br>\n<code>[# design    see all                    ]</code><br>\nafter you click <code># design</code> the first time. (With the \"see all\" in tiny font.)</p>",
        "id": 345470,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1511907060
    },
    {
        "content": "<p>My temptation here would be to just build something that does first-topic-by-default and then see what we need after trying it.  I don't think it would take that much work to prototype.</p>",
        "id": 345475,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1511907263
    },
    {
        "content": "<p>==Tim</p>\n<p>And I've come around to preferring a topic-centric approach -- as a longtime Zephyr/BarnOwl user I used to be for interleaved views all the time, but I've found <code>n</code> and a topic-centric approach very handy in keeping up with this realm over the past N months.</p>",
        "id": 345479,
        "sender_full_name": "Greg Price",
        "timestamp": 1511907380
    },
    {
        "content": "<p>To the point where when going to a stream, I almost always want to look at one topic at a time.</p>",
        "id": 345480,
        "sender_full_name": "Greg Price",
        "timestamp": 1511907408
    },
    {
        "content": "<p>Yeah, I agree with <span class=\"user-mention\" data-user-email=\"tabbott@zulipchat.com\" data-user-id=\"7\">@Tim Abbott</span> on doing a simple thing first and iterating.  So treat my sidebars suggestion as just a half-baked brainstorm and nothing more than that. <span class=\"emoji emoji-1f604\" title=\"smile\">:smile:</span></p>",
        "id": 345481,
        "sender_full_name": "Steve Howell",
        "timestamp": 1511907414
    },
    {
        "content": "<p>Opened as <a href=\"https://github.com/zulip/zulip/pull/7555\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/7555\">#7555</a></p>",
        "id": 345517,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1511909324
    },
    {
        "content": "<p>WIP as <a href=\"https://github.com/zulip/zulip/pull/7701\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/7701\">#7701</a></p>",
        "id": 372023,
        "sender_full_name": "Rohitt Vashishtha",
        "timestamp": 1512729925
    },
    {
        "content": "<p>I merged this.  <span class=\"user-mention\" data-user-email=\"aero31aero@gmail.com\" data-user-id=\"1406\">@Rohitt Vashishtha</span> It looked complete by the time I got to it, and I tested it out.  I guess a nice followup would be to get some node coverage.</p>",
        "id": 372494,
        "sender_full_name": "Steve Howell",
        "timestamp": 1512741356
    }
]