[
    {
        "content": "<p>Hi all. Is there a way for all to see which users were invited by whom <em>after</em> they've accepted the invite? Currently, I can see pending invitations that show whom invited whom at <code>Settings -&gt; Organisation -&gt; Invitations</code> but after a user is added, it appears the only record of this is transaction is stored in a <code>Private Message -&gt; Notification Bot</code> which means nobody else in the Zulip instance gets accountability around whom is adding whom. I guess I'm proposing that this information be added to the <code>Core Team</code> stream, much in the same way that new users are added to the <code>signups</code> topic there. For example, perhaps <code>Bob just signed up for Zulip...</code> could be changed to <code>Bob accepted Alice's invite to join Zulip</code> or something, if that is the case. Measures like this are important for our team where our instance is Invite only, and admins/moderators need to be keeping an eye on who has been invited, when, and by whom.</p>",
        "id": 1241550,
        "sender_full_name": "Jore",
        "timestamp": 1627798747
    },
    {
        "content": "<p>Did we wind up with an issue for this? I feel like I've heard discussion of it elsewhere recently.</p>",
        "id": 1268699,
        "sender_full_name": "Greg Price",
        "timestamp": 1634704359
    },
    {
        "content": "<p>I don't think so.  <span class=\"user-mention\" data-user-id=\"20503\">@Jore</span> would you be up for opening such an issue?  I think this is a pretty reasonable tweak to use a silent mention to indicate who invited the user.</p>",
        "id": 1270434,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1634942609
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"2187\">@Greg Price</span> and <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> sure thing. Here we go: <a href=\"https://github.com/zulip/zulip/pull/20080\">#20080</a></p>",
        "id": 1273191,
        "sender_full_name": "Jore",
        "timestamp": 1635365213
    }
]