[
    {
        "content": "<p>Hey folks! <span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> , <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> and I did some brainstorming on the default topic yesterday, and how one might be able to internationalize it. As a reminder, <code>(no topic)</code> is not internationalized currently because of the complexity of what happens when different users in an organization use different languages. (And even the organization's default language might occasionally change.)</p>\n<p>The idea that came up is that perhaps we could take the following approach:</p>\n<ul>\n<li>The default topic is encoded as blank string on the server side.</li>\n<li>The server tells clients what name to use for the topic (e.g., \"general chat\" or \"chatter\" (see <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/Renaming.20.28no.20topic.29\">#design &gt; Renaming (no topic)</a> ), but it would be relatively easy to change if we need to).</li>\n<li>Clients display the default topic name with special decoration, perhaps italics.</li>\n<li>Sending a message to general chat\" is <em>different</em> from sending to the special topic. So, you could have both \"general chat\" and \"<em>general chat</em>\" in the left sidebar, for instance.</li>\n<li>Since server-side the topic is always empty, the display name could be internationalized and shown in the user's language.</li>\n</ul>\n<p>In addition to the clients, we'd also have to make sure we do something reasonable in message notification emails and push notifications.</p>\n<p>Thoughts? CC <span class=\"user-mention\" data-user-id=\"2187\">@Greg Price</span> <span class=\"user-mention\" data-user-id=\"2406\">@Neil Pilgrim (neiljp)</span></p>",
        "id": 1489618,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673472746
    },
    {
        "content": "<p>There is currently no internationalization in ZT, so we would likely add it after this was adjusted.</p>",
        "id": 1489724,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1673478415
    },
    {
        "content": "<p>Regarding that you could have multiple versions of the same string in the topic list, that sounds confusing. Does that apply now to <code>(no topic)</code>?</p>",
        "id": 1489725,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1673478828
    },
    {
        "content": "<p>I understand the benefit of internationalizing it, but if the name could be apparently duplicated to users in some languages then it feels like it should be separated or styled <em>very</em> clearly from other topics - which isn't like now, or how I expect would be desired?</p>\n<p>If two topics named <code>general chat</code> exist, I could expect one user may try and rename the empty-topic one to the other (ie. combine them), and the no-topic translation would be lost... or would it? The messages would move, presumably, but would the empty-topic be conceptually present with no messages? If another user was messaging to blank, it would certainly look buggy in that regard.</p>\n<p>I'd also be concerned that in an internationalized context, if someone feels the name is inaccurate and wants to rename it to be more accurate more generally, doing so by a standard topic rename would leave it non-internationalized and confuse other users using a different language: their internationalized 'general chat' is now a specifically-named topic in a particular language. I'd need to test, but don't recall there's a way to put messages back into an empty topic?</p>",
        "id": 1489727,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1673480811
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2406\">Neil Pilgrim (neiljp)</span> <a href=\"#narrow/stream/101-design/topic/translating.20blank.20topic.20name/near/1489725\">said</a>:</p>\n<blockquote>\n<p>Regarding that you could have multiple versions of the same string in the topic list, that sounds confusing. Does that apply now to <code>(no topic)</code>?</p>\n</blockquote>\n<p>No, if a user sends a message with a blank topic, it's gets recorded as \"(no topic)\" on the server. Messages where the user puts \"(no topic)\" in the topic field go to the same place.</p>",
        "id": 1489730,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673482052
    },
    {
        "content": "<blockquote>\n<p>if the name could be apparently duplicated to users in some languages</p>\n</blockquote>\n<p>To be clear, it's not like we generally expect people to be explicitly sending messages to \"general chat\", and we can probably make this annoying to do in the typeahead UI.</p>",
        "id": 1489731,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673482148
    },
    {
        "content": "<blockquote>\n<p>would the empty-topic be conceptually present with no messages</p>\n</blockquote>\n<p>If the blank topic has no messages, we could decide what to do, but we probably wouldn't show it, no. We might initiate that topic with a bot message when a stream is created, but it would eventually end up low in the list if it's not being used.</p>\n<p>I didn't quite follow what would look buggy?</p>",
        "id": 1489732,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673482276
    },
    {
        "content": "<blockquote>\n<p>feels the name is inaccurate</p>\n</blockquote>\n<p>Mm, good point, we may want to change some aspects of the UI there. Maybe we should remove the pencil icon, and perhaps some of the topic menu options as well. While you may want to move messages out of the topic, conceptually, you can't really rename or move the topic itself.</p>",
        "id": 1489733,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673482646
    },
    {
        "content": "<p>As a stepwise improvement over what we have now, I should emphasize this seems good <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>\n<p>I think it also seems backwards compatible, if sending to or referring to empty or <code>(no topic)</code> topics continues to work?</p>",
        "id": 1491031,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1673829835
    },
    {
        "content": "<p>I had some thoughts when reading the connected topic and dropped them in there. I was going to reply and connect to that here, but it seemed good to break that out into another topic: <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/Beyond.20.28no.20topic.29.3F\">#design &gt; Beyond (no topic)?</a>.</p>",
        "id": 1491033,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1673832597
    },
    {
        "content": "<blockquote>\n<p>I think it also seems backwards compatible, if sending to or referring to empty or (no topic) topics continues to work?</p>\n</blockquote>\n<p>We'd probably want to move messages in \"(no topic)\" to the blank topic when doing the migration. People could of course still send messages to \"(no topic)\", but it wouldn't have any special meaning anymore.</p>",
        "id": 1491293,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673927616
    },
    {
        "content": "<p>While that migration seems important to do, to achieve this result, could we use something to avoid this behaving strangely with older clients? For example, support the old behavior translating to empty topics based on some client-capability?</p>",
        "id": 1491629,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1673992779
    },
    {
        "content": "<p>I feel fairly strongly that (no topic) shouldn't be possible if there's this special topic, and messages without topics should be sent to the general topic instead.</p>",
        "id": 1491651,
        "sender_full_name": "Evy",
        "timestamp": 1673993815
    },
    {
        "content": "<p>Maybe I'm misinterpreting -- would we deprecate it when adding this feature (for users on that version)?</p>",
        "id": 1491653,
        "sender_full_name": "Evy",
        "timestamp": 1673993861
    },
    {
        "content": "<p>This sounds like a reasonable UX design to me.</p>\n<p>There are questions we should figure out about exactly how this is represented in the API, which we should have a thread in <a class=\"stream\" data-stream-id=\"378\" href=\"/#narrow/stream/378-api-design\">#api design</a> about. In particular we'll want to take care with that to keep the experience reasonable on existing clients. I think the server will need to continue to treat the topic string \"(no topic)\" specially, at least when dealing with existing clients.</p>",
        "id": 1492336,
        "sender_full_name": "Greg Price",
        "timestamp": 1674073880
    },
    {
        "content": "<p>Depending on exactly how we handle that, this might also mean that if a user on a new client moves some messages, and for the new topic they type out the actual string \"(no topic)\", they'll see the messages appear instead at \"general chat\" or whatever.</p>\n<p>That'd be a bit quirky but I think would be fine in practice. The string \"(no topic)\" is not something one would naturally try to use as a topic name, so it's unlikely anyone will actually see that behavior unless they're specifically trying to exercise quirks in Zulip's \"no-topic topic\" concept.</p>",
        "id": 1492341,
        "sender_full_name": "Greg Price",
        "timestamp": 1674074079
    },
    {
        "content": "<p>I think the trickiest aspect of the UX here is what happens when</p>\n<ul>\n<li>there happens to be a topic whose actual name is \"chatter\" or whatever, and then</li>\n<li>the user tries to select either (a) the new special no-topic topic, or (b) the topic with the actual name \"chatter\",</li>\n<li>and does so <em>by typing the topic name</em>.</li>\n</ul>",
        "id": 1492345,
        "sender_full_name": "Greg Price",
        "timestamp": 1674074441
    },
    {
        "content": "<p>For example, if the user</p>\n<ul>\n<li>hits <code>c</code> in the web/desktop app to pull up the compose box, and then starts typing the topic they want to send to;</li>\n<li>or goes to the search box in web/desktop, intending to use the \"topic\" results in the typeahead there;</li>\n<li>or is looking at a stream narrow in mobile, and opens the compose box and types the topic they want to send to;</li>\n<li>or is in the terminal app, where I imagine there are several places one might type a topic name.</li>\n</ul>",
        "id": 1492350,
        "sender_full_name": "Greg Price",
        "timestamp": 1674074554
    },
    {
        "content": "<p>Say they go to any of those, and type \"chatter\".</p>\n<p>Both the no-topic topic, and the actual topic \"chatter\", are displayed in their UI as \"chatter\". One of those two is displayed in italics, perhaps, but it's not like their keyboard has a way to type italics.</p>\n<p>What should happen then? Which one should they get?</p>",
        "id": 1492354,
        "sender_full_name": "Greg Price",
        "timestamp": 1674074645
    },
    {
        "content": "<p>If there's a drop-down (or similar) and it just has those two as matching options, it seems like more than just styling would be useful. For example a (non-editable) <code>[default topic]</code> suffix. For UI supporting an empty/default text, it could also show that, and tabbing past it would use the default?</p>",
        "id": 1492370,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1674075252
    },
    {
        "content": "<p>(ZT won't show italic now, in any case, since bold is far more reliably supported)</p>",
        "id": 1492371,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1674075257
    },
    {
        "content": "<p>ZT supports autocomplete (not automatically), so we'd handle that in a similar way, though it strikes me we don't currently have an autocomplete for <code>(no topic)</code> if it currently exists (or not?) - would that matter here?</p>",
        "id": 1492376,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1674075384
    },
    {
        "content": "<p>Hm, yeah, while there would be no problem from a backend perspective, it seems easy for the UX to get confusing. I dunno if we'd want to disallow sending new messages to the topic actually name \"general chat\" in all languages post-migration?</p>",
        "id": 1492378,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674075584
    },
    {
        "content": "<p>That would minimize it, but there could still be existing topics named like that? So non-compose matches would still be an issue, in other cases like Greg mentioned.</p>",
        "id": 1492410,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1674076592
    },
    {
        "content": "<p>I suppose on upgrade the UI could suggest topic names be migrated, but that seems unprecedented and would break things?</p>",
        "id": 1492411,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1674076594
    },
    {
        "content": "<p>This all sounds like a huge amount of complexity for minimal benefit—the edge case of an edge case where a user with a language different from the organization language wants to see a single topic name, that we don’t even encourage using, translated in a way that’s not consistent with every other topic and every message?</p>",
        "id": 1492414,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1674076648
    },
    {
        "content": "<p>It introduces so many weird cases to think about. What if someone changes the translation of this special non-topic topic so that it collides with another topic that was previously fine?</p>",
        "id": 1492422,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1674076800
    },
    {
        "content": "<p>Yeah, I was imagining that having topics that happen to have the same name in the left sidebar or in search results is not a big deal. We'll have styling that hints at what's going on, and it would not come up very often. So <code>(no topic)</code> is the only one I was imagining we'd touch as part of the migration process.</p>",
        "id": 1492455,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674077613
    },
    {
        "content": "<p>Let's worry about the transition issues around <code>\"(no topic)\"</code> once we've figured out what we want the eventual experience to be. I agree they may be complicated, with the simplest options likely involving a migration to move every message that was previously in \"no topic\" (and maybe trying to do something to avoid that breaking links).</p>",
        "id": 1492593,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1674087672
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"699\">Anders Kaseorg</span> <a href=\"#narrow/stream/101-design/topic/translating.20blank.20topic.20name/near/1492422\">said</a>:</p>\n<blockquote>\n<p>It introduces so many weird cases to think about. What if someone changes the translation of this special non-topic topic so that it collides with another topic that was previously fine?</p>\n</blockquote>\n<p>There's weird edge cases around a default topic like \"(no topic)\" no matter how we handle it. Right now, we don't have a way to internationalize it at all, or even change it, without all sorts of breakage.</p>",
        "id": 1492594,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1674087864
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/translating.20blank.20topic.20name/near/1492455\">said</a>:</p>\n<blockquote>\n<p>Yeah, I was imagining that having topics that happen to have the same name in the left sidebar or in search results is not a big deal. </p>\n</blockquote>\n<p>Yeah, that's my thinking. Special-casing specific topic names that differ between different users is a path to madness, for the reasons Anders pointed out -- you end up with an ever-expanding set of topic names that need to be special because they're a translation of the special topic into another language. </p>\n<p>The only escape from that class of problem that I see is for the empty string to be the only special topic -- because that is the same in every language. The italics display proposal above is an attempt to solve the problem of \"How do we display and talk about the empty string topic / topicless messages in navigation UI\".</p>",
        "id": 1492595,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1674088039
    },
    {
        "content": "<p>So the way I think about this proposal is to replace <code>(no topic)</code> with the empty string, and then figure out a way to display the empty string in clients that isn't in the same visual space as the topic whose name is whatever we use to display it (italics being the specific proposal to achieve that).</p>",
        "id": 1492596,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1674088125
    },
    {
        "content": "<p>OK. In that case I think the tricky part to focus on, UX-wise, is what happens on the user input side (the dual to how we display things):</p>\n<p><span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> <a href=\"#narrow/stream/101-design/topic/translating.20blank.20topic.20name/near/1492345\">said</a>:</p>\n<blockquote>\n<p>I think the trickiest aspect of the UX here is what happens when</p>\n<ul>\n<li>there happens to be a topic whose actual name is \"chatter\" or whatever, and then</li>\n<li>the user tries to select either (a) the new special no-topic topic, or (b) the topic with the actual name \"chatter\",</li>\n<li>and does so <em>by typing the topic name</em>.</li>\n</ul>\n</blockquote>\n<p>The outcome that results if we take that proposal literally with no further elaboration is:</p>\n<ul>\n<li>If the user types \"chatter\", they get (b), the topic with that actual name.</li>\n<li>If the user wanted (a), they need to type the empty string.</li>\n</ul>\n<p>Say the user does want (a). How do they figure out they need to type the empty string?</p>\n<p>After all, we're not showing them an empty string — we're showing them something like \"<em>chatter</em>\", in italics (or some other variation in clients like terminal.)</p>",
        "id": 1492616,
        "sender_full_name": "Greg Price",
        "timestamp": 1674093098
    },
    {
        "content": "<p>Also with that proposal the question is no longer really specific to where there happens to be a topic whose actual name is \"chatter\". It's really just</p>\n<ul>\n<li>There's some discussion in the special no-topic topic, so a user wants to select that topic. (Either to navigate to viewing its messages, or to send to it, or to #-mention it in a message, or something else.)</li>\n<li>They try to do so by typing the topic name.</li>\n</ul>\n<p>On this proposal as it stands, they'll need to type the topic name as an empty string. How do they figure that out?</p>",
        "id": 1492617,
        "sender_full_name": "Greg Price",
        "timestamp": 1674093340
    },
    {
        "content": "<p>I want to emphasize that my initial responses to this were based on:</p>\n<ul>\n<li>Considering any translation interop with ZT - but ZT is not internationalized, so...</li>\n<li>Then broader potential usage issues; these were from an international perspective, since that was the topic, but some apply simply from the complexity of changing from <code>(no topic)</code> to another name (so could have gone in the other topic)</li>\n<li>Enjoying UI discussions, but also interested in how we'd migrate to such a new system, for compatibility; I appreciate this was a first call on the (extended) idea, and I wasn't initially up to date on <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/Renaming.20.28no.20topic.29\">#design &gt; Renaming (no topic)</a>, but it would be useful to know the scope of requested feedback, if to initially avoid more implementation/migration details. (otherwise you get my semi-curated brainstorming here, instead of distilled from a conversation)</li>\n</ul>",
        "id": 1492619,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1674094001
    },
    {
        "content": "<p>Here is how I see that:<br>\nThe are 2 ways to compose to <strong><em>chatter</em></strong> (empty topic): 1. select it among the topics 2. click new topic button and don't write anything to it or remove the topic with a cursor<br>\nIf you write actual <strong>chatter</strong> (real name for a real new new topic) word in the topic it will not be italic and it will be a separate topic.</p>\n<p>Yes it is source of confusion and such mistake could happen. We could catch it with a warning banner + we could provide ability to fix that by allowing moving messages to <strong><em>chatter</em></strong> (empty topic)</p>",
        "id": 1492962,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1674150008
    },
    {
        "content": "<p>I think as long as the typeahead makes it hard to select \"general chat\" as your topic (by having the first option be the empty topic), probably that sort of collision won't come up except for folks trying to break the app, so it wouldn't be a significant source of confusion.</p>",
        "id": 1492976,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1674152207
    },
    {
        "content": "<p>I think we'll be relying a lot on the typeaheads to explain what's going on. We probably want some additional explanation alongside the italicized topic name.</p>",
        "id": 1493148,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674156248
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"2406\">Neil Pilgrim (neiljp)</span> <a href=\"#narrow/stream/101-design/topic/translating.20blank.20topic.20name/near/1492619\">said</a>:</p>\n<blockquote>\n<p>also interested in how we'd migrate to such a new system, for compatibility</p>\n</blockquote>\n<p>This will be an important set of questions, and I think it's best discussed in its own thread on <a class=\"stream\" data-stream-id=\"378\" href=\"/#narrow/stream/378-api-design\">#api design</a>. Probably after we get in this discussion to a good sense of what we want the UX to be.</p>",
        "id": 1493253,
        "sender_full_name": "Greg Price",
        "timestamp": 1674161182
    },
    {
        "content": "<p>I'm not sure where we are with this discussion -- are we agreed that we should move forward with the general plan, and there will be details we'll need to resolve along the way? Or are there remaining concerns we should hash out upfront? CC <span class=\"user-mention\" data-user-id=\"2187\">@Greg Price</span></p>",
        "id": 1498146,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1674851257
    },
    {
        "content": "<p>I'm not sure we have a complete plan yet for what the UX looks like. I think the main question is:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span> <a href=\"#narrow/stream/101-design/topic/translating.20blank.20topic.20name/near/1492617\">said</a>:</p>\n<blockquote>\n<p>Also with that proposal the question is no longer really specific to where there happens to be a topic whose actual name is \"chatter\". It's really just</p>\n<ul>\n<li>There's some discussion in the special no-topic topic, so a user wants to select that topic. (Either to navigate to viewing its messages, or to send to it, or to #-mention it in a message, or something else.)</li>\n<li>They try to do so by typing the topic name.</li>\n</ul>\n<p>On this proposal as it stands, they'll need to type the topic name as an empty string. How do they figure that out?</p>\n</blockquote>",
        "id": 1498245,
        "sender_full_name": "Greg Price",
        "timestamp": 1674857332
    },
    {
        "content": "<p>We have a proposed answer to that for the case of composing:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> <a href=\"#narrow/stream/101-design/topic/translating.20blank.20topic.20name/near/1492962\">said</a>:</p>\n<blockquote>\n<p>Here is how I see that:<br>\nThe are 2 ways to compose to <strong><em>chatter</em></strong> (empty topic): 1. select it among the topics 2. click new topic button and don't write anything to it or remove the topic with a cursor</p>\n</blockquote>\n<p>but that leaves open what to do in the search navigation at the top of the web app, what to do for #-mentions, and perhaps other things.</p>",
        "id": 1498249,
        "sender_full_name": "Greg Price",
        "timestamp": 1674857386
    },
    {
        "content": "<p>Once we have a clear idea of the basic design on the UX side, then there are things we need to figure out about the API and we'll need a discussion in <a class=\"stream\" data-stream-id=\"378\" href=\"/#narrow/stream/378-api-design\">#api design</a> about those. That includes the concerns <span class=\"user-mention silent\" data-user-id=\"2406\">Neil Pilgrim (neiljp)</span> was raising above about how existing clients will interact with the new scheme.</p>",
        "id": 1498252,
        "sender_full_name": "Greg Price",
        "timestamp": 1674857511
    },
    {
        "content": "<p>I'm pretty confident that we <em>can</em> find a good answer to those latter questions, for whatever plan we might wind up with on the UX side. So I think it makes sense to sequence the discussion that way.</p>",
        "id": 1498253,
        "sender_full_name": "Greg Price",
        "timestamp": 1674857694
    },
    {
        "content": "<p>Yeah, I think \"how is this represented in search typeahead\" is probably one of the more interesting questions to answer about the UX design here... as well as what to do in contexts, like an email notification subject line, where we don't have the opportunity to do any styling.</p>",
        "id": 1501761,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675388233
    },
    {
        "content": "<p>Do we localize email notifications line? I don't see the problem of naming <code>general chat</code> in the same language as email comes.</p>\n<p>As I understand the language of typeahead isn't localizable? things like <code>stream:</code> and <code>topic:</code> are always in english, right? So the name of such <code>general chat' could be represented there too or just as </code>topic:general`.</p>",
        "id": 1502747,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1675560778
    },
    {
        "content": "<p>It's correct that we don't localize the search operators like <code>stream:</code>, yes. But suppose that you want to search for \"general chat\" -- there's still a question of what you type, because it's probably not intuitive that you need to type <code>topic:\"\"</code> to search for the empty string.</p>",
        "id": 1503027,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675620396
    },
    {
        "content": "<p>For email notifications, he point is that this is a case where the solution discussed above of using italics styling to keep the blank topic that is displayed as \"general chat\"  separate from the topic that is called \"general chat\" (Spelled in the user's language) can't be used in email notifications, since we can't style the topic in the subject line there.</p>\n<p>If we thought that a problem important enough to solve, we could consider doing a subject line like \"general chat in #streamname\" or \"#streamname general chat\", rather than \"#streamname &gt; general chat\", as an alternative way to break out of the namespace of actual topic names.</p>",
        "id": 1503028,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675620522
    },
    {
        "content": "<p>OK, let me try to list out the places where this comes up with proposed solutions, and we can see how we feel about it.</p>\n<h2>Matching behavior for searches, filters and typeaheads</h2>\n<ul>\n<li>Before there is input, show at the top of the typeahead suggestions with special styling (italics)</li>\n<li>Always use the localized string</li>\n<li>Matches as if it were the translated \"general chat\" string in the user's language.</li>\n</ul>\n<h2>Compose box topic</h2>\n<blockquote>\n<p>The are 2 ways to compose to chatter (empty topic): 1. select it among the topics 2. click new topic button and don't write anything to it or remove the topic with a cursor</p>\n</blockquote>\n<p>There will be special styling (italics) in the typeahead and the topic box itself.</p>\n<h2>Stream &gt; topic mentions (like <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/translating.20blank.20topic.20name\">#design &gt; translating blank topic name</a> )</h2>\n<p>Selecting it in the typeahead puts, e.g., <code>#**design&gt;** </code> into the compose box. This is a little weird, but might be the best option?</p>\n<h2>Search</h2>\n<p>Represented as <code>topic:</code> or <code>topic:\"\"</code> in the search box (whatever folks think makes sense). Will have nice special styling once we do a transition to pills.</p>\n<h2>Email subject</h2>\n<p>I don't have strong feeling son this one, but \"general chat in #streamname\" (localized) seems OK.</p>\n<h2>Left sidebar, message header bar, muted topics settings</h2>\n<p>Show with special styling.</p>\n<h2>Topic URL</h2>\n<p>Leaving this one for an engineer to comment.</p>",
        "id": 1504568,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1675811040
    },
    {
        "content": "<p>Does that cover all the places we need to discuss?</p>",
        "id": 1504570,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1675811060
    },
    {
        "content": "<p>I'd like to propose something that might simplify some of the complexity here: </p>\n<p>What if the default topic name was be the same across an organization (but would be translated to the default language of the organization).</p>\n<p>Reasoning: Other topic names aren’t translated, so it seems reasonable for this one to be in whatever language is spoken by the users sharing that topic. (maybe we would allow it to be renamed by administrators on a per stream basis?)</p>\n<p>This would let us more easily prevent a topic from having the same name as the default topic, which would make it easier to reference this topic name in various places and <em>would help us support old clients that don’t know the difference between the special default topic and other topics</em></p>\n<ul>\n<li>It would be implemented as one blacklisted topic name per org (or stream)</li>\n<li>When admins choose or confirm the default topic name, they can also make an explicit choice about what to do with any topic that already has that name</li>\n</ul>",
        "id": 1605169,
        "sender_full_name": "Evy",
        "timestamp": 1688664566
    },
    {
        "content": "<p>I started a design doc for what this could look like: <a href=\"https://paper.dropbox.com/doc/no-topic-to-general-chat--B7m1~i_RU8ktN1bVlk9iX4EdAg-Bsq0arjmYUM5O5AsehagQ\">https://paper.dropbox.com/doc/no-topic-to-general-chat--B7m1~i_RU8ktN1bVlk9iX4EdAg-Bsq0arjmYUM5O5AsehagQ</a> (view and comment access for anyone with the link)</p>",
        "id": 1605179,
        "sender_full_name": "Evy",
        "timestamp": 1688664923
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"21453\">@Evy</span> the reason we proposed <code>\"\"</code> for this purpose is that the default language for the organization is mutable, and it feels like we'll have to do something quite ugly in order to implement changing the value of the default topic.</p>",
        "id": 1605374,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1688679957
    },
    {
        "content": "<p>I think there's some annoying backwards-compatibility work needed to have older clients do something reasonable with it, but I think it' s a cleaner long-term model for changing the value of an organization setting to not require moving a topic in every single stream. (Presumably, we could automate it rather than making the user do it, but it still seems super messy).</p>",
        "id": 1605375,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1688680022
    },
    {
        "content": "<p>To be clear, I'm not talking about storing it as those strings attached to the message. The topic would be referred to with the empty string on messages, and the name the server replaces it with would be decided by the organization settings.</p>",
        "id": 1605378,
        "sender_full_name": "Evy",
        "timestamp": 1688680215
    },
    {
        "content": "<p>I'm talking about how to handle the UI problem where the default topic can have the same name as another topic, and I think that everyone in the org seeing the same default topic name string simplifies this a lot.</p>",
        "id": 1605379,
        "sender_full_name": "Evy",
        "timestamp": 1688680316
    },
    {
        "content": "<p>Does that make sense?</p>",
        "id": 1605380,
        "sender_full_name": "Evy",
        "timestamp": 1688680322
    },
    {
        "content": "<p>Ahh, yes, that makes sense. I'm still not entirely sure what we'll want but I think that's one of the credible options.</p>",
        "id": 1605491,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1688686459
    },
    {
        "content": "<p>The organization language can be changed but it isn’t going to be changed regularly. When it is changed, do we really want to automatically break historical references to the old topic name?</p>",
        "id": 1607048,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1689007831
    },
    {
        "content": "<p>I think it should take the name of the initial language, and probably be allowed to be changed if the new name isn't taken by any existing topics</p>",
        "id": 1607192,
        "sender_full_name": "Evy",
        "timestamp": 1689018230
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"699\">Anders Kaseorg</span> <a href=\"#narrow/stream/101-design/topic/translating.20blank.20topic.20name/near/1607048\">said</a>:</p>\n<blockquote>\n<p>The organization language can be changed but it isn’t going to be changed regularly. When it is changed, do we really want to automatically break historical references to the old topic name?</p>\n</blockquote>\n<p>Yeah, that's the type of weird issue that makes me prefer a fixed encoding for the blank topic name on the wire/API; and if we have some display sugar for it, that sugar should just be in the UI, and not ever be stored somewhere.</p>",
        "id": 1609111,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1689262627
    },
    {
        "content": "<p>I really think it will cause UX headaches if we allow regular topics to have the same name as the general chat topic.</p>",
        "id": 1609136,
        "sender_full_name": "Evy",
        "timestamp": 1689263264
    },
    {
        "content": "<p>Well the idea, which we've not fully thought through, was to have <em>general chat</em> (italics) or some other styled thing be the name for the special topic. But yeah I'm not sure what will feel right; we should think about it more when we have the attention to push through the overall change (there's a lot of migration complexity no matter which option we pick).</p>",
        "id": 1609143,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1689263375
    },
    {
        "content": "<p>I understand that's the idea, but it creates complexity for things like the dropdown and typing links to topics, which the idea I suggested wouldn't have.</p>",
        "id": 1609146,
        "sender_full_name": "Evy",
        "timestamp": 1689263450
    }
]