[
    {
        "content": "<p>Currently we only show typeahead suggestions after the user has entered a character. E.g. after <code>@x</code> rather than <code>@</code>. I was a proponent for the character after for a while, but after watching someone use Zulip today I realized that if you're not confident you're doing the right thing, having the typeahead show up immediately is nice. I think it's also compelling that other products seem to do it this way (tested github, slack, paper). </p>\n<p>Thoughts?</p>",
        "id": 706770,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1550995898
    },
    {
        "content": "<p>I agree. It happens to me often with at and : across different products I like to confirm it’s possible by seeing a popup</p>",
        "id": 706771,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1550997660
    },
    {
        "content": "<p>I don't have a strong opinion here, but as long as there is some logical way to make suggestions on zero characters, which there almost always is, I say we should do it.</p>",
        "id": 706805,
        "sender_full_name": "Steve Howell",
        "timestamp": 1551011416
    },
    {
        "content": "<p>Usually alphabetical should be pretty logical or better yet contextual. But alphabetical is a good start.</p>",
        "id": 706953,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1551060710
    },
    {
        "content": "<p>I feel like having early-mention is a behavior which can be alternately annoying or useful depending on what you're trying to do and how good the suggestions are.  We might need to implement a different algorithm for that 0-character case than we want with a single character (because it should probably do alphabetical last in order to be net useful).</p>",
        "id": 707336,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1551123465
    },
    {
        "content": "<p>We could also replace this block:<br>\n<a href=\"/user_uploads/2/27/L9jBkG-2H0jqnZ2-k2Zsk0wk/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/27/L9jBkG-2H0jqnZ2-k2Zsk0wk/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/2/27/L9jBkG-2H0jqnZ2-k2Zsk0wk/pasted_image.png\"></a></div><p>An alternative approach for the onboarding issue is to add \"Autocompletes from <code>@j</code>\"</p>",
        "id": 707337,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1551123503
    },
    {
        "content": "<p>I don't have a strong opinion on which way is correct for this in Zulip.</p>",
        "id": 707338,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1551123530
    }
]