[
    {
        "content": "<p>So, currently one of the major sticking points of every one of my coworkers that I get to try Zulip is \"It's so ugly\", \"it's uninviting\", \"it's a mess\". </p>\n<p>After using zulip for just a few hours I felt that the UI was perfect, but this seems to be the main sticking point for anyone new I show the platform. I feel that if Organizations were able to customize the CSS easily (not by building their own version, but instead by using the tools available in the Organization Settings panel) it would appeal more widely to many people. </p>\n<p>I'm trying to get some more information about what people think is 'ugly', but is Zulip open to adding some sort of feature like that? Or is it already on the Roadmap? Has it already been talked about and the answer is no?</p>",
        "id": 762700,
        "sender_full_name": "Tyler Thrailkill",
        "timestamp": 1562107424
    },
    {
        "content": "<p>Supporting customized CSS would severely restrict our freedom to make improvements for everyone.</p>",
        "id": 762701,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1562107509
    },
    {
        "content": "<p>I see. It's not an option to just 'break' the customized CSS on an upgrade then, even if it's a major version change.</p>",
        "id": 762704,
        "sender_full_name": "Tyler Thrailkill",
        "timestamp": 1562107594
    },
    {
        "content": "<p>(We’d be locked into retaining the same DOM structure, CSS class names, etc. that custom CSS might be relying on.)</p>",
        "id": 762705,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1562107596
    },
    {
        "content": "<p>Would that not be part of the 'breaking changes' you introduce? or are breaking changes something zulip tries to avoid?</p>",
        "id": 762719,
        "sender_full_name": "Tyler Thrailkill",
        "timestamp": 1562107996
    },
    {
        "content": "<blockquote>\n<p>(We’d be locked into retaining the same DOM structure, CSS class names, etc. that custom CSS might be relying on.)</p>\n</blockquote>\n<p>If customising of UI is through a settings panel, then we wouldn't be locked into retaining these. As these are changed so are the customising options in the UI (since even customisation feature is controlled by Zulip and not dependent on user).</p>",
        "id": 762860,
        "sender_full_name": "Abhigyan Khaund",
        "timestamp": 1562127694
    },
    {
        "content": "<p>Well I mean if we can go to the effort of implementing options like “UI: (•) ugly ( ) not ugly” then we might as well just change everything to “not ugly” instead.</p>",
        "id": 762881,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1562132624
    },
    {
        "content": "<p>I don’t think there’d be opposition to making Zulip prettier for everyone.</p>",
        "id": 762882,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1562132666
    },
    {
        "content": "<p>Just popping here to say this: I think what people want is themes, in this case. The UI is really good, but if there was an option to customize the colors and the general design to a group's liking, that would be wonderful, is what they're asking. I'm not really sure though, is this right, <span class=\"user-mention\" data-user-id=\"12809\">@Tyler Thrailkill</span> ?</p>",
        "id": 762923,
        "sender_full_name": "Isham Mahajan",
        "timestamp": 1562154692
    },
    {
        "content": "<p>I'm really not actually sure. I've asked 4 of our UI designers what they think could be improved, by sending them screenshots of slack and zulip side by side. I said \"what would you improve about both of these apps\". I'm also trying to get feedback about what people think is confusing, because I <em>also felt the exact same way when using zulip for the first time</em>, but for the life of me, after using it for just a few hours, I cannot remember at all what was so confusing about it. </p>\n<p>Some initial feedback </p>\n<blockquote>\n<p>Designer 1: Sure! Right off the bat it looks cluttered and kinda outdated. I'll think on this more ^^</p>\n<p>Designer 2: Right off the bat it’s sharp and blocky but I too will think more on it!</p>\n<p>Designer 3: for the first one, theres too much white space between all the sections.  And I think the threading sections within a channel is confusing.<br>\nits confusing because there is nothing to draw your eye to a certain region, they all have the same background</p>\n</blockquote>\n<p>I think a group of themes <em>may</em> be the answer? I think having the option at all would be nice. I mean, slack has it so Zulip probably _should_ have some alternative (besides just dark and light modes).</p>",
        "id": 762996,
        "sender_full_name": "Tyler Thrailkill",
        "timestamp": 1562168299
    },
    {
        "content": "<p>In the mean time you might want to check out the CSS file from the topic <a href=\"#narrow/stream/101-design/topic/ideas.20for.20a.20new.20theme/near/738589\" title=\"#narrow/stream/101-design/topic/ideas.20for.20a.20new.20theme/near/738589\">ideas for a new theme</a>. I have been using it in the desktop app (through the Settings -&gt; General -&gt; Advanced -&gt; Add custom CSS) and it looks great.</p>",
        "id": 763083,
        "sender_full_name": "Henrik Gustafsson",
        "timestamp": 1562177996
    },
    {
        "content": "<p>Some more comments from our designers.</p>\n<blockquote>\n<p>Designer 3:<br>\ni think if you are viewing the whole channel, the subheaders are too heavy<br>\nthey add too much obstruction to the view</p>\n<p>me: <br>\nah, that's totally it...... hm. wonder what you could do instead.<br>\nbecause you can 'click' into topics from the whole channel view.</p>\n<p>Designer 3:<br>\neither a much lighter title bar, or like a vertical grouping?<br>\nso you could read it all but then view the topic on the side?  not sure if thats clear enough</p>\n<p>me:<br>\nhm.. so a lighter title bar like this? if you select one message it 'unhighlights' the rest of the title bars (and message)<br>\nScreen Shot 2019-07-03 at 10.08.24 AM.png </p>\n<p>Designer 3:<br>\nlighter as in not a colored background that visually blocks the readers eyes<br>\nthat tells them to stop or creates a heavy sectioning</p>\n<p>me:<br>\nI see, I think they did a colored background for the <code>All Messages</code> view, which I think is just plain confusing.</p>\n<p>Designer 3:<br>\nyup!<br>\nits very hard to read that chronologically that way.</p>\n<p>me:<br>\nyeah it is, I completely agree. so you think some sort of like bar on the left?</p>\n<p>Designer 3:<br>\nor just a light gray text with the topic above those posts if you are in the view all window</p>\n</blockquote>\n<p>It seems that maybe that CSS from the link <span class=\"user-mention\" data-user-id=\"12770\">@Henrik Gustafsson</span>  provided is maybe closer to the optimal design? I think one major improvement would be <em>not</em> coloring the headers inside of a Stream view (is that the right name???). Really what matters in a stream view are the topics themselves, and if you're in a stream view they really don't matter <em>that</em> much. If you care about the topic in a stream view you will search for the topic name. </p>\n<p>One issue I see is that the Stream name is repeated on every header, even when you're in the Stream and can clearly see at the top what Stream you are in. </p>\n<p>I wonder if some design like <a href=\"/user_uploads/2/60/myO8-RNK83EuvIfDutUkquvx/Screen-Shot-2019-07-03-at-5.57.29-PM.png\" target=\"_blank\" title=\"Screen-Shot-2019-07-03-at-5.57.29-PM.png\">this</a> would be more optimal, though it's still confusing, it's a bit 'less' confusing. </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/60/myO8-RNK83EuvIfDutUkquvx/Screen-Shot-2019-07-03-at-5.57.29-PM.png\" target=\"_blank\" title=\"this\"><img src=\"/user_uploads/2/60/myO8-RNK83EuvIfDutUkquvx/Screen-Shot-2019-07-03-at-5.57.29-PM.png\"></a></div><p>Just spitballing here though, and thought that design feedback from a bunch of other designers might help.</p>",
        "id": 763182,
        "sender_full_name": "Tyler Thrailkill",
        "timestamp": 1562198333
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"12809\">@Tyler Thrailkill</span> one thing worth mentioning is that the navbar in master is a mess; we have our future navbar design test-deployed here but haven't been able to integrate it yet.</p>",
        "id": 763215,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1562212079
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> the navbar is the titlebar plus the search bar all the way over to the settings cog?</p>",
        "id": 763216,
        "sender_full_name": "Tyler Thrailkill",
        "timestamp": 1562212165
    },
    {
        "content": "<p>I guess so.  The thing that's changed is just the center panel.</p>",
        "id": 763221,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1562212301
    },
    {
        "content": "<p>One other thing we've been discussing is switching the default theme from the day theme to the night theme, since people seem to like the night theme a lot more.  I'd be curious for opinions on that.</p>",
        "id": 763223,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1562212334
    },
    {
        "content": "<p>Ok, I thought I had noticed that. I think what my coworker was talking about isn't the navbar at the top though, but the like, header things in each 'topic' section</p>",
        "id": 763224,
        "sender_full_name": "Tyler Thrailkill",
        "timestamp": 1562212357
    },
    {
        "content": "<p>Ahh.  Our view is there's definitely an onboarding issue that new users look at interleaved views a lot more than they should which contributes to that reaction.  We have some in-progress plans to significantly change that situation involving a different default structure for the left sidebar focused on just unread messages.</p>",
        "id": 763235,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1562213532
    },
    {
        "content": "<p>I think that would help. The ability to disable <code>All messages</code> by default also might help? You bringing that up also kind of mimics something I encountered earlier that I wished was possible, but is probably reserved for a separate topic, muting a Stream but unmuting a Topic inside that stream.</p>",
        "id": 763239,
        "sender_full_name": "Tyler Thrailkill",
        "timestamp": 1562213888
    },
    {
        "content": "<p>Yeah, it's our intent to make \"All messages\" a lot less visible (sorta at the priority of \"starred messages\".</p>",
        "id": 763244,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1562214184
    },
    {
        "content": "<p>Apparently, people from electron-builder have also migrated from Slack to Zulip and they also seem to have similar views about the fonts and the design. An issue was opened by one of the maintainers <a href=\"https://github.com/zulip/zulip-desktop/issues/786\" target=\"_blank\" title=\"https://github.com/zulip/zulip-desktop/issues/786\">here</a>.</p>",
        "id": 763824,
        "sender_full_name": "Vipul Sharma",
        "timestamp": 1562271049
    },
    {
        "content": "<p>Funnily enough, I think zulip's font is much better than slack, but yes some improvements need to be made.</p>",
        "id": 763825,
        "sender_full_name": "Tyler Thrailkill",
        "timestamp": 1562271678
    }
]