[
    {
        "content": "<p>Hhere is a suggestion for user mention highlight (think that you are Palash Raghuwanshi who watches his Zulip): <a href=\"/user_uploads/2/3a/2LHOmO8oB2ckDbDKfJ7H_Kch/mention-03-01.png\">mention-03-01.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/3a/2LHOmO8oB2ckDbDKfJ7H_Kch/mention-03-01.png\" title=\"mention-03-01.png\"><img src=\"/user_uploads/2/3a/2LHOmO8oB2ckDbDKfJ7H_Kch/mention-03-01.png\"></a></div><ul>\n<li>We don't want people to miss mentions, so background highlight seems a good way to do that</li>\n<li>We don't want people to worry, so yellow/orange isn't a color of the highlight and green is no-worry color</li>\n<li>We show online users with green, so a person would see the mention once they would be online, that is why background highlight is green</li>\n<li>I'm not sure if we can distinguish technically styles of general mentions and mentions of \"me\" user, but it would be nice. If not, having everybody highlighted as green seems fine.</li>\n</ul>",
        "id": 1315532,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1643080802
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span>  any feedback?</p>",
        "id": 1316080,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1643168438
    },
    {
        "content": "<p>I think the green shade there is too subtle.  We want your being mentioned to be something that gets your attention when skimming past 30 messages in a long thread, one of which mentions you.  I think that argues for there being some modification in the display of the message itself, beyond just the mention text, to indicate that the message mentions you.</p>\n<p>That said, I've always disliked the really strong red highlight that currently gets applied to mentions of yourself, so I'm glad we're discussing this.</p>",
        "id": 1316561,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643233008
    },
    {
        "content": "<p>We absolutely can display mentions of yourself differently from mentions of other users.  So I'd do mockups with a message that mentions yourself and someone else, for example.</p>",
        "id": 1316562,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643233082
    },
    {
        "content": "<p>Also we should keep in mind <a href=\"https://zulip.com/help/mention-a-user-or-group#silently-mention-a-user\">silent mentions</a>, e.g. <span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span>, which is a way to reference a unique person in the organization without asking for their attention.  Worth reading the rest of the article, since <code>@all</code> and mentions of user groups are also of interest.  (And we can use the information of whether you're in a user group when rendering).</p>",
        "id": 1316563,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643233128
    },
    {
        "content": "<p>(These are visually distinguished in the UI by not having an <code>@</code> sign at the front of the pill, and a few other styling details).</p>",
        "id": 1316564,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643233199
    },
    {
        "content": "<p>Clicking on a mention shows you information about the user, and ideally we'd hint that rather than having mentions of users appear like normal text.</p>",
        "id": 1316567,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643233216
    },
    {
        "content": "<p>Mm, I like the idea of potentially distinguishing individual vs. group mentions. That is often relevant information for how much/how urgently you need to pay attention to the message.</p>\n<p>The idea of distinguishing mentions of yourself vs. others is potentially helpful as well. It's currently not easy to see at a glance where you were silently mentioned. Silent @-mentions are often messages you want to pay attention to, just not as urgently as non-silent mentions.</p>",
        "id": 1316607,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1643238125
    },
    {
        "content": "<p>Well, the vision for silent mentions is that it's just a way to say someone's name that is clear and specific (especially in large organizations where there may be many folks with the same first name, for example).  </p>\n<p>It is of course likely that you're more interested in messages that include your name (or the name of your team, etc.), but I'm not sure that translates into it being the case that we should make these more prominent by being highlighted if they refer to you.</p>",
        "id": 1316614,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643238909
    },
    {
        "content": "<p>I was thinking maybe a different color/intensity/? just on the @-mention part, rather than a full-message highlight. (Not sure -- just an idea.)</p>",
        "id": 1316620,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1643239259
    },
    {
        "content": "<p>wow that is more complex than I thought</p>",
        "id": 1316706,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1643255198
    },
    {
        "content": "<p>So if somebody silent mention me I don't have notification (I don't have them in general). But would that mean that I don't have any counter in my Zulip anywhere? Would I still see that message inside <code>@Mentinos</code>?</p>",
        "id": 1316709,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1643255742
    },
    {
        "content": "<p>This is just one data point, but if somebody silently mentions me, I am glad not to get notified (although that's moot for me, since I turn notifications off), but once I get to the message views I really don't care whether it's silent or not, because even if somebody mentions my name where it's not a call of action or specific question addressed to me, I want to see it.</p>\n<p>I suspect others will disagree, and it seems fine to just have slightly different color/intensity looks for them.</p>",
        "id": 1316821,
        "sender_full_name": "Steve Howell",
        "timestamp": 1643284830
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20mentions/near/1316709\">said</a>:</p>\n<blockquote>\n<p>So if somebody silent mention me I don't have notification (I don't have them in general). But would that mean that I don't have any counter in my Zulip anywhere? Would I still see that message inside <code>@Mentinos</code>?</p>\n</blockquote>\n<p>No, you would not see that message under @-mentions. If a user really cares about it though, they can setup an alert word for their name.</p>",
        "id": 1316833,
        "sender_full_name": "Yash RE",
        "timestamp": 1643286417
    },
    {
        "content": "<p>I have a bundle of comments about mentions after reviewing <a href=\"#narrow/stream/101-design/topic/UI.20redesign/near/1343706\">the current redesign draft</a>.</p>\n<ul>\n<li>I like the direction of using subtle colors for the backgrounds of the red blocks, and also for using a different color for group mentions vs. direct mentions of yourself. We should use the group mention color for wildcard mentions (which will likely become a special case of group mentions as we make groups a more first-class concept over the next several months).</li>\n<li>I think the proposed mention pills are taller than normal content, in a way that will mess up line-height. It would be easiest to see if one had a 4-line paragraph with a mention in the second line, but if you look closely here, the mention sticks well beyond the bottom of the avatar, but a normal line of text does not. I think this concern is why we have relatively small top/bottom padding around mention pills in the current Zulip design.</li>\n</ul>\n<p><a href=\"/user_uploads/2/2c/iie_CXyDgrhhsxxPn1ynRPr_/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/2c/iie_CXyDgrhhsxxPn1ynRPr_/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/2c/iie_CXyDgrhhsxxPn1ynRPr_/image.png\"></a></div><ul>\n<li>I'm worried about the text font color for mentions of users who are not yourself being different from the default font color of text within a message. It's harder to read/skim text of varying color, and I think it's faster for a reader if when reading content that isn't intended to jump out at you, all the text in a sentence is the same color.   (And mentions are often used in the middle of a sentence, like \"I'm curious what <code>@someone</code> thinks\".)</li>\n<li>We should include silent mentions of both user groups and individual users in our data set of example messages. I guess probably the easiest way to do this would be to have a few sample messages in the \"Mentions\" view also contain silent mentions of additional users. One good way to do that might be to have a message containing a quote-and-reply example.</li>\n</ul>",
        "id": 1346387,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647459850
    },
    {
        "content": "<blockquote>\n<p>if you look closely here, the mention sticks well beyond the bottom of the avatar, but a normal line of text does not.</p>\n</blockquote>\n<p>I think you’re just measuring from different references. The actual text baselines are aligned in the same way, so I don’t see any reason to think the line-height will be messed up.</p>",
        "id": 1346406,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1647460876
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>  for the detailed comments. Very helpful. Let me clarify point by point...</p>\n<blockquote>\n<p>We should use the group mention color for wildcard mentions</p>\n</blockquote>\n<p>What is \"wildcard mention\"?</p>\n<blockquote>\n<p>I think the proposed mention pills are taller than normal content, in a way that will mess up line-height. </p>\n</blockquote>\n<p>Yes, it is. It's a bit challenging to make it right in Figma and I lost consistency here. Line height was 19 but pills had 20px height and there was an extra 1px between the lines (but it should be 0).</p>\n<p>So here is the dilemma. I increased the line-height to 19px and the font to 15px. It is not a huge change, but lines have a bit more air than currently in Zulip.<br>\nBut on a wider screen than in my prototype, it's still tight, since the length of the line is bigger. I would increase it to 20px, but not sure how are you guys would feel about it.</p>\n<p>What do you think about these variations?<br>\n<a href=\"/user_uploads/2/8/RAcTx780a2B3OuFCF1HF0yiG/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/8/RAcTx780a2B3OuFCF1HF0yiG/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/8/RAcTx780a2B3OuFCF1HF0yiG/image.png\"></a></div><blockquote>\n<p>I'm worried about the text font color for mentions of users who are not yourself being different from the default font color of text within a message</p>\n</blockquote>\n<p>Aren't they special links and should be highlighted?</p>\n<p>We could go minimal style: <a href=\"/user_uploads/2/f7/WMbEl-9mqwh-Fk_VelMa15Nh/image.png\">image.png</a>  Is that what you feel right?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/f7/WMbEl-9mqwh-Fk_VelMa15Nh/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/f7/WMbEl-9mqwh-Fk_VelMa15Nh/image.png\"></a></div><blockquote>\n<p>We should include silent mentions</p>\n</blockquote>\n<p>Aside from the absence of <code>@</code> should they at all be different visually?</p>",
        "id": 1346696,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1647490771
    },
    {
        "content": "<p>Wildcard mentions are <code>@all</code> -- basically mentioning everyone subscribed to the stream.  Not super important since I think the rendering can look like group mentions and that'll work. They are rarely used except in small private streams or for major announcements, since it sends everyone receiving it a push notification (E.g. in CZO only moderators are allowed to use them).</p>",
        "id": 1346700,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647491055
    },
    {
        "content": "<p>As a baseline, what are the stats for the current UI?</p>",
        "id": 1347283,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647554354
    },
    {
        "content": "<p>One thing we've discussed in the context of increasing font size/line spacing is having that be a user setting. We could still potentially tweak things a little for the \"tight\" setting, while introducing another one with more space, but it might be a relevant consideration for this discussion.</p>",
        "id": 1347293,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647554458
    },
    {
        "content": "<blockquote>\n<p>We could go minimal style: image.png Is that what you feel right?</p>\n</blockquote>\n<p>That looks good to me; I think that's in line with what <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> was imagining as well. (Replying for <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span>  a bit just to help him focus on release management.)</p>",
        "id": 1347295,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647554593
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20mentions/near/1347293\">said</a>:</p>\n<blockquote>\n<p>One thing we've discussed in the context of increasing font size/line spacing is having that be a user setting. We could still potentially tweak things a little for the \"tight\" setting, while introducing another one with more space, but it might be a relevant consideration for this discussion.</p>\n</blockquote>\n<p>Yeah, we definitely get feedback from a minority of users that they really like Zulip's dense spacing, so I think we should stick with our plan of having two font sizes available. (Actually, some products even do a slider, but I'm not sure whether that's too technically complex).</p>",
        "id": 1347341,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647556692
    },
    {
        "content": "<blockquote>\n<p>What do you think about these variations?</p>\n</blockquote>\n<p>I agree that the lower two options look nicer. One thing I'd be worried about with removing the border is that it's already not super obvious that the @-mention is a click target (because the entire message is a click target), and this might make it even harder to guess.</p>\n<p>This concern might suggest that we should have borders on all mentions in general. Or perhaps there's some other way to clarify that pills can be clicked on?</p>",
        "id": 1347344,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647556913
    },
    {
        "content": "<p>We can always have a border/outline appear on hover to signal that, or have the color change like we do when you hover the name in a message.</p>",
        "id": 1347359,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647557452
    },
    {
        "content": "<p>Something like that seems helpful; I think it's very easy to miss this feature currently.</p>",
        "id": 1347362,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647557569
    },
    {
        "content": "<p>Yeah, and hover behavior is the default way to do this.</p>",
        "id": 1347363,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647557653
    },
    {
        "content": "<p>For reference, prior font size/line height discussion: <a href=\"#narrow/stream/101-design/topic/font.20size/near/1154224\">https://chat.zulip.org/#narrow/stream/101-design/topic/font.20size/near/1154224</a></p>",
        "id": 1348201,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647647502
    },
    {
        "content": "<p>I ran into a potential bug while working on PR <a href=\"https://github.com/zulip/zulip/issues/26003#issuecomment-1590273916\">#26003</a>:</p>\n<p>The wildcard mentions to notify everyone on a stream have bold formatting even when the user is not subscribed to the stream, which is not consistent with the formatting for user group and user mentions.</p>\n<ul>\n<li>\n<p>View from user who's a member of the \"support team\" and subscribed to the stream:<br>\n<a href=\"/user_uploads/2/3f/hpQ3D56esq7E9p8ZMLXhQW4P/mentions_group_bold.png\">mentions_group_bold.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/3f/hpQ3D56esq7E9p8ZMLXhQW4P/mentions_group_bold.png\" title=\"mentions_group_bold.png\"><img src=\"/user_uploads/2/3f/hpQ3D56esq7E9p8ZMLXhQW4P/mentions_group_bold.png\"></a></div></li>\n<li>\n<p>View from user who's not a member of the \"support team\" and not subscribed to the stream either:<br>\n<a href=\"/user_uploads/2/1c/ptHAqd_FYP9-LrOeqZjpRN6H/mentions-wildcard-bold.png\">mentions-wildcard-bold.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/1c/ptHAqd_FYP9-LrOeqZjpRN6H/mentions-wildcard-bold.png\" title=\"mentions-wildcard-bold.png\"><img src=\"/user_uploads/2/1c/ptHAqd_FYP9-LrOeqZjpRN6H/mentions-wildcard-bold.png\"></a></div></li>\n</ul>",
        "id": 1593428,
        "sender_full_name": "David Rosa",
        "timestamp": 1686785913
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"5140\">@Aman (amanagr)</span> do you understand the issue?</p>",
        "id": 1593550,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1686798612
    },
    {
        "content": "<p>Working on a fix.</p>",
        "id": 1593562,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1686805741
    },
    {
        "content": "<p>Opened <a href=\"https://github.com/zulip/zulip/pull/26032\">#26032</a></p>",
        "id": 1593567,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1686806376
    }
]