[
    {
        "content": "<p>I have a stupid question. <br>\nWhy do we need to close compose box at all?<br>\nWhat wouldn't be possible or would be terribly confusing if we don't close compose box ever?</p>\n<p><a href=\"/user_uploads/2/c8/87uxG-ELysAJGY93Y_l2AUFW/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/c8/87uxG-ELysAJGY93Y_l2AUFW/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/c8/87uxG-ELysAJGY93Y_l2AUFW/image.png\"></a></div>",
        "id": 1339754,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1646580308
    },
    {
        "content": "<p>As a laptop user I close the compose box to see more messages on the screen if I am reading a long topic.</p>",
        "id": 1339760,
        "sender_full_name": "Steve Howell",
        "timestamp": 1646581320
    },
    {
        "content": "<p>It is also useful for n key users not to accidentally type n into the compose box.</p>",
        "id": 1339761,
        "sender_full_name": "Steve Howell",
        "timestamp": 1646581403
    },
    {
        "content": "<blockquote>\n<p>I close the compose box to see more messages on the screen if I am reading a long topic</p>\n</blockquote>\n<p>We are talking here about 40px height vs 160px height. by closing compose box you are getting 120px of a vertical space. <br>\nI understand the value of that, but it feels like some friction to always expand and collapse it.<br>\nWhat if compose box would be open and not focused by default at all times, and there will be ability to collapse it on a view if you need it?</p>\n<blockquote>\n<p>useful for n key users not to accidentally type n into the compose box</p>\n</blockquote>\n<p>I think that could be managed with focused/not focused compose box.<br>\nZulip doesn't close compose box when I'm switching <strong>topics</strong> of a stream but there is nothing yet inside the compose box while compose box is focused.</p>",
        "id": 1339763,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1646582686
    },
    {
        "content": "<p>once you open the compose box, you expect the stream/topic or PM destination to only change if you manually change them. However, in an interleaved view, they would probably need to change as you scroll around (deftly switching between topics/targets).<br>\nSo, you could maybe leave it open when narrowed to a topic, but keep the current behavior otherwise. (which might be confusing in a different way)</p>",
        "id": 1339777,
        "sender_full_name": "Ken Clary",
        "timestamp": 1646592247
    },
    {
        "content": "<p>This is a complex topic, but a one part of it is that having the compose box open creates the expectations that typing keys goes into there, which makes it hard for keyboard shortcuts to work.</p>\n<p>There's a significant visual attention / distraction cost to having the compose box open; having it closable means we can have a taller/more fancy compose experience with more buttons without the UI feeling cluttered when reading.</p>",
        "id": 1340387,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1646701620
    },
    {
        "content": "<blockquote>\n<p>creates the expectations that typing keys goes into there,</p>\n</blockquote>\n<p>Not unless the field is clearly focused. Slack is a good example, there is no wrong expectation there...</p>\n<blockquote>\n<p>There's a significant visual attention / distraction cost to having the compose box open</p>\n</blockquote>\n<p>agree</p>",
        "id": 1340432,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1646707345
    },
    {
        "content": "<p>After reviewing <a href=\"#narrow/stream/101-design/topic/UI.20redesign/near/1343706\">the current redesign draft</a>, I have a few comments on the compose box design. Posting a small screenshot here for reference, since it's a relatively isolated detail:</p>\n<p><a href=\"/user_uploads/2/8f/mw8ErxJA_kj7V3373nWWu0uc/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/8f/mw8ErxJA_kj7V3373nWWu0uc/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/8f/mw8ErxJA_kj7V3373nWWu0uc/image.png\"></a></div>",
        "id": 1346409,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647461245
    },
    {
        "content": "<ul>\n<li>One of the biggest proposed changes is having the compose box width match the width of a rendered message. It is definitely annoying for the compose box to be wider than the display area, in that paragraphs that look like reasonable in your compose box can look way too high after sending; I definitely find myself adding paragraph breaks when editing messages for this reason. So I think this potentially does solve a problem.</li>\n<li>I worry that it will create a couple new user interaction problems: (1) It'll make long URLs that one might paste into the compose box, including our Markdown syntax for uploaded files, more unwieldy feeling. (2) It's possible that this will make it hard to work with code blocks of LaTeX syntax that one might be working on in the compose box. Possibly this second problem could be solved by extending the existing \"full-height compose box\" feature to support increased width as well, and there's potential solutions to the first problem (including some that would be a very large investment, like handling uploads via a WYSIWIG mechanism).</li>\n</ul>\n<p>One observation about the potential downsides of changing the width is that our \"message edit\" UI already has the same width as a message, so that may be a useful source of intuition for whether it'd in practice either of the worries mentioned in the second bullet are real issues.</p>",
        "id": 1346413,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647461697
    },
    {
        "content": "<p>Here's a couple ideas that would lean further into the direction of having this greater width.</p>\n<ul>\n<li>I think it's possible putting your avatar into the compose box to to the left of the textarea would make the design for this less-wide compose box look cleaner. Obviously, it's redundant information to show your avatar there, but I think the idea would be that it increases the illusion of your drafting a message that will soon appear in the message feed.</li>\n<li>We could also put \"NOW\" in the space to the right of the text box where a timestamp would be -- with some sort of UI indication that you can click this to change the send time as how we do \"Send later\". We'd need to play with whether there's enough space to clearly indicate the time a message would be sent when you've enabled \"Send later\", but this might be another opportunity to make the space we're spending here feel useful and thematic.</li>\n</ul>",
        "id": 1346415,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647461775
    },
    {
        "content": "<ul>\n<li>We'd need to have a mobile web design that's more different from the non-mobile web design, in that one wants all the width for the text box that one can get when composing a message on mobile. I think this is workable from an implementation complexity standpoint.</li>\n</ul>",
        "id": 1346419,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647461986
    },
    {
        "content": "<ul>\n<li>I find the upwards-pointing arrow for the \"Send\" button to feel unnatural, and would probably go with the normal rightwards one if we're doing that button style. Also, I think we should avoid decreasing the size of the click target for the \"Send\" button; this is the single most important thing in the compose box and we should make sure it feels easy to hit with a mouse. (I think this design preserves its size, but wasn't sure).</li>\n</ul>",
        "id": 1346424,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647462391
    },
    {
        "content": "<ul>\n<li>The \"Preview\" eye feels out of place to me. It's possible that other changes will make that no longer the case.</li>\n</ul>",
        "id": 1346425,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647462444
    },
    {
        "content": "<ul>\n<li>\n<p>I think the top row where you pick where to send the message has way too much emphasis on the stream/private message switching feature. We have tried designs with that approach before, and the problem is that it makes one feel like sending a message asks you too many questions -- first what type of message is it, then what stream, then what topic. Switching message type is an infrequent action, and we probably want it to be that way (by having users usually start composing a message the other way), and it also just feels distracting for it to have so much visual prominence. </p>\n<p>I do think it's logically correct for this to sit to the left, though. I think one possible solution would be to move it into the left column containing the preview icon (and your avatar below it), and rather than it being a dropdown just having it be a icon-sized toggle.</p>\n</li>\n</ul>",
        "id": 1346426,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647462631
    },
    {
        "content": "<ul>\n<li>One thing to keep in mind is that we currently use the bottom row space under the message to display <code>10005/10000</code> in red if the message is longer than our maximum message length (or close to it with a different color, I think). We can potentially move that indicator to be above the compose box if we want to use that space for something else, which is possible. E.g. I could imagine <code>preview|write</code> tabs being placed in that space as an alternative design for the preview toggle.</li>\n</ul>",
        "id": 1346428,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647462794
    },
    {
        "content": "<blockquote>\n<p>I worry that it will create a couple new user interaction problems: (1) It'll make long URLs... (2) ... make it hard to work with code blocks of LaTeX syntax</p>\n</blockquote>\n<p>Yes it is. But my example has pretty narrow content area. I think that usual case is when content area is much wider than optimal for the line-hight. And wider compose box that the message doesn't solve that problem because link length could take 3 lines. And if a person know how to write LaTeX syntax nothing could stop them <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span><br>\nSeriously, I don't see how 15-20% compose field shrink makes \"a problem\". <br>\nThe problem here is absence of WYSIWYG editor which people use in Gmail/Google Docs/Dropbox Paper. And the problem is that system level hot key Ctrl+K isn't making a link.</p>\n<blockquote>\n<p>full-height compose box\" feature to support increased width as well</p>\n</blockquote>\n<p>fair</p>\n<blockquote>\n<p>\"message edit\" UI already has the same width as a message</p>\n</blockquote>\n<p>I updated prototype yesterday. In case you didn't see it:<br>\n<a href=\"/user_uploads/2/83/kmlFFhz5FCfMlSEMFtYTST0G/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/83/kmlFFhz5FCfMlSEMFtYTST0G/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/83/kmlFFhz5FCfMlSEMFtYTST0G/image.png\"></a></div><blockquote>\n<p>I think it's possible putting your avatar into the compose box </p>\n</blockquote>\n<p>People are not new to messangers. I don't see any need in that.</p>\n<blockquote>\n<p>\"Send later\"</p>\n</blockquote>\n<p>All kinds of options about sending could be behind the drop down: <a href=\"/user_uploads/2/3d/_KXk-V6d3i4Jb0MZHiAT3Kq8/image.png\">image.png</a> <br>\nFree space serves a purpose to be a free space. I suggest to don't overload the UI with all kinds of additional elements which are rarely needed. Less is more.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/3d/_KXk-V6d3i4Jb0MZHiAT3Kq8/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/3d/_KXk-V6d3i4Jb0MZHiAT3Kq8/image.png\"></a></div><blockquote>\n<p>We'd need to have a mobile web design that's more different from the non-mobile web design</p>\n</blockquote>\n<p>I didn't think about that as a mobile view but as narrow desktop window. <br>\nIf that is a mobile view, we should shrink the functionality. I would avoid changing the desktop ui to \"mobile view\" just because I made a narrow window. There is a way to distinguish truly mobile view from the desktop. It should be done during the app/website opening.</p>\n<blockquote>\n<p>upwards-pointing arrow for the \"Send\" button to feel unnatural</p>\n</blockquote>\n<p>Unnatural is to send the message to the right, while it's appearing on top. In mobile app the button is pointing in the right direction.</p>\n<blockquote>\n<p>we should avoid decreasing the size of the click target for the \"Send\" button<br>\nCould you please give me a number of times per user per day we have a click on it on the desktop version?  Feels like nobody clicks on it...</p>\n</blockquote>\n<p>Anyway my button is bigger than the current one: <a href=\"/user_uploads/2/f3/mnJoSkvOncRtjH_OXWvwyiSc/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/f3/mnJoSkvOncRtjH_OXWvwyiSc/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/f3/mnJoSkvOncRtjH_OXWvwyiSc/image.png\"></a></div><blockquote>\n<p>The \"Preview\" eye feels out of place to me.</p>\n</blockquote>\n<p>I'm ok to move it inside the compose box, but having it outside encourages to preview. Also it is an action outside formatting, the same way as Send button.</p>\n<blockquote>\n<p>I think the top row where you pick where to send the message has way too much emphasis on the stream/private message switching feature. We have tried designs with that approach before, and the problem is that it makes one feel like sending a message asks you too many questions</p>\n</blockquote>\n<p>I'm sorry, but the current Zulip solution isn't working better. Even <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> told me that she wish to have a switcher between PM and a Stream.</p>\n<blockquote>\n<p>Switching message type is an infrequent action</p>\n</blockquote>\n<p>Right, because there is no way to switch and there is no tracking of such event.<br>\nI bet switching message type would be a frequent action once its the only way to switch <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span><br>\nDo we know how many clicks per person per day per platform is happening on the current compose buttons? </p>\n<blockquote>\n<p>I do think it's logically correct for this to sit to the left, though. </p>\n</blockquote>\n<p>If a person reading/thinking from left to right this is logically correct:<br>\nI'm deciding <strong>where</strong> to publish first (PM/Stream) and <strong>what</strong> would be after (compose), <strong>how</strong> would be the third (formatting), <strong>when</strong> would be fourth, rare option <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>\n<blockquote>\n<p>I think one possible solution would be to move it into the left column containing the preview icon (and your avatar below it)</p>\n</blockquote>\n<p>I tried different options, they don't look good or work with other limitations/requirements. <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> saw some of those. The problem that there is no icon for all streams (we have 3 kids) and also a stream icon changes the color.</p>\n<p>Anything more innovative than a dropdown would be heavier / more confusing / takes an extra line of the vertical space. <br>\nAlso possible localizations of the <code>Stream</code> and <code>PM</code> something tight to the space in english might not work in another language.</p>\n<blockquote>\n<p>One thing to keep in mind is that we currently use the bottom row space under the message to display 10005/10000 </p>\n</blockquote>\n<p>How about next to the Send button, which we could disable in this case:<br>\n<a href=\"/user_uploads/2/eb/qHmtN9vzPy3LtqLnNpzOKKwy/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/eb/qHmtN9vzPy3LtqLnNpzOKKwy/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/eb/qHmtN9vzPy3LtqLnNpzOKKwy/image.png\"></a></div><blockquote>\n<p>could imagine preview|write tabs being placed in that space as an alternative design for the preview toggle</p>\n</blockquote>\n<p>I thought about it, but having preview button close to the formatting and close to the text I write is more convenient.</p>",
        "id": 1346733,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1647497193
    },
    {
        "content": "<p>Just to clarify some of the discussion above, I think <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> agreed that (1) we should have a PM/stream switcher in the compose box, and (2) the left-to-right order proposed in the design makes sense. There is no argument that we should stick with the current UI. :)</p>",
        "id": 1347261,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647552964
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> 's push on this front was to somehow de-emphasize stream  vs. PM as a choice you need to actively think about every time you're composing, which seems like a reasonable design goal to play with to me.</p>\n<p>One question is whether by moving the option into the left gutter (perhaps styled as a button?), we could use the <code>#</code> without it clashing too much with the symbol on the stream name? It would still be nearby but not attached to the stream selector.</p>",
        "id": 1347263,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647553434
    },
    {
        "content": "<p>Here are variations and my thoughts about the compose box with Stream/PM switcher.  Please let me know if anything feels better for you.<br>\nI do think that having the switcher inside the compose box is very important. This is separate from the single compose buttons (redesign suggestion) or multiple as now.<br>\n<a href=\"/user_uploads/2/7a/djXcV7R9aLuAmHLjPcnOzsPU/compose-variations.png\">compose-variations.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/7a/djXcV7R9aLuAmHLjPcnOzsPU/compose-variations.png\" title=\"compose-variations.png\"><img src=\"/user_uploads/2/7a/djXcV7R9aLuAmHLjPcnOzsPU/compose-variations.png\"></a></div>",
        "id": 1350521,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1648009566
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span></p>",
        "id": 1350522,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1648009583
    },
    {
        "content": "<p>I agree the switcher should be in the compose box, though I think depending on other design decisions it may be a rarely used thing or a thing that we expect folks to need to toggle often.</p>\n<p>I like the third option best visually, though I'm not sure about the <code>#</code> as the icon, as that may clash with decorating the stream name with a #/lock/globe. I think we could consider making the icon be in that slot but be an icon for \"switch\", rather than an icon for the stream / private message types?</p>",
        "id": 1350549,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1648013255
    },
    {
        "content": "<p>I like option 3 as well.  I think any of these are probably at least a marginal improvement worth testing out on czo.</p>",
        "id": 1350801,
        "sender_full_name": "Steve Howell",
        "timestamp": 1648053292
    },
    {
        "content": "<p>How about this approach? <a href=\"/user_uploads/2/f6/kJ77KZzu0dgOVfJsrJSsOTGB/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/f6/kJ77KZzu0dgOVfJsrJSsOTGB/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/f6/kJ77KZzu0dgOVfJsrJSsOTGB/image.png\"></a></div>",
        "id": 1351388,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1648084658
    },
    {
        "content": "<p><a href=\"/user_uploads/2/a8/KzY05oM2QC3Oj-sAU7i1jWPp/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/a8/KzY05oM2QC3Oj-sAU7i1jWPp/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/a8/KzY05oM2QC3Oj-sAU7i1jWPp/image.png\"></a></div>",
        "id": 1351400,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1648085536
    },
    {
        "content": "<p>that looks pretty slick</p>",
        "id": 1351413,
        "sender_full_name": "Ken Clary",
        "timestamp": 1648087668
    },
    {
        "content": "<p>I wonder if that icon should match the top left icon for PMs (or rather, should the top left icon be changed to match that)</p>",
        "id": 1351414,
        "sender_full_name": "Ken Clary",
        "timestamp": 1648087711
    },
    {
        "content": "<p>it does match in the new design</p>",
        "id": 1351420,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1648089003
    },
    {
        "content": "<p><a href=\"/user_uploads/2/ce/kDw3C03IaQQeo0z2aUPzIleL/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/ce/kDw3C03IaQQeo0z2aUPzIleL/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/ce/kDw3C03IaQQeo0z2aUPzIleL/image.png\"></a></div>",
        "id": 1351424,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1648089380
    },
    {
        "content": "<p>That looks pretty good to me, though my opinion may change when trying it interactively.</p>",
        "id": 1351525,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1648103696
    },
    {
        "content": "<p>That could work!</p>\n<p>I think another idea <span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> and I discussed is having the icon in the option in 3 change depending on stream type. So by default it would be a hash, but if you select it an enter the name of a private or world-public stream, it would change to the appropriate icon.</p>",
        "id": 1352553,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1648181794
    },
    {
        "content": "<p>I'm not sure if the <code>&gt;</code> in the PM compose box would be confusing, since the rest of the design uses <code>&gt;</code> to indicate topics. (Vlad noted that it's there because it is replaced by an arrow when the user is not in the narrow they are composing to.)</p>\n<p>I suppose alternative solutions are:</p>\n<ol>\n<li>Put the navigation arrow on the right of the PM addressees.</li>\n<li>Keep the space on the left empty unless the arrow is needed?</li>\n<li>Put the arrow inside the addressee box both for stream/topic and PM compose.</li>\n</ol>",
        "id": 1352560,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1648182097
    },
    {
        "content": "<p>great idea !</p>",
        "id": 1352672,
        "sender_full_name": "Andrea Soc",
        "timestamp": 1648195353
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box/near/1352560\">said</a>:</p>\n<blockquote>\n<p>I'm not sure if the <code>&gt;</code> in the PM compose box would be confusing, since the rest of the design uses <code>&gt;</code> to indicate topics. (Vlad noted that it's there because it is replaced by an arrow when the user is not in the narrow they are composing to.)</p>\n<p>I suppose alternative solutions are:</p>\n<ol>\n<li>Put the navigation arrow on the right of the PM addressees.</li>\n<li>Keep the space on the left empty unless the arrow is needed?</li>\n<li>Put the arrow inside the addressee box both for stream/topic and PM compose.</li>\n</ol>\n</blockquote>\n<p>Umm, do we even need a <code>&gt;</code> icon when we are in a mode of sending PM ?</p>",
        "id": 1354207,
        "sender_full_name": "Jai soni",
        "timestamp": 1648496110
    },
    {
        "content": "<p><a href=\"/user_uploads/2/14/fMWxDzr6_B7vPzGdX4GgQxlk/image.png\">image.png</a> <br>\nLike, what if i remove the <code>&gt;</code> icon here in the 2nd image -- I don't feel the necessity of it being present here. (this is subjective and i maybe wrong)</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/14/fMWxDzr6_B7vPzGdX4GgQxlk/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/14/fMWxDzr6_B7vPzGdX4GgQxlk/image.png\"></a></div>",
        "id": 1354211,
        "sender_full_name": "Jai soni",
        "timestamp": 1648496270
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"22961\">Jai soni</span> we don't necessarily need the <code>&gt;</code>, but the point is that we need a place to put the arrow for navigating to the narrow you're composing to (when you are not already there). See <a href=\"https://github.com/zulip/zulip/pull/19590\">#19590</a>.</p>",
        "id": 1354347,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1648501888
    },
    {
        "content": "<p>I’ll suggest an alternative</p>",
        "id": 1354755,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1648535250
    },
    {
        "content": "<p>Sorry for the sound, but here is the update on a video <a href=\"https://www.loom.com/share/d640e6d1915d45e4bfda8efe37dcbd1f\">https://www.loom.com/share/d640e6d1915d45e4bfda8efe37dcbd1f</a></p>",
        "id": 1355773,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1648610311
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span></p>",
        "id": 1355774,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1648610319
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 1356679,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1648687576
    },
    {
        "content": "<p>Hey folks, I'm glad <span class=\"user-mention\" data-user-id=\"21453\">@Evy Kassirer</span>  is helping us to test the switch inside the compose box between PM and Stream ( <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/Convert.20replies.20between.20stream.20and.20private.20messages\">#design &gt; Convert replies between stream and private messages</a> ). <br>\n<a href=\"/user_uploads/2/6d/sXKmVMFbA4DaXjyAC_bhb3LO/image.png\">Earlier proposal of stream-oriented compose box</a> , <a href=\"/user_uploads/2/61/kh8X1u7ysW8BJ8TLWe98VUUF/image.png\">Earlier proposal of pm-oriented compose box</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/6d/sXKmVMFbA4DaXjyAC_bhb3LO/image.png\" title=\"Earlier proposal of stream-oriented compose box\"><img src=\"/user_uploads/2/6d/sXKmVMFbA4DaXjyAC_bhb3LO/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/61/kh8X1u7ysW8BJ8TLWe98VUUF/image.png\" title=\"Earlier proposal of pm-oriented compose box\"><img src=\"/user_uploads/2/61/kh8X1u7ysW8BJ8TLWe98VUUF/image.png\"></a></div><p><strong>During explanation of the initial design I felt friction from multiple people on multiple stages. So I got another idea.</strong><br>\nThe earlier solution was not obvious for new users and for old users it was also a bit confusing. Confusion is always against the conversion.<br>\nMy new proposal is to have more traditional switch:<br>\n<a href=\"/user_uploads/2/a3/wJGysdB7nxGKrtUXJ7FLGv_B/image.png\">Stream</a>, <a href=\"/user_uploads/2/f5/P6IYUqe12rpO71_y9fi6zceH/image.png\">PM</a> <br>\nIt has additional improvements:</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/a3/wJGysdB7nxGKrtUXJ7FLGv_B/image.png\" title=\"Stream\"><img src=\"/user_uploads/2/a3/wJGysdB7nxGKrtUXJ7FLGv_B/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/f5/P6IYUqe12rpO71_y9fi6zceH/image.png\" title=\"PM\"><img src=\"/user_uploads/2/f5/P6IYUqe12rpO71_y9fi6zceH/image.png\"></a></div><ul>\n<li><code>new topic</code> is a like <code>x</code> clear button but visually works as the third switch in a straightforward way (clears the topic input)</li>\n<li><code>To:</code> is actually \"go to\" button, it could be conditionally <a href=\"/user_uploads/2/fb/Y49mz-vrCZ24X6AHEyRHK1jp/image.png\">highlighted if we want </a> <div class=\"message_inline_image\"><a href=\"/user_uploads/2/fb/Y49mz-vrCZ24X6AHEyRHK1jp/image.png\" title=\"highlighted if we want \"><img src=\"/user_uploads/2/fb/Y49mz-vrCZ24X6AHEyRHK1jp/image.png\"></a></div></li>\n<li><code>eye</code> preview button is inside the box, which is as it's right now</li>\n<li>the compose field is a bit larger than in the previous proposal, since for text input we might need more space, but for preview having a little padding on the right side wouldn't be noticeable (in order to have the exact preview as it will be among the messages)</li>\n</ul>\n<p>Let me know what do you think about this proposal.</p>",
        "id": 1379216,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1651888463
    },
    {
        "content": "<p>This feels much more user-friendly.</p>",
        "id": 1379227,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1651897951
    },
    {
        "content": "<p>I like this :) Can you clarify what it would look like for private messages with many recipients (such that the recipient box is taller)?</p>",
        "id": 1379532,
        "sender_full_name": "Evy",
        "timestamp": 1652121512
    },
    {
        "content": "<blockquote>\n<p><code>To:</code> is actually \"go to\" button, it could be conditionally highlighted if we want </p>\n</blockquote>\n<p>Even with highlighting, it's maybe not clear it's a button/link. probably something subtle in the visual. but it's a great idea.</p>",
        "id": 1379536,
        "sender_full_name": "Ken Clary",
        "timestamp": 1652121806
    },
    {
        "content": "<p>I agree that it doesn't look super button-like. I think I would expect buttons to have a border and be a bit more rounded. I feel like there might be something more intuitive than the \"To\" being a button, but I'm not sure what. I think the earlier proposal of an icon with tooltip is clearer than <code>To:</code> being a button.</p>",
        "id": 1379776,
        "sender_full_name": "Evy",
        "timestamp": 1652208958
    },
    {
        "content": "<p>It’s unfortunate how the “To:” ends up between the stream and the topic. Maybe we could just add a “narrow” button with similar styling and placement to the “new topic” button? And then we could conditionally hide it if you’re already narrowed to that conversation.</p>",
        "id": 1379778,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1652209484
    },
    {
        "content": "<p>Hey, I see that you are discussing <code>To:</code> button, while I was pointing attention to the switch. I guess it is a good sign and you think that switch might work.<br>\nI <a href=\"https://www.loom.com/share/866a2fd4392441f895d1e827a75caa0a\">recorded a 5 min explanation video</a> about the <a href=\"https://www.figma.com/proto/jbNOiBWvbtLuHaiTj4CW0G/Zulip-Web-App?page-id=576%3A52038&amp;node-id=2075%3A135866&amp;viewport=-1094%2C-474%2C0.17&amp;scaling=min-zoom&amp;starting-point-node-id=1092%3A65660\">UI prototype I prepared</a> </p>\n<p><a href=\"/user_uploads/2/22/-EAGvY3uoiNFwAGvbc8XzZW-/compose-00-01.png\">compose-00-01.png</a> <a href=\"/user_uploads/2/14/Bu16jq7Glz5BiZ24T7_lB6nX/compose-00-02.png\">compose-00-02.png</a> <a href=\"/user_uploads/2/17/-pBn-zVQ-wWzYDeqHfNHKx-z/compose-01-01.png\">compose-01-01.png</a> <a href=\"/user_uploads/2/6a/KKFNUiFl579iG12hlvRKBZFe/compose-01-02.png\">compose-01-02.png</a> <a href=\"/user_uploads/2/22/UEb54dozk0xe30HBSHSjFfgX/compose-01-03.png\">compose-01-03.png</a> <a href=\"/user_uploads/2/3a/yTt5gn9GgN8Mvp0kNoO3YPma/compose-02-01-pm.png\">compose-02-01-pm.png</a> <a href=\"/user_uploads/2/c9/MvERsI0ZqL4qtsnY4ODyBqb1/compose-02-02-pm.png\">compose-02-02-pm.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/22/-EAGvY3uoiNFwAGvbc8XzZW-/compose-00-01.png\" title=\"compose-00-01.png\"><img src=\"/user_uploads/2/22/-EAGvY3uoiNFwAGvbc8XzZW-/compose-00-01.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/14/Bu16jq7Glz5BiZ24T7_lB6nX/compose-00-02.png\" title=\"compose-00-02.png\"><img src=\"/user_uploads/2/14/Bu16jq7Glz5BiZ24T7_lB6nX/compose-00-02.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/17/-pBn-zVQ-wWzYDeqHfNHKx-z/compose-01-01.png\" title=\"compose-01-01.png\"><img src=\"/user_uploads/2/17/-pBn-zVQ-wWzYDeqHfNHKx-z/compose-01-01.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/6a/KKFNUiFl579iG12hlvRKBZFe/compose-01-02.png\" title=\"compose-01-02.png\"><img src=\"/user_uploads/2/6a/KKFNUiFl579iG12hlvRKBZFe/compose-01-02.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/22/UEb54dozk0xe30HBSHSjFfgX/compose-01-03.png\" title=\"compose-01-03.png\"><img src=\"/user_uploads/2/22/UEb54dozk0xe30HBSHSjFfgX/compose-01-03.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/3a/yTt5gn9GgN8Mvp0kNoO3YPma/compose-02-01-pm.png\" title=\"compose-02-01-pm.png\"><img src=\"/user_uploads/2/3a/yTt5gn9GgN8Mvp0kNoO3YPma/compose-02-01-pm.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/c9/MvERsI0ZqL4qtsnY4ODyBqb1/compose-02-02-pm.png\" title=\"compose-02-02-pm.png\"><img src=\"/user_uploads/2/c9/MvERsI0ZqL4qtsnY4ODyBqb1/compose-02-02-pm.png\"></a></div>",
        "id": 1381028,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1652669415
    },
    {
        "content": "<p>I love this video thanks for sharing!</p>",
        "id": 1381045,
        "sender_full_name": "Evy",
        "timestamp": 1652680825
    },
    {
        "content": "<p>I like that the to button looks pretty dramatically different when it is helpful versus when it won't do anything. That button is going to be so helpful</p>",
        "id": 1381046,
        "sender_full_name": "Evy",
        "timestamp": 1652680874
    },
    {
        "content": "<p>Two follow-up questions:</p>\n<ul>\n<li>How do we choose which topic the replies are being sent to if it's an inter-weaved narrow like the one in your video?</li>\n<li>What does it look like if there are five PM recipients making that box bigger? Where does the to button go, where is the switch aligned, and what does it look like to switch between PM and stream?</li>\n</ul>",
        "id": 1381047,
        "sender_full_name": "Evy",
        "timestamp": 1652680958
    },
    {
        "content": "<p>Good questions. Will respond later!</p>",
        "id": 1381062,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1652709560
    },
    {
        "content": "<blockquote>\n<p>How do we choose which topic the replies are being sent to if it's an inter-weaved narrow like the one in your video?</p>\n</blockquote>\n<p>Is there anything specific to this compose box proposal that would affect this? Otherwise, I would assume that this would work the same as today, or else is a separate question more related to discussions about the blue box.</p>",
        "id": 1381154,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1652730097
    },
    {
        "content": "<p>the latest screenshots show a different bottom bar (or rather, lack of bottom bar), which isn't quite the same topic but may be a source of confusion</p>",
        "id": 1381155,
        "sender_full_name": "Ken Clary",
        "timestamp": 1652730206
    },
    {
        "content": "<p>(but it contains what looks like a menu that references the selected message)</p>",
        "id": 1381157,
        "sender_full_name": "Ken Clary",
        "timestamp": 1652730255
    },
    {
        "content": "<p>Right, with this proposal you wouldn't see where you're replying to until the compose box is open, but I think it would still be based on the selected message.</p>",
        "id": 1381158,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1652730371
    },
    {
        "content": "<p>yes, I think that is right. I just think this topic jumped threads slightly (so maybe it should be about the blue box / line, or about the bottom bar, etc.)</p>",
        "id": 1381161,
        "sender_full_name": "Ken Clary",
        "timestamp": 1652730683
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"699\">Anders Kaseorg</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box/near/1379778\">said</a>:</p>\n<blockquote>\n<p>It’s unfortunate how the “To:” ends up between the stream and the topic. Maybe we could just add a “narrow” button with similar styling and placement to the “new topic” button? And then we could conditionally hide it if you’re already narrowed to that conversation.</p>\n</blockquote>\n<p>Yeah, that bothers me as well... </p>\n<p>As an alternative, I wonder what if the text/button on the left side of the topic box said \"Topic:\" instead of \"To:\"? And then the \"New topic\" button could just be labeled \"New\".</p>",
        "id": 1381162,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1652730771
    },
    {
        "content": "<p>In general, the PM compose box feels pretty clear to me, but the stream one seems harder to interpret quickly.</p>",
        "id": 1381166,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1652730893
    },
    {
        "content": "<p>(Btw, thanks for continuing to ponder/iterate on the design, <span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> !)</p>",
        "id": 1381167,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1652730921
    },
    {
        "content": "<blockquote>\n<p>What does it look like if there are five PM recipients making that box bigger? Where does the to button go, where is the switch aligned,</p>\n</blockquote>\n<p><a href=\"/user_uploads/2/a/apxp9B59Awt0VJZdLzKMj8im/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/a/apxp9B59Awt0VJZdLzKMj8im/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/a/apxp9B59Awt0VJZdLzKMj8im/image.png\"></a></div><blockquote>\n<p>what does it look like to switch between PM and stream?</p>\n</blockquote>\n<p>Same as it in a regular case. Yes jumping isn't great. But it could be smoothed with animation. I think it is not even 20% of cases across all PMs to have more than 3 people in PM. <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> can we have any stats on that?</p>",
        "id": 1381427,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1652756673
    },
    {
        "content": "<blockquote>\n<p>How do we choose which topic the replies are being sent to if it's an inter-weaved narrow like the one in your video?</p>\n</blockquote>\n<p>How is Zulip understands to what are you replying to?<br>\nEither you click on a message, or you go to the message context menu and click reply. Something always is selected with a blue box, or something is in the view point of your eye (if there is no blue box at all). So I guess in 90% of cases prediction could be accurate.</p>",
        "id": 1381428,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1652756859
    },
    {
        "content": "<blockquote>\n<p>As an alternative, I wonder what if the text/button on the left side of the topic box said \"Topic:\" instead of \"To:\"? And then the \"New topic\" button could just be labeled \"New\".</p>\n</blockquote>\n<p>I think it's good suggestion:<br>\n<a href=\"/user_uploads/2/54/Fm6RLqg57JDntdNl7zvD2g51/image.png\">image.png</a> <br>\n<a href=\"/user_uploads/2/45/bjzTke1FVZJYy3X8aRWe4ZfO/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/54/Fm6RLqg57JDntdNl7zvD2g51/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/54/Fm6RLqg57JDntdNl7zvD2g51/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/45/bjzTke1FVZJYy3X8aRWe4ZfO/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/45/bjzTke1FVZJYy3X8aRWe4ZfO/image.png\"></a></div>",
        "id": 1381429,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1652757094
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> Can you confirm if this design looks good to you? I'm down to implement it, but I'd rather do design iteration before engineering effort instead of after, if there are thoughts either of you have now.</p>",
        "id": 1385356,
        "sender_full_name": "Evy",
        "timestamp": 1653616302
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"21453\">@Evy Kassirer</span> wait a bit please, I need to present updated version. And ask Tim and Alya about it. After I would need some time to prepare an issue for it.</p>",
        "id": 1385364,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1653618355
    },
    {
        "content": "<p>Ok great :) I can work on other things. Thanks for letting me know!</p>",
        "id": 1385371,
        "sender_full_name": "Evy",
        "timestamp": 1653621429
    },
    {
        "content": "<p><strong>Updated compose box redesign proposal</strong><br>\nI prepared the <a href=\"https://www.figma.com/proto/jbNOiBWvbtLuHaiTj4CW0G/Zulip-Web-App?page-id=576%3A52038&amp;node-id=2075%3A135866&amp;viewport=-3757%2C-1709%2C0.46&amp;scaling=min-zoom&amp;starting-point-node-id=1092%3A65660\">updated prototype</a> and recorded <a href=\"https://www.loom.com/share/84919223f2a04b3291a3721fd1591127\">a video about it</a><br>\nScreens from it:<br>\n<a href=\"/user_uploads/2/cc/TLavEL4ICXDC2vxPfm3K7kGk/compose-00-01.png\">compose-00-01.png</a><br>\n<a href=\"/user_uploads/2/a5/-WTYa4CwLhYPBv4npyGLvH49/compose-00-02.png\">compose-00-02.png</a><br>\n<a href=\"/user_uploads/2/12/uoKuauzfB1jFnSjQhaNkyVnX/compose-01-01.png\">compose-01-01.png</a><br>\n<a href=\"/user_uploads/2/6/0AgzIg5R2w9oq4GIT5RbIcMh/compose-01-02.png\">compose-01-02.png</a><br>\n<a href=\"/user_uploads/2/f/2EEdIvoE2qoUTVgWOT_uz4vn/compose-01-03.png\">compose-01-03.png</a><br>\n<a href=\"/user_uploads/2/a0/2oJ_-EaRP2j_Q7v--HF6UuzR/compose-01-04.png\">compose-01-04.png</a><br>\n<a href=\"/user_uploads/2/b8/9uS3QSsA6aAvCXs60qlh7TQB/compose-02-01-pm.png\">compose-02-01-pm.png</a><br>\n<a href=\"/user_uploads/2/15/SsmppIdEmctdkjKHLvYs8hzC/compose-02-02-pm.png\">compose-02-02-pm.png</a><br>\n<a href=\"/user_uploads/2/ee/qbx1byl9BXbJ3X2AWg81bpKW/03-01-compose-edit.png\">03-01-compose-edit.png</a><br>\n<a href=\"/user_uploads/2/1c/6c1W2CXyHhdpGauxzAfDZXn3/03-02-compose-edit.png\">03-02-compose-edit.png</a><br>\n<a href=\"/user_uploads/2/1c/Rm7FNf7xGs5Vtb3GnehlfYzV/03-03-compose-edit.png\">03-03-compose-edit.png</a></p>\n<p>Please <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> and <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> review and let me know if I should correct or cover before moving to issue creation.</p>\n<p><strong>Update</strong><br>\nCorrected the name of the Reply button in compose options, so it reflects where the reply will be composed</p>\n<p>P.S. The thing outside of that redesign is all kinds of warnings inside the compose box. I'll work on them next</p>",
        "id": 1385988,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1653752711
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> please review</p>",
        "id": 1406638,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1658198168
    },
    {
        "content": "<p>Also check out the dark mode compose box:<br>\n<a href=\"/user_uploads/2/2/tH4exqVVcRRV80qwx0Of4KEV/dark-compose.png\">dark-compose.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/2/tH4exqVVcRRV80qwx0Of4KEV/dark-compose.png\" title=\"dark-compose.png\"><img src=\"/user_uploads/2/2/tH4exqVVcRRV80qwx0Of4KEV/dark-compose.png\"></a></div>",
        "id": 1406639,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1658198194
    },
    {
        "content": "<p>I'm not feeling great about the direction of having such a large STREAM|PM input element. There's a few concerns on my mind:</p>\n<ul>\n<li>We currently have a visual pattern with the recipient bars in the message feed that you can just look at the left end of the recipient bar to read where a message was sent to, and having some extra text to the left breaks that pattern.</li>\n<li>It's already visually obvious whether you're writing a PM or a stream message because of the 2-input vs. 1-input shape; I'd expect someone who's been using Zulip for more than a week to never find it useful to read the PM|STREAM labels.</li>\n<li>The compose box design is otherwise very clean feeling, with essentially no text that stands out as something you're supposed to read other than the details of the message itself (recipient, content).</li>\n</ul>",
        "id": 1407107,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1658266527
    },
    {
        "content": "<p>This is really tricky, because from a hierarchy standpoint, a STREAM/PM switcher should be to the left of the stream input.</p>",
        "id": 1407110,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1658266569
    },
    {
        "content": "<p>I can think of a couple options that would address this issue:</p>\n<ul>\n<li>Have the PM/stream switch element be hidden behind a 3-dot menu sort of thing in the corner. I think we probably don't want that, since an extra click is probably pretty significant in terms of the utility of this sort of widget.</li>\n<li>Having it be represented by a single icon, with something indicating \"switch\", like <a href=\"https://fontawesome.com/v4/icon/random\">https://fontawesome.com/v4/icon/random</a>, and have the explanation of what it does be in tooltip (say, \"Switch to private message\" or \"Switch to stream message\").</li>\n</ul>",
        "id": 1407115,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1658266729
    },
    {
        "content": "<p>A few other smaller notes:</p>\n<ul>\n<li>The space to the right of the send button kinda bugs me; what would it look like if we made the send button a bit wider so that it extended to the edge? <a href=\"/user_uploads/2/e4/1Ge1wwWOVDLQg4nuC8mEYiDA/image.png\">image.png</a> <div class=\"message_inline_image\"><a href=\"/user_uploads/2/e4/1Ge1wwWOVDLQg4nuC8mEYiDA/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/e4/1Ge1wwWOVDLQg4nuC8mEYiDA/image.png\"></a></div></li>\n<li>Somehow the pipes/separators between the groups of icons feel like they're an icon for a compose option that happens to be a pipe. Maybe the separator icons should be in a slightly lighter font?</li>\n</ul>",
        "id": 1407117,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1658266841
    },
    {
        "content": "<p>I like the edit UI's look and feel overall! A few notes on that:</p>\n<ul>\n<li>I like the save button, and would be very happy to replace the old style buttons with it. The cancel button feels a bit off / hard to read -- maybe the issue is the border being much darker than the label?</li>\n<li>I think we might want to keep the two \"Send notification\" options on their own lines -- I seem to recall we went with that structure because it was really hard to avoid it looking bad with i18n for languages like German where text tends to be wider.</li>\n</ul>",
        "id": 1407120,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1658267016
    },
    {
        "content": "<p>I think my final concern is I'm very reluctant to rework our closed-compose UI to be a small click target in the corner. We can test if necessary, since it's possible I'm wrong on this, but I feel pretty worried that it will result in intense criticism that sending a message in Zulip is too hard / too many steps / not chatty enough. All of our competitors go with an always-open feeling compose box, and having to move your mouse to a relatively small click target in the lower-right corner of the message feed in order to start typing a message seems like it might be asking too much.</p>\n<p>To be clear, I like the button design for it -- I think it's visually a much nicer way to provide the current compose options ... but I just worry that it could be a very large source of friction to move in that direction.</p>",
        "id": 1407123,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1658267321
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box/near/1407120\">said</a>:</p>\n<blockquote>\n<ul>\n<li>I think we might want to keep the two \"Send notification\" options on their own lines -- I seem to recall we went with that structure because it was really hard to avoid it looking bad with i18n for languages like German where text tends to be wider.</li>\n</ul>\n</blockquote>\n<p>It looks like the problem was that we had the dropdown for which messages to move on the same line as the new stream/topic (fixed in <a href=\"https://github.com/zulip/zulip/pull/19760\">#19760</a>).</p>",
        "id": 1407167,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1658268609
    },
    {
        "content": "<p>A couple of smaller questions:</p>\n<ol>\n<li>\n<p>Are we keeping the feature to drag the bottom right corner of the compose box to make it taller? I guess the area you drag would still be in the bottom right of the message text input area?</p>\n</li>\n<li>\n<p>Could you add a design proposal for the case where the user can edit the topic but not the stream for a message? At present we just show the topic field and not the stream name in that case, like so:</p>\n</li>\n</ol>\n<p><a href=\"/user_uploads/2/12/1WN5DJkP953NEXIu-YHWQ7Dk/Screen-Shot-2022-07-19-at-3.13.48-PM.png\">Screen-Shot-2022-07-19-at-3.13.48-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/12/1WN5DJkP953NEXIu-YHWQ7Dk/Screen-Shot-2022-07-19-at-3.13.48-PM.png\" title=\"Screen-Shot-2022-07-19-at-3.13.48-PM.png\"><img src=\"/user_uploads/2/12/1WN5DJkP953NEXIu-YHWQ7Dk/Screen-Shot-2022-07-19-at-3.13.48-PM.png\"></a></div>",
        "id": 1407180,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1658268858
    },
    {
        "content": "<p>Good points, let me think about them and get back with some reasoning/new suggestions</p>",
        "id": 1407249,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1658275782
    },
    {
        "content": "<blockquote>\n<p>We currently have a visual pattern with the recipient bars in the message feed that you can just look at the left end of the recipient bar to read where a message was sent to, and having some extra text to the left breaks that pattern.</p>\n</blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> and I did a bit of brainstorming today on how we might address this comment, and here's a rough proposal we could chat about:</p>\n<ol>\n<li>As <span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> proposed in our chat earlier this week, the way to switch from composing to a stream to composing a PM could be a \"Private message\" option inside the stream dropdown (shown above all other options). So no dedicated button would be required.</li>\n<li>In that case, what happens when you're inside a PM compose view? If we continue to show \"Private message\" inside a dropdown, we still have a situation where there's extra text to the left of the addressee(s).</li>\n</ol>\n<p>I don't know if it would feel good, but an idea we came up with is to replace the \"Private message\" text in the dropdown with a simple \"To:\". You could still click on the dropdown to switch to a stream name as your compose target. The field could be narrower in the PM compose situation and wider when composing to a stream.</p>\n<ol start=\"3\">\n<li>\n<p>If we do something like (2), we wouldn't need a \"To:\" inside the addressee text box. For consistency, this might also cause us to remove \"Topic:\" from the topic name box.</p>\n</li>\n<li>\n<p>The result of all that is that we'd need to re-add some kind of dedicated \"go to conversation\" button.</p>\n</li>\n</ol>\n<p>Anyway, there's a lot of cascading consequences, but maybe worth discussing. A much more minimal change would be to just go with the \"Private message\" in the stream dropdown idea, without all the rest. :)</p>",
        "id": 1408453,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1658442756
    },
    {
        "content": "<h1>Compose box design proposal update</h1>\n<p>After having a discussion about the compose box with <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> and <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> I have a proposal. Depending on the feedback after that I would like to move forward towards creating a realistic js/css version on a <a href=\"http://replit.com\">replit.com</a> so we could feel that closer to reality and iterate faster on some design tunes.</p>\n<p>To see all the screens in 100% scale go to Figma <a href=\"https://www.figma.com/proto/jbNOiBWvbtLuHaiTj4CW0G/Zulip-Web-App?page-id=576%3A52038&amp;node-id=3997%3A260592&amp;viewport=-5721%2C-8848%2C0.46&amp;scaling=min-zoom&amp;starting-point-node-id=1092%3A65660\">prototype</a>  (it is just a slides without any interactivity). If you want to see actual figma frames <a href=\"https://www.figma.com/file/jbNOiBWvbtLuHaiTj4CW0G/Zulip-Web-App?node-id=3997%3A260592&amp;t=jmiVN2Z7Y90hwPRJ-1\">they are here</a>.</p>\n<p>Please ignore any UI outside the compose box.</p>\n<h2>1. Collapsed compose box</h2>\n<p>The main button looks like an input. Doesn't look disabled. There is a link to Drafts. <br>\n<a href=\"/user_uploads/2/e0/wkAqE-_wgKLgdv3QQR5BTsg_/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/e0/wkAqE-_wgKLgdv3QQR5BTsg_/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/e0/wkAqE-_wgKLgdv3QQR5BTsg_/image.png\"></a></div><h2>2. Hovered collapsed compose box</h2>\n<p>On desktop hover could be utilized to understand the potential intent of the user. So we could give an opportunity to create a new topic instead of opening compose box with the currently recognized topic<br>\n<a href=\"/user_uploads/2/4c/80QsL7-kQqMu7g7D4swTVxqL/image.png\">image.png</a>  <a href=\"/user_uploads/2/ef/-YfK01YjJvedZk8qPVDo40v6/image.png\">image.png</a> <a href=\"/user_uploads/2/bd/stH4zFtgMeQU0nb11LHBZGtr/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/4c/80QsL7-kQqMu7g7D4swTVxqL/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/4c/80QsL7-kQqMu7g7D4swTVxqL/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/ef/-YfK01YjJvedZk8qPVDo40v6/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/ef/-YfK01YjJvedZk8qPVDo40v6/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/bd/stH4zFtgMeQU0nb11LHBZGtr/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/bd/stH4zFtgMeQU0nb11LHBZGtr/image.png\"></a></div><h2>3. Opened compose box</h2>\n<p>By default the focused field is the compose text area. Unless a user clicked <code>NEW TOPIC</code> in case of which the focused input would be a topic name.<br>\nWhen we have mouse hover over the text area we are showing expand button on the top right corner.<br>\nSince compose box grows until about 50% of the screen height I don't think we should always show the expand button, so I suggest to show it only on mouse hover.<br>\n<a href=\"/user_uploads/2/ed/JoACtAATgp9uHMxcZcf1_T3r/image.png\">image.png</a> <a href=\"/user_uploads/2/93/J5WMNv5Ycr5fMG7mO40WTrE0/image.png\">image.png</a> <a href=\"/user_uploads/2/72/wOBXT1sS9zaEtM3PnuLYpoap/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/ed/JoACtAATgp9uHMxcZcf1_T3r/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/ed/JoACtAATgp9uHMxcZcf1_T3r/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/93/J5WMNv5Ycr5fMG7mO40WTrE0/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/93/J5WMNv5Ycr5fMG7mO40WTrE0/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/72/wOBXT1sS9zaEtM3PnuLYpoap/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/72/wOBXT1sS9zaEtM3PnuLYpoap/image.png\"></a></div>",
        "id": 1482957,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1672256139
    },
    {
        "content": "<h2>4. Compose box with a jump/scroll to view button</h2>\n<p>There is a desire to have such button visible and understandable. The current icon doesn't work for me. I suggest to have a text label.<br>\n<a href=\"/user_uploads/2/f9/fOdbk0pU51C8Vex5W3Kil6Ze/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/f9/fOdbk0pU51C8Vex5W3Kil6Ze/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/f9/fOdbk0pU51C8Vex5W3Kil6Ze/image.png\"></a></div><p>The alternative could be more visible but tricky to implement and very unusual: <a href=\"/user_uploads/2/c6/CJ4zMCTdKPZxevzNBuusT03P/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/c6/CJ4zMCTdKPZxevzNBuusT03P/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/c6/CJ4zMCTdKPZxevzNBuusT03P/image.png\"></a></div>",
        "id": 1482958,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1672256179
    },
    {
        "content": "<h2>5. Topic input</h2>\n<p>I suggest to don't have any cross to clear or any other special button to create a new topic. Once a user is in the input chances are it is easier to delete the text with a cursor or click a dropdown button.<br>\nI suggest to name default topic as <code>common topic</code> instead of <code>general chat</code>. <em>General</em> will be confused with the stream name and <code>chat</code> doesn't indicate that this is a topic. So if we want a field without extra labels like <code>Topic:</code> we should have a default topic name as a placeholder but also as a real name of the default topic.<br>\n<a href=\"/user_uploads/2/b6/Ar_E6jnaeQkdmq9PRWPP5JS8/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/b6/Ar_E6jnaeQkdmq9PRWPP5JS8/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/b6/Ar_E6jnaeQkdmq9PRWPP5JS8/image.png\"></a></div><p>In the opened drop down I suggest to have <code>Common topic</code> always on top and highlight is the same as placeholder of the topic field.<br>\n<a href=\"/user_uploads/2/93/C1b29N1ozfrKk7Ofalm4tIgA/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/93/C1b29N1ozfrKk7Ofalm4tIgA/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/93/C1b29N1ozfrKk7Ofalm4tIgA/image.png\"></a></div><p>I'm not sure if we should keep common topic once a user types something<br>\n<a href=\"/user_uploads/2/be/jy7j47lpEbP74jWWoOM-xsoB/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/be/jy7j47lpEbP74jWWoOM-xsoB/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/be/jy7j47lpEbP74jWWoOM-xsoB/image.png\"></a></div><p>In all cases I suggest to highlight the current value and also the hovered item</p>",
        "id": 1482961,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1672256700
    },
    {
        "content": "<h2>6. Stream input dropdown</h2>\n<p>Tim suggested to make it as a button vs an input  but make filtering possible. I'm not sure if we should suggest new stream creation right from here, but we could if filter doesn't find anything.<br>\nThe main new idea here is that user can select Direct Message among the streams, which will change the compose box to a different view</p>\n<p><a href=\"/user_uploads/2/21/4VgZGAEn6KFmvpevjSqwsaQI/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/21/4VgZGAEn6KFmvpevjSqwsaQI/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/21/4VgZGAEn6KFmvpevjSqwsaQI/image.png\"></a></div>",
        "id": 1482962,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1672256874
    },
    {
        "content": "<h2>7. Composing direct message</h2>\n<p>I'm calling it direct message because it is marketed better in my mind <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>. Also I'm avoiding confusion with private stream. I know that we didn't agree on that but I'm wishing <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span><br>\nInput allows at least 3 people without changing layout. If we have more than 1 row of names we could start block wrapping the ui elements.<br>\nI would like to have a simple drop down available for names selection. So a user can easily pick the recent/relevant people to message.</p>\n<p><a href=\"/user_uploads/2/dd/2bXemWpVUOj3K1bvLlDLuNeo/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/dd/2bXemWpVUOj3K1bvLlDLuNeo/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/dd/2bXemWpVUOj3K1bvLlDLuNeo/image.png\"></a></div>",
        "id": 1482963,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1672257069
    },
    {
        "content": "<p>so lets say I'm using tab-selection, for accessibility reasons. I tab through the elements on the screen, in tab order, until I select the collapsed box. Are the following true:</p>\n<ol>\n<li>I select the collapsed box, putting it in \"hover\" state.</li>\n<li>I hit tab again and am now selecting the <code>new topic</code> button</li>\n<li>If I'm, instead, using shift-tab to go through the tab order in reverse, it selects <code>new topic</code> first, then the collapsed box as a whole with another shift-tab press</li>\n</ol>",
        "id": 1482970,
        "sender_full_name": "Ken Clary",
        "timestamp": 1672257277
    },
    {
        "content": "<p>good questions <span class=\"user-mention\" data-user-id=\"19444\">@Ken Clary</span> . I didn't think about that case actually. I guess we could make tab order as: </p>\n<ol>\n<li><code>input/button</code> </li>\n<li><code>new topic button</code></li>\n<li><code>Drafts</code> button</li>\n</ol>",
        "id": 1483070,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1672266971
    },
    {
        "content": "<p>(ah, yes, the drafts button too)<br>\nthat slightly suggests that <code>new topic</code> should always be visible in some fashion, but I'm not sure.</p>",
        "id": 1483105,
        "sender_full_name": "Ken Clary",
        "timestamp": 1672269055
    },
    {
        "content": "<p>I'm super excited about this design! I think it does a good job of resolving a lot of tensions between having the features we want vs. not cluttering up the UI too much.</p>\n<p>A few small comments:</p>\n<ol>\n<li>I think we should keep the button text as \"Message #foo&gt;bar\", rather than \"Message <strong>to</strong> #foo&gt;bar\" (as in the screenshots), with \"Message\" being used as a verb for the action the user is taking by clicking on the button.</li>\n<li>I think it's reasonable to use a word-labeled button for \"Go to conversation\", but \"Show\" isn't quite working for me... A few other options:</li>\n</ol>\n<ul>\n<li>Go, Go here</li>\n<li>Jump, Jump here</li>\n<li>View</li>\n</ul>\n<p>Thoughts?</p>\n<ol start=\"3\">\n<li>The name \"Common topic\" isn't really working for me... I guess the proposal here is to add a new requirement of using the default topic name as the hint text, which pushes a bit towards using the word \"topic\" in the topic name. For reference, prior discussion is in <a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/Help.20Choosing.20Topic\">#feedback &gt; Help Choosing Topic</a> .</li>\n</ol>",
        "id": 1484105,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1672696643
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"22433\">@Vlad Korobov</span> also, see <a href=\"https://www.w3.org/WAI/GL/low-vision-a11y-tf/wiki/Placeholder_Research\">https://www.w3.org/WAI/GL/low-vision-a11y-tf/wiki/Placeholder_Research</a><br>\n(we had many discussions about this during the previous phase)</p>",
        "id": 1484139,
        "sender_full_name": "Ken Clary",
        "timestamp": 1672701549
    },
    {
        "content": "<blockquote>\n<p>which pushes a bit towards using the word \"topic\" in the topic name.</p>\n</blockquote>\n<p>Yes</p>",
        "id": 1484227,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1672724952
    },
    {
        "content": "<p>3 messages were moved from this topic to <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/Renaming.20.28no.20topic.29\">#design &gt; Renaming (no topic)</a> by <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span>.</p>",
        "id": 1486180,
        "sender_full_name": "Notification Bot",
        "timestamp": 1672969859
    },
    {
        "content": "<p>I think there's enough to talk about for the name of the \"general topic\" type placeholder thing we should give it its own thread; there's a lot of constraints we need to think about there.</p>",
        "id": 1486181,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672969938
    },
    {
        "content": "<p>This is making great progress! I've got various comments to post.</p>",
        "id": 1486188,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672970330
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box/near/1482962\">said</a>:</p>\n<blockquote>\n<h2>6. Stream input dropdown</h2>\n<p>Tim suggested to make it as a button vs an input  but make filtering possible. I'm not sure if we should suggest new stream creation right from here, but we could if filter doesn't find anything.<br>\nThe main new idea here is that user can select Direct Message among the streams, which will change the compose box to a different view</p>\n<p><a href=\"/user_uploads/2/21/4VgZGAEn6KFmvpevjSqwsaQI/image.png\">image.png</a></p>\n</blockquote>\n<p>The screenshot looks great to me!</p>\n<p>Just to clarify, the specific component I had in mind is the one we use in the \"Move topic\" modal for selecting a stream:</p>\n<p><a href=\"/user_uploads/2/f1/qlxwAaAWeSEnTYO-Z4HOaTuo/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/f1/qlxwAaAWeSEnTYO-Z4HOaTuo/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/f1/qlxwAaAWeSEnTYO-Z4HOaTuo/image.png\"></a></div><p>We can tweak the visual styling (that input type is used in like 5 places in the app, and possibly we would end up just changing the styles for the component everywhere to a nicer version we're designing), but from a code/JS perspective, we should be able to just use that input. <span class=\"user-mention\" data-user-id=\"21453\">@Evy</span> has work in <a href=\"https://github.com/zulip/zulip/pull/23355\">#23355</a> that would switch to that input with the current compose box, so my thinking is we can push to integrate that change (dealing with any change management issues involved) and then add the \"Switch\" option to that input's values to complete the non-CSS changes we'd need to have this component work as designed. Does that plan sound good?</p>",
        "id": 1486192,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672970567
    },
    {
        "content": "<p>A message was moved from this topic to <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/UI.20redesign.3A.20collapsed.20compose.20box\">#design &gt; UI redesign: collapsed compose box</a> by <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span>.</p>",
        "id": 1486196,
        "sender_full_name": "Notification Bot",
        "timestamp": 1672970986
    },
    {
        "content": "<p>I'm a bit confused by the exact semantics of the \"expand compose textarea\" button. We currently support two things: Dragging to increase the size of the compose area up to ~50% of the screen height (but still being able to see messages, and scroll around in a useful way), and a fullscreen mode, which is intended to help you compose a long-form post without anything cluttering your view.</p>\n<p>Which of those would the \"expand compose body textarea\" button implement?</p>",
        "id": 1486222,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672972488
    },
    {
        "content": "<p>For the topic input dropdown, we have ongoing work in <a href=\"https://github.com/zulip/zulip/pull/23627\">#23627</a> towards showing \"new topic\" in the existing topic input. I think we can definitely change the colors/styles we use for our typeaheads from the Bootstrap blue we're using now, but I wanted to flag that in the proposed design, I think the \"new topic\" indication in grey/italics text feels way too subtle. Conceptually, \"new topic\" should feel like a friendly/happy/normal/positive/default thing to do when you typed some stuff here, and so I think we're going to want a color/styling choice that conveys that (whether having \"new topic\" be in brand color or something else).</p>\n<p><a href=\"/user_uploads/2/74/jYw97Pl6XPEgSzHuJn71ARwk/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/74/jYw97Pl6XPEgSzHuJn71ARwk/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/74/jYw97Pl6XPEgSzHuJn71ARwk/image.png\"></a></div>",
        "id": 1486223,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672972723
    },
    {
        "content": "<blockquote>\n<p>then add the \"Switch\" option to that input's values to complete the non-CSS changes we'd need to have this component work as designed. Does that plan sound good?</p>\n</blockquote>\n<p>Than make sense to me... I can write up an issue (or edit the one we have) for the switcher in the dropdown approach.</p>",
        "id": 1486280,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1672990583
    },
    {
        "content": "<blockquote>\n<p>Which of those would the \"expand compose body textarea\" button implement?</p>\n</blockquote>\n<p>I was imagining that we'd still have the bottom right dragging option, and the top right button would open the full-screen compose.</p>",
        "id": 1486281,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1672990649
    },
    {
        "content": "<blockquote>\n<p>Which of those would the \"expand compose body textarea\" button implement?</p>\n</blockquote>\n<p>Behavior is the same as now... expand it to full height. I just moved the button from being next close X to be inside the text area.</p>\n<blockquote>\n<p>bottom right dragging option</p>\n</blockquote>\n<p>That i a standard browser based thing, which I didn't change in any way. I just didn't show it <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> </p>\n<blockquote>\n<p>\"new topic\" indication in grey/italics text feels way too subtle.</p>\n</blockquote>\n<p>Ok, I'll propose an update</p>",
        "id": 1486396,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1673015483
    },
    {
        "content": "<p>At this point I feel that I should start doing html/css/js mock of that since in static design is longer to iterate and hard to feel things the way they will be.</p>",
        "id": 1486414,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1673018124
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box/near/1486280\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>then add the \"Switch\" option to that input's values to complete the non-CSS changes we'd need to have this component work as designed. Does that plan sound good?</p>\n</blockquote>\n<p>Than make sense to me... I can write up an issue (or edit the one we have) for the switcher in the dropdown approach.</p>\n</blockquote>\n<p>I updated the issue description for <a href=\"https://github.com/zulip/zulip/pull/3409\">#3409</a> according to my understanding of the proposal. We haven't explicitly discussed what one sees in the dropdown when starting from the PMs view, but I think it makes sense for all the streams to be there... <span class=\"user-mention\" data-user-id=\"21453\">@Evy</span> FYI</p>",
        "id": 1486693,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673043220
    },
    {
        "content": "<p>Cool!</p>",
        "id": 1486739,
        "sender_full_name": "Evy",
        "timestamp": 1673048002
    },
    {
        "content": "<p>I think it would best if I start by continuing what I already was working towards, and then add the private message functionality separately in followup changes. Does that sound good?</p>",
        "id": 1486740,
        "sender_full_name": "Evy",
        "timestamp": 1673048037
    },
    {
        "content": "<p>Yep, perfect!</p>",
        "id": 1486759,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673049106
    },
    {
        "content": "<h3>Early interactive mock</h3>\n<p>I ask for an early feedback here, especially <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> and <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span>  . For now <strong>no dark mode</strong> and <strong>no pop overs</strong>. <br>\nFeedback from other people is also welcome!</p>\n<ul>\n<li>Video about it: <a href=\"https://share.cleanshot.com/v8Bps7Cs\">https://share.cleanshot.com/v8Bps7Cs</a></li>\n<li>Live version <a href=\"https://zulip-compose.vladkorobov.repl.co/\">https://zulip-compose.vladkorobov.repl.co/</a></li>\n<li>Screenshots:</li>\n</ul>\n<p><a href=\"/user_uploads/2/8f/hkpcvBUpxRmfISeEheu1WCDS/image.png\">image.png</a> <a href=\"/user_uploads/2/66/iiaFqns1Qf955zRMGhGScjOO/image.png\">image.png</a> <a href=\"/user_uploads/2/97/yk2tQbq54Fux0s-T_NAEa8Ja/image.png\">image.png</a> <a href=\"/user_uploads/2/6a/jeuWGJ4Ocq126s_V_vVRgPge/image.png\">image.png</a> <a href=\"/user_uploads/2/83/gbScgQizkyj-zWHeVGJh2cm1/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/8f/hkpcvBUpxRmfISeEheu1WCDS/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/8f/hkpcvBUpxRmfISeEheu1WCDS/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/66/iiaFqns1Qf955zRMGhGScjOO/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/66/iiaFqns1Qf955zRMGhGScjOO/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/97/yk2tQbq54Fux0s-T_NAEa8Ja/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/97/yk2tQbq54Fux0s-T_NAEa8Ja/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/6a/jeuWGJ4Ocq126s_V_vVRgPge/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/6a/jeuWGJ4Ocq126s_V_vVRgPge/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/83/gbScgQizkyj-zWHeVGJh2cm1/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/83/gbScgQizkyj-zWHeVGJh2cm1/image.png\"></a></div>",
        "id": 1505191,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1675871455
    },
    {
        "content": "<p><strong>The new UI/UX for the compose-box looks fantastic and is much more user-friendly. However, I have a few suggestions that could further improve its usability and enhance the overall user experience.</strong></p>\n<ul>\n<li>\n<p>The current placement of the <code>New Topic</code> button within the topic bar may not be easily recognizable to users. Moving it to a separate button above the <code>Send</code> button would draw more attention to it and make it more intuitive to locate.<br>\n<a href=\"/user_uploads/2/b9/A4BK6gYYDaatNHoWJgeLSzNB/New-topic.png\">New-topic.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/b9/A4BK6gYYDaatNHoWJgeLSzNB/New-topic.png\" title=\"New-topic.png\"><img src=\"/user_uploads/2/b9/A4BK6gYYDaatNHoWJgeLSzNB/New-topic.png\"></a></div></li>\n<li>\n<p>With the current change, switching between <code>streams</code> and <code>direct messages</code> requires clicking the downward arrow. However, adding a button next to the visible button would allow for easy toggling between the two, and the dropdown would simply list available <code>streams</code> and <code>direct message users</code>.<br>\n<a href=\"/user_uploads/2/30/5M4lwHiNXtGIGoqPxHP1XmnX/stream_toggle.png\">stream_toggle.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/30/5M4lwHiNXtGIGoqPxHP1XmnX/stream_toggle.png\" title=\"stream_toggle.png\"><img src=\"/user_uploads/2/30/5M4lwHiNXtGIGoqPxHP1XmnX/stream_toggle.png\"></a></div></li>\n</ul>",
        "id": 1505277,
        "sender_full_name": "Palash Baderia",
        "timestamp": 1675879724
    },
    {
        "content": "<p>Note that various ideas for a stream/PM switcher button were discussed, and even tested here; see <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/Convert.20replies.20between.20stream.20and.20private.20messages\">#design &gt; Convert replies between stream and private messages</a> . We found that (a) while the functionality is useful, it's not used frequently, so we want to avoid cluttering the UI by making it too prominent, and (b) it's hard to make a button to do this whose functionality is intuitive/clear to users.</p>",
        "id": 1505345,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1675882359
    },
    {
        "content": "<p>I’m a bit torn on new topic button. But I think I’m more on having that inside the input since it acts like a cross in an input</p>",
        "id": 1505378,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1675883805
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box/near/1505345\">said</a>:</p>\n<blockquote>\n<p>Note that various ideas for a stream/PM switcher button were discussed, and even tested here; see <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/Convert.20replies.20between.20stream.20and.20private.20messages\">#design &gt; Convert replies between stream and private messages</a> . We found that (a) while the functionality is useful, it's not used frequently, so we want to avoid cluttering the UI by making it too prominent, and (b) it's hard to make a button to do this whose functionality is intuitive/clear to users.</p>\n</blockquote>\n<p>That sounds reasonable. I didn't know about the discussion on the <code>New Topic</code> button, but it seems that with the given suggestions in that stream, the current choice is idle.</p>",
        "id": 1505442,
        "sender_full_name": "Palash Baderia",
        "timestamp": 1675887885
    },
    {
        "content": "<p>I think the <code>New Topic</code> button may be too low contrast. that can be fixed without moving it outside, though.</p>",
        "id": 1505470,
        "sender_full_name": "Ken Clary",
        "timestamp": 1675890034
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19444\">Ken Clary</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box/near/1505470\">said</a>:</p>\n<blockquote>\n<p>I think the <code>New Topic</code> button may be too low contrast. that can be fixed without moving it outside, though.</p>\n</blockquote>\n<p>Maybe a round or square high-contrast border could be a good option.</p>",
        "id": 1505478,
        "sender_full_name": "Palash Baderia",
        "timestamp": 1675890185
    },
    {
        "content": "<p>well, I'm thinking about the text itself, and I don't know if a border <em>within</em> the input is a good idea</p>",
        "id": 1505485,
        "sender_full_name": "Ken Clary",
        "timestamp": 1675890276
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19444\">Ken Clary</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box/near/1505485\">said</a>:</p>\n<blockquote>\n<p>well, I'm thinking about the text itself, and I don't know if a border <em>within</em> the input is a good idea</p>\n</blockquote>\n<p>That could be an option, but the border could also be shown with a hover effect.</p>",
        "id": 1505499,
        "sender_full_name": "Palash Baderia",
        "timestamp": 1675890620
    },
    {
        "content": "<p>I decrease contrast actually from the original one because otherwise it was too visible and after watching on it for an hour I faded it. Lets see what other people think after spending some time with it.</p>",
        "id": 1505536,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1675893811
    },
    {
        "content": "<p>I think the contrast is an accessibility issue, not an aesthetic one. (fwiw)</p>",
        "id": 1506610,
        "sender_full_name": "Ken Clary",
        "timestamp": 1675992556
    },
    {
        "content": "<p><strong>Significant update</strong></p>\n<ul>\n<li>experience is here <a href=\"https://Zulip-compose.vladkorobov.repl.co\">https://Zulip-compose.vladkorobov.repl.co</a></li>\n<li>improved contrast</li>\n<li>drafts counter only for the relevant conversation (Tim), counter is visible only in desktop version (switch to dm and back to stream)</li>\n<li>DM instead of Direct Message (Tim) and stream dropdown takes the smallest width possible</li>\n<li>Dark theme redesigned</li>\n<li>Editor buttons scrollable with mouse trackpad ver/hor + custom scroll left/right buttons</li>\n</ul>\n<p><strong>Next</strong></p>\n<ul>\n<li>show a way to place banners outside the compose box</li>\n<li>show popovers</li>\n</ul>",
        "id": 1509797,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1676785509
    },
    {
        "content": "<p>Everybody please try light and dark mode and tell me your feelings. Depending on the brightness of a screen and environment light perception changes. I’m afraid that compose box dark mode could feel too dark on average.</p>",
        "id": 1509884,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1676820585
    },
    {
        "content": "<p>dark mode looks fine to me</p>",
        "id": 1509891,
        "sender_full_name": "Ken Clary",
        "timestamp": 1676823918
    },
    {
        "content": "<p>Cool!</p>\n<ol>\n<li>\n<p>The scrolling button seems pretty intuitive to me when you can see some other buttons partially faded out, but otherwise it seem less clear what it means, since it fits in visually with the other buttons. I was especially noticing that the left button might be confusing, where it's not super obvious that you can scroll back over to the left. I'm not sure whether the transparency works differently on the left vs. the right?</p>\n</li>\n<li>\n<p>Is it intentional that the \"Go to conversation\" (eye) button disappears in a narrow window?</p>\n</li>\n</ol>",
        "id": 1510919,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1677016279
    },
    {
        "content": "<ol start=\"2\">\n<li>no, its more of a bug, I should fix it</li>\n<li>The goal is to teach scrolling via mouse wheel <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></li>\n</ol>",
        "id": 1511184,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1677041489
    },
    {
        "content": "<p><strong>Update</strong></p>\n<ul>\n<li>styles for popovers, including dark mode</li>\n<li>scrolling buttons feedback from <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span>  is addressed</li>\n<li>Go to conversation button in mobile version is visible</li>\n</ul>\n<p>At this point I think it is ok to hand it off for integration</p>",
        "id": 1518831,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1678066082
    },
    {
        "content": "<p><a href=\"https://Zulip-compose.vladkorobov.repl.co\">https://Zulip-compose.vladkorobov.repl.co</a></p>",
        "id": 1518832,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1678066092
    },
    {
        "content": "<p>One  thing here I'm suggesting is that user status for away - just a faint circle instead of hollow circle</p>",
        "id": 1518833,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1678066154
    },
    {
        "content": "<p><a href=\"https://replit.com/@VladKorobov/Zulip-compose\">https://replit.com/@VladKorobov/Zulip-compose</a></p>",
        "id": 1518834,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1678066382
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box/near/1518833\">said</a>:</p>\n<blockquote>\n<p>One  thing here I'm suggesting is that user status for away - just a faint circle instead of hollow circle</p>\n</blockquote>\n<p>I guess we should keep this part as a separate discussion / project. <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/UI.20redesign.3A.20idle.20color\">#design &gt; UI redesign: idle color</a> has the previous discussion (PR we tested: <a href=\"https://github.com/zulip/zulip/pull/20949\">#20949</a>).</p>",
        "id": 1519427,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1678130806
    },
    {
        "content": "<p>Yeah I think this is ready to hand off for integration. I wonder if there are any parts that can be split out as prep changes to simplify how much we are changing at once; I guess probably in any case the first step is to integrate the new stream picker input and then add support for switching to a direct message in that input.</p>",
        "id": 1520393,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1678238293
    },
    {
        "content": "<p>Since without adding that, it will not feel easy to remove the closed compose box buttons.</p>",
        "id": 1520394,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1678238316
    },
    {
        "content": "<p>Yeah… i also forgot to work through banners, adding them isn’t straightforward due to how pushing height and explicit height is done. Let me think about it</p>",
        "id": 1520715,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1678293062
    },
    {
        "content": "<h2>Update</h2>\n<p>I spend a bit more time with that and I think I improved it significantly.</p>\n<ul>\n<li>popovers</li>\n<li>tunes of colors</li>\n<li>banners</li>\n</ul>\n<p><a href=\"/user_uploads/2/cf/obnttsQ96xqmz5tE0F9hlVEd/image.png\">image.png</a><br>\n<a href=\"/user_uploads/2/78/l6sLE4TbvqFk9Mn6Lws6SbMe/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/cf/obnttsQ96xqmz5tE0F9hlVEd/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/cf/obnttsQ96xqmz5tE0F9hlVEd/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/78/l6sLE4TbvqFk9Mn6Lws6SbMe/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/78/l6sLE4TbvqFk9Mn6Lws6SbMe/image.png\"></a></div><p>Things to clarify in separate topics:</p>\n<ul>\n<li>style of statuses for people</li>\n<li>underlining links</li>\n</ul>",
        "id": 1523149,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1678649886
    },
    {
        "content": "<p>I'm going to record a video and update the link</p>",
        "id": 1523154,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1678650744
    },
    {
        "content": "<p><a href=\"https://zulip-compose.vladkorobov.repl.co/\">https://zulip-compose.vladkorobov.repl.co/</a></p>\n<p>Video about it: <a href=\"https://share.cleanshot.com/clY4ydQn\">https://share.cleanshot.com/clY4ydQn</a></p>",
        "id": 1523212,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1678665628
    },
    {
        "content": "<p>If there are no concerns I can create a github issue about it. <span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span></p>",
        "id": 1523217,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1678666591
    },
    {
        "content": "<p>Looks pretty reasonable to me. I'm not entirely sure about the underlined links but that's a separate topic. </p>\n<p>My only other feedback is that I'm the full screen compose box state (or more generally with tall compose boxes), the purple background with very wide margins to the right of the compose box and very little to the left feels a bit distracting with its asymmetry.</p>",
        "id": 1523912,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1678748299
    },
    {
        "content": "<p>The goal was to maintain the state and position of everything and perform as minimal change as possible. Yes, it is not full screen / zen mode writing experience. I don't think we should try to fix it now but give it a time and later improve.</p>",
        "id": 1523959,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1678750601
    },
    {
        "content": "<p>It looks good from my perspective as well!</p>\n<p>I would change the wording to \"Press Ctrl Enter to send\", rather than, \"To send press Ctrl Enter\", as in the screenshots, but I like the additional color on the selected option.</p>",
        "id": 1524007,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1678752461
    },
    {
        "content": "<p>I didn't follow the technical points about the banners, but one thing I noticed today is that banners seem to reduce the size that the compose text box stretches to, even after you've closed them out. I guess we should make sure this bug gets fixed in this compose box rewrite.</p>",
        "id": 1524009,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1678752529
    },
    {
        "content": "<blockquote>\n<p>banners seem to reduce the size that the compose text box stretches to</p>\n</blockquote>\n<p>I'm not sure I got it. In my suggestion banners do push height of the content input. Because this is the way they should act while the whole compose box has defined maximum height. Otherwise banners could push height away from the screen.</p>",
        "id": 1524054,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1678757346
    },
    {
        "content": "<p>Are you talking about the current behavior of the zulip banners or banners in the proposed design?</p>",
        "id": 1524058,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1678757462
    },
    {
        "content": "<p>Here is the video clarifications about the banners <a href=\"https://share.cleanshot.com/8h19D4Gb\">https://share.cleanshot.com/8h19D4Gb</a><br>\nAnd here is how the send options would look like if rephrased <a href=\"/user_uploads/2/af/Dc4vjGOqCw3KNO2WUNjlVbiA/image.png\">image.png</a>   - I don't like how hotkeys are standing one under another, but if you think it is ok I change it</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/af/Dc4vjGOqCw3KNO2WUNjlVbiA/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/af/Dc4vjGOqCw3KNO2WUNjlVbiA/image.png\"></a></div>",
        "id": 1524060,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1678758089
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box/near/1524058\">said</a>:</p>\n<blockquote>\n<p>Are you talking about the current behavior of the zulip banners or banners in the proposed design?</p>\n</blockquote>\n<p>Sorry to be unclear -- the current behavior. The part that seems like a clear bug is that if you close a banner, the height it previously used up seems to remain unavailable.</p>\n<p>The design in the video looks good to me. What happens when you close a banner in the new design?</p>",
        "id": 1525632,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1678919417
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box/near/1524060\">said</a>:</p>\n<blockquote>\n<p>And here is how the send options would look like if rephrased <a href=\"/user_uploads/2/af/Dc4vjGOqCw3KNO2WUNjlVbiA/image.png\">image.png</a>   - I don't like how hotkeys are standing one under another, but if you think it is ok I change it</p>\n</blockquote>\n<p>Hm, I see what you mean about the alignment, but I think it works better from an English perspective. I think this version is OK.</p>",
        "id": 1525634,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1678919520
    },
    {
        "content": "<h3>Update</h3>\n<p><a href=\"https://zulip-compose.vladkorobov.repl.co/\">https://zulip-compose.vladkorobov.repl.co/</a> (source <a href=\"https://replit.com/@VladKorobov/Zulip-compose\">https://replit.com/@VladKorobov/Zulip-compose</a>)</p>\n<ul>\n<li>3 state size (small which is growing, enlarged, maximum)</li>\n<li>smaller right side space (Russian translation for Drafts as the wides fits ok)</li>\n<li>on mobile drafts button is inside the popover</li>\n</ul>",
        "id": 1530141,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1679465863
    },
    {
        "content": "<blockquote>\n<p>3 state size (small which is growing, enlarged, maximum)</p>\n</blockquote>\n<p>Folks should play around with this. The idea is for it to replace the compose box dragging behavior (bottom right).</p>",
        "id": 1530784,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1679511783
    },
    {
        "content": "<p>Meanwhile I prepared the issue <a href=\"https://github.com/zulip/zulip/issues/24878\">https://github.com/zulip/zulip/issues/24878</a></p>",
        "id": 1533952,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1679877575
    },
    {
        "content": "<p>Issue is updated with decomposed version of the code and additional issues </p>\n<ul>\n<li><a href=\"https://github.com/zulip/zulip/issues/24878\">https://github.com/zulip/zulip/issues/24878</a></li>\n<li><a href=\"https://github.com/zulip/zulip/issues/25116\">https://github.com/zulip/zulip/issues/25116</a></li>\n<li><a href=\"https://github.com/zulip/zulip/issues/25117\">https://github.com/zulip/zulip/issues/25117</a></li>\n<li><a href=\"https://github.com/zulip/zulip/issues/25118\">https://github.com/zulip/zulip/issues/25118</a></li>\n</ul>\n<p>Also improved animations of the height change<br>\nAnd 3 positions of the enlargement/minimization are a bit smarter, so there is a smart switch when the area isn't enlarged but close to be enlarged</p>",
        "id": 1547699,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1681434487
    },
    {
        "content": "<p>Updated decomposed version (<a href=\"https://zulip-compose-decomposed.vladkorobov.repl.co/\">https://zulip-compose-decomposed.vladkorobov.repl.co/</a>):</p>\n<ul>\n<li>inline editor example</li>\n<li>read only editor example with copy button</li>\n<li>better dark theme styles </li>\n<li>better active/pressed states of buttons</li>\n<li>minor tunes of styles here and there</li>\n</ul>",
        "id": 1553701,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1682297984
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> I think it is ready to be taken.</p>",
        "id": 1553702,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1682298018
    },
    {
        "content": "<p>Awesome, thanks! I'll split off a thread with some comments regarding the message edit UI.</p>\n<p>In general, I expect we'll focus on this post-7.0 release.</p>",
        "id": 1553922,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1682348924
    },
    {
        "content": "<blockquote>\n<p>I'll split off a thread with some comments regarding the message edit UI.</p>\n</blockquote>\n<p><a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/UI.20redesign.3A.20message.20editing\">#design &gt; UI redesign: message editing</a></p>",
        "id": 1553935,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1682349670
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> mentioned this topic in <strong><a href=\"#narrow/stream/415-chat.zulip.org/topic/experiments/near/1601180\">#chat.zulip.org &gt; experiments</a></strong>.</p>",
        "id": 1601183,
        "sender_full_name": "Topic Bridge Bot",
        "timestamp": 1688064130
    },
    {
        "content": "<p>^ Another case of Bridge Bot failing</p>",
        "id": 1601371,
        "sender_full_name": "Neil Pilgrim (neiljp)",
        "timestamp": 1688069088
    },
    {
        "content": "<p>Yeah, it is not encoding the dots properly, I have deactivated the bot. Will reactivate after this and some other bug fixes. <br>\nThinking of deleting the message on <span aria-label=\"-1\" class=\"emoji emoji-1f44e\" role=\"img\" title=\"-1\">:-1:</span> reaction also.<br>\nIt is working fine on mobile app though.<br>\nCould you move these messages to relevant stream ?</p>",
        "id": 1601398,
        "sender_full_name": "Brijmohan Siyag",
        "timestamp": 1688069683
    }
]