[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box/near/1482957\">said</a>:</p>\n<blockquote>\n<h2>1. Collapsed compose box</h2>\n<p>The main button looks like an input. Doesn't look disabled. There is a link to Drafts. </p>\n</blockquote>\n<p><a href=\"/user_uploads/2/e0/wkAqE-_wgKLgdv3QQR5BTsg_/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/e0/wkAqE-_wgKLgdv3QQR5BTsg_/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/e0/wkAqE-_wgKLgdv3QQR5BTsg_/image.png\"></a></div><p>The actually looks a bit disabled to me at least when looking at the image in the lightbox. I would consider darkening the label a bit more.</p>",
        "id": 1486193,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672970668
    },
    {
        "content": "<p>A message was moved here from <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/UI.20redesign.3A.20compose.20box\">#design &gt; UI redesign: compose box</a> by <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span>.</p>",
        "id": 1486195,
        "sender_full_name": "Notification Bot",
        "timestamp": 1672970985
    },
    {
        "content": "<p>The only other thing I'm worried about with the closed compose box experience is whether will be sad that there's no way to make a new private message directly in this redesign. </p>\n<p>I suspect we will find that some users will have weird adaptations like clicking on random users in the right sidebar and then changing the recipient of the compose box that gets opened; that might feel like less work than opening the compose box for a stream and then changing to a private message recipient type. </p>\n<p>I suppose if we hear complaints, we can add something inside a <code>\\vdots</code> menu at the far right or something similarly subtle. </p>\n<p>I don't see a cheap way to figure out whether this will prove to be a real issue. I personally use the <code>x</code> keyboard shortcut to start new private messages while looking at a stream a few times a week, but anecdotally, I am not sure I know of anyone who regularly clicks the current \"New private message\" button with equivalent functionality.</p>",
        "id": 1486197,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672971091
    },
    {
        "content": "<p>I think other than those two things, this looks great to me. I think both are things where just trying the change as designed would be a reasonable next step, though I think if we are not going to have a \"New private message\" button hidden somewhere, integrating this change is blocked on adding the ability to change message types in the open compose box.</p>",
        "id": 1486198,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1672971146
    },
    {
        "content": "<blockquote>\n<p>I am not sure I know of anyone who regularly clicks the current \"New private message\" button</p>\n</blockquote>\n<p>Exactly. From y observation people don't click New PM button.<br>\nHere is what I observed when I ask a person neat their computer to write a DM to me:</p>\n<ol>\n<li>Looking on the right panel and hovering the mouse to catch my name - no quick luck here, because people names are jumping due to status change and we have like 30 people. Searching here doesn't feel like a quick thing, but I saw some times people do that.</li>\n<li>Change of tactic <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> Lets look in the list of previous DMs... hm, there is no me there in the top 5 recent and expanding the list looks like accepting the failure in the task of <strong>I can do it quickly</strong></li>\n<li>\n<p>Jumping in the last conversation a person saw me participating in some stream and clicking my name there then clicking DMs with that person... there is a confusion here too because both options start with the same word <code>View</code>: <a href=\"/user_uploads/2/2a/tbDwKZS6PkT0w5d-pmgqUUpl/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/2a/tbDwKZS6PkT0w5d-pmgqUUpl/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/2a/tbDwKZS6PkT0w5d-pmgqUUpl/image.png\"></a></div></li>\n<li>\n<p>If there was no luck in 1-3 I want to instruct a person to do a heavy lifting. People reluctant to do that, but I insist:<br>\n\"Ctrl + K and type Vlad and select Private messages with Vlad\". After doing that a person see the success and very surprised about such amazing approach. It doesn't change instantly what they do next time for the same task because it is a habit and doesn't look snappy because you have to arrow down multiple times since DMs with a person are not at the top of the search. We do need a good Jump menu... which is a separate discussion.</p>\n</li>\n</ol>\n<p>I agree that there is a confusion about input field, since it is not telling it is universal but placeholder suggests to compose to a particular place while a user might want to do a DM. The only thing I can suggest here to include that button on hover.</p>\n<p><a href=\"/user_uploads/2/d2/agKrBwlEhg0xqNGeZ6LiOhFb/image.png\">image.png</a> <br>\n<a href=\"/user_uploads/2/3b/dd1L3LsaXPtfLfjuv6bUODxy/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/d2/agKrBwlEhg0xqNGeZ6LiOhFb/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/d2/agKrBwlEhg0xqNGeZ6LiOhFb/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/3b/dd1L3LsaXPtfLfjuv6bUODxy/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/3b/dd1L3LsaXPtfLfjuv6bUODxy/image.png\"></a></div>",
        "id": 1486405,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1673017194
    },
    {
        "content": "<blockquote>\n<p>there is a confusion here too because both options start with the same word View: image.png</p>\n</blockquote>\n<p>In theory, they shouldn't be using either of those options. We have \"Send private message\".</p>",
        "id": 1486446,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673024313
    },
    {
        "content": "<p>I think once you know it, the <code>x</code> shortcut and typing in the person's name (with auto-complete) is the most convenient option for sending a PM.</p>",
        "id": 1486447,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673024399
    },
    {
        "content": "<blockquote>\n<p>The only thing I can suggest here to include that button on hover.</p>\n</blockquote>\n<p>Hm, interesting. I wonder if it would help, or if it would be just as invisible as the current \"New private message\" button.</p>",
        "id": 1486449,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673024514
    },
    {
        "content": "<p>I have never used <code>x</code> or <code>new private message</code> button since I always like to see previous messages before sending a message. So, I usually try to narrow to the PM using left or right sidebar.</p>",
        "id": 1486451,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1673024588
    },
    {
        "content": "<p>I sometimes use <code>x</code> + <code>ctrl + .</code> or the \"go to conversation\" button for that.</p>",
        "id": 1486453,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673024628
    },
    {
        "content": "<p>(I also use the left sidebar.)</p>",
        "id": 1486454,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673024670
    },
    {
        "content": "<p>I would still prefer to use <code>w</code> + type <code>Tim</code> and <code>enter</code>. Feels more reliable somehow.</p>",
        "id": 1486455,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1673024683
    },
    {
        "content": "<p>Heh, I didn't know that keyboard shortcut. :)</p>",
        "id": 1486458,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1673024902
    }
]