[
    {
        "content": "<p>Hey guys, before going to all kinds of polishing and implementation I want to suggest that approach to topic headers. <br>\nThis is a feature and not just a redesign. <br>\nWe could split implementation into redesign + feature.<br>\nI understand that this suggestion might face biased views on how people who read this channel used to consume Zulip. </p>\n<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> told recently that we should try to teach people how to point to streams and topics <code>#design &gt; new line / send commands</code>. And It triggered in my head awareness about new visual objects without a reason or underlying meaning. <br>\nThere are at least 2 ways of indicating streams right now:</p>\n<ol>\n<li>hashtag symbol with a color: <a href=\"/user_uploads/2/a4/9UQEq4xugB_pSNKXqtXJhx9S/image.png\">image.png</a> <div class=\"message_inline_image\"><a href=\"/user_uploads/2/a4/9UQEq4xugB_pSNKXqtXJhx9S/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/a4/9UQEq4xugB_pSNKXqtXJhx9S/image.png\"></a></div></li>\n<li>arrow pointer with a color <a href=\"/user_uploads/2/17/XK_h09x3NAvBhj3UoR8zkX7p/image.png\">image.png</a> <div class=\"message_inline_image\"><a href=\"/user_uploads/2/17/XK_h09x3NAvBhj3UoR8zkX7p/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/17/XK_h09x3NAvBhj3UoR8zkX7p/image.png\"></a></div></li>\n</ol>\n<p>Arrow pointer feels like unnecessary extra. It goes against desire to teach <code>#design &gt; new line / send commands</code>. We don't really need a pointer once we are inside a stream, since we have a global header: <a href=\"/user_uploads/2/f4/Ua4cqJ-f1LdmR7WKh2Z90nny/image.png\">image.png</a> .</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/f4/Ua4cqJ-f1LdmR7WKh2Z90nny/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/f4/Ua4cqJ-f1LdmR7WKh2Z90nny/image.png\"></a></div><p>So suggested approach is to don't have stream pointers inside a stream and to maintain the same visual encoding of a stream everywhere.<br>\nHere is the <a href=\"https://www.figma.com/proto/jbNOiBWvbtLuHaiTj4CW0G/Zulip-2022?page-id=653%3A49783&amp;node-id=653%3A49784&amp;viewport=349%2C48%2C0.39&amp;scaling=min-zoom&amp;starting-point-node-id=653%3A49784\">prototype with 2 screens</a> . It shows the same content in 2 different contexts: inside the stream and inside the All messages</p>",
        "id": 1316109,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1643172822
    },
    {
        "content": "<p><a href=\"/user_uploads/2/f3/HGq2E4sxVe2mlwCEObIKVPOw/topic-headers.png\">inside the stream</a> <br>\n<a href=\"/user_uploads/2/cc/KJLlvPNl7RTDjfyl7OP1pn__/all-messages.png\">inside All messages</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/f3/HGq2E4sxVe2mlwCEObIKVPOw/topic-headers.png\" title=\"inside the stream\"><img src=\"/user_uploads/2/f3/HGq2E4sxVe2mlwCEObIKVPOw/topic-headers.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/2/cc/KJLlvPNl7RTDjfyl7OP1pn__/all-messages.png\" title=\"inside All messages\"><img src=\"/user_uploads/2/cc/KJLlvPNl7RTDjfyl7OP1pn__/all-messages.png\"></a></div>",
        "id": 1316110,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1643172863
    },
    {
        "content": "<p>I don't feel strongly, but I think I disagree. I think the flag pointer with the stream helps ground you to where you are, especially cos there are many views you can possibly be in -- i.e. All messages, vs, a stream, etc</p>",
        "id": 1316160,
        "sender_full_name": "Jore",
        "timestamp": 1643176860
    },
    {
        "content": "<p>Although yeah maybe only having flag pointers in All Messages might even help strengthen that view...</p>",
        "id": 1316174,
        "sender_full_name": "Jore",
        "timestamp": 1643178851
    },
    {
        "content": "<p>I think it would be worth trying!</p>",
        "id": 1316176,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1643179612
    },
    {
        "content": "<p>Just as long as it's not confusing for new users. I work with a group that is not tech savvy and they already find Zulip a bit bewildering. Consistency seems to be their comfort. Just 2c</p>",
        "id": 1316268,
        "sender_full_name": "Jore",
        "timestamp": 1643193692
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"20503\">@Jore</span> are you saying that in the suggested design you want a bigger colored highlight ?</p>",
        "id": 1316295,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1643198988
    },
    {
        "content": "<p>As with the current design, I don't think I ever notice the top header, so it's kinda nice to know where I am through these nice colored stream headings on top of each thread.</p>",
        "id": 1316328,
        "sender_full_name": "Palash Raghuwanshi",
        "timestamp": 1643204195
    },
    {
        "content": "<p>But maybe that's sort of a \"bad habit\" that I got into,  I didn't need to look up as the stream name was visible right in front of my eye, and maybe that can change after we remove it?</p>",
        "id": 1316330,
        "sender_full_name": "Palash Raghuwanshi",
        "timestamp": 1643204673
    },
    {
        "content": "<p>I would have to learn to give emphasis to the top header, which , surprisingly enough, I don't usually do.</p>",
        "id": 1316332,
        "sender_full_name": "Palash Raghuwanshi",
        "timestamp": 1643204820
    },
    {
        "content": "<p>Right, when you have something in your face you don't look for any other things. But the idea of the top header is to remind you where you clicked a second ago. And I understand that some people have a good memory and the active section is also highlighted on the left.</p>",
        "id": 1316335,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1643205017
    },
    {
        "content": "<p>I definitely support experimentation here.  I am pretty good at tuning out visual clutter, but the topic bars have always felt clunky to me.</p>",
        "id": 1316379,
        "sender_full_name": "Steve Howell",
        "timestamp": 1643213119
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"22433\">@Vlad Korobov</span> one detail to mention -- I think at present the \"recipient bars\" (i.e. the things that can contain stream/topic or PM) should never contain a timestamp, only a date.  And the top recipient bar should always have a date on it.  It's very valuable to be able to just visually scan the right columns with dates and times to determine when the messages you're looking at were sent, and this is especially important in Zulip in comparison to other chat applications, because Zulip's threading model means folks look at or link to old conversations a lot more often.</p>\n<p>(I realize this is a mockup and this might not be the details you're thinking about varying, but figured I'd flag it since we haven't talked about it explicitly).</p>",
        "id": 1316619,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643239257
    },
    {
        "content": "<p>I think both elements of the proposal here here are worth experimenting with:</p>\n<ul>\n<li>The recipient bar / topic header design that has more of a <code>stream &gt; topic</code> card appearance. I think it's visually attractive.  The main downside is decreased visibility for stream colors, but it comes with stream+topic pairs being displayed consistently ~everywhere (we can't really do this in the left sidebar without it being ugly).</li>\n<li>The headers only containing the topic, not the stream name.  This is actually a design change we wanted to make in 2018 before I got sick, and I think successfully made in the mobile apps (where there's not enough space to display both in a single line anyway).  I do think we need to be somewhat careful about the usability tradeoffs here.  It might seem subtle, but there is a substantial usability difference between being able to answer \"where was this message sent\" by just looking at the heading for the message, without also looking at the top of the page to see what stream you're in.  But I think we can get much better intuition on this question by trying something.  I think that it is very possible that in interleaved views, we actually do want to show the full stream+topic in each line, since we have the space for it, but might choose to skip that for a topic-only view where the topic is always just going to be at the top of the page next to the stream name.</li>\n</ul>",
        "id": 1316622,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643239556
    },
    {
        "content": "<p>I would probably prioritize prototyping the first change (design for topic headers with stream+topic in them), since it'll be easier to evaluate the tradeoffs from a settled design there.</p>",
        "id": 1316623,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643239624
    },
    {
        "content": "<blockquote>\n<p>I do think we need to be somewhat careful about the usability tradeoffs here. It might seem subtle, but there is a substantial usability difference between being able to answer \"where was this message sent\" by just looking at the heading for the message, without also looking at the top of the page to see what stream you're in.</p>\n</blockquote>\n<p>I struggle to believe that the person forget that they are in SELECTED STREAM now, because that is how they got there. There is left panel selection + top bar clarification.<br>\nShould we really optimize fore a case of \"where was this message sent\" (is it frequent)? So if it is lets just use the same word multiple times on the screen by having <code>#stream1&gt;topic1 </code> <code>#stream1&gt;topic2</code> <code>#stream1&gt;topic3</code>.</p>\n<p>But come on..., you wanted to do that, that is working on mobile, people know how to use table headers and we have a header always on top.<br>\nLet's try that and see if it's not working on us. </p>\n<p>And if its not working it is easy to return and we will have a problem of \"people don't look at the top bar\".</p>\n<p>I do worry about the color reduction...</p>",
        "id": 1316704,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1643255139
    },
    {
        "content": "<p>I'm in favor of the proposed design, I specially like the all messages view.</p>",
        "id": 1316742,
        "sender_full_name": "Yash RE",
        "timestamp": 1643264012
    },
    {
        "content": "<p>Here is a little update about topic headers. <a href=\"https://www.figma.com/proto/jbNOiBWvbtLuHaiTj4CW0G/Zulip-2022?page-id=653%3A49783&amp;node-id=653%3A50405&amp;viewport=241%2C48%2C0.54&amp;scaling=min-zoom&amp;starting-point-node-id=653%3A49784\">Interactive prototype</a></p>\n<p>Since people told me that there would be search pills I thought I'll use that opportunity to highlight the currently selected stream.<br>\nThis example is not about search UX or flow but I showed a bit of that.</p>\n<p><a href=\"/user_uploads/2/1/8PiF2SsnltK47ZudbsB4arc4/topic-headers-02-01.png\">One of the screens</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/1/8PiF2SsnltK47ZudbsB4arc4/topic-headers-02-01.png\" title=\"One of the screens\"><img src=\"/user_uploads/2/1/8PiF2SsnltK47ZudbsB4arc4/topic-headers-02-01.png\"></a></div>",
        "id": 1318952,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1643524712
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"22433\">@Vlad Korobov</span> what does the bold thread under the left sidebar #design section represent?</p>",
        "id": 1321512,
        "sender_full_name": "Bethany Davis",
        "timestamp": 1643837841
    },
    {
        "content": "<p>Currently active topic on which you just clicked</p>",
        "id": 1321516,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1643837990
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> <a href=\"#narrow/stream/101-design/topic/UI.20redesign.3A.20topic.20headers/near/1316704\">said</a>:</p>\n<blockquote>\n<p>I struggle to believe that the person forget that they are in SELECTED STREAM now, because that is how they got there. There is left panel selection + top bar clarification.<br>\nShould we really optimize fore a case of \"where was this message sent\" (is it frequent)? So if it is lets just use the same word multiple times on the screen by having <code>#stream1&gt;topic1 </code> <code>#stream1&gt;topic2</code> <code>#stream1&gt;topic3</code>.</p>\n</blockquote>\n<p>You're probably right, though I'll note that mobile is a pretty different experience just because of the device shape, and at least the <code>n</code> consideration below doesn't apply.</p>\n<p>But I think there are a couple workflows worth mentioning which result in one frequently arriving at a topic without having clicked on it explicitly:</p>\n<ul>\n<li>Clicking a link that navigates your Zulip to another topic, whether in app or on somewhere like GitHub.  (Though I'll note that our typeahead at least generates links that do make clear where you're going, so it's more out-of-app things that I'm worried about here).</li>\n<li>Hitting the <code>n</code> shortcut, which jumps you to the next unread topic.</li>\n</ul>\n<p>So I guess maybe you should take my feedback more as \"I think it's possible that we'll try this and we'll discover that these problems are worse than we expected\" than \"I think it's likely we're going to not end up making this change\".</p>",
        "id": 1324363,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1644287717
    },
    {
        "content": "<p>I think I also agree that were the experience with these flows to be bad, the core problem would ultimately be that we didn't manage to display the current stream clearly enough in the sidebar / top navbar parts of the design, and we were basically using the repetition as a crutch.  Certainly Zulip navbar design a few years ago was really bad in a way that was effectively invisible to usability testers, and that perhaps dated context is perhaps part of the reason I thought of this issue.</p>",
        "id": 1324364,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1644287906
    },
    {
        "content": "<p>yeah, I guess ordering of experiments of the design is also a big factor here</p>",
        "id": 1324366,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1644288031
    },
    {
        "content": "<p>I'd say that even with our current top navbar design, which isn't ugly like the old one, it still feels like that top area is kinda disconnected from the message feed itself, in a way that the topic block headings don't.</p>",
        "id": 1324369,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1644288232
    }
]