[
    {
        "content": "<blockquote>\n<p>So right now if you have a feedback please clearly highlight what in the general design suggestion is a HARD NO GO for you.</p>\n</blockquote>\n<p>(not an exact HARD NO GO but a critique) I think the bottom bar could be improved, but the single floating \"Compose\" button is strictly inferior.</p>",
        "id": 1343954,
        "sender_full_name": "Ken Clary",
        "timestamp": 1647265421
    },
    {
        "content": "<blockquote>\n<p>single floating \"Compose\" button is strictly inferior</p>\n</blockquote>\n<p>do you click all 3 Zulip bottons now? Did you see the video comments about it?</p>",
        "id": 1343961,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1647266838
    },
    {
        "content": "<p>I occasionally click any of the 3, though probably 90% of the time I'm just clicking the one. that said, what the one does is context dependent and the button label including that context is super key.<br>\nI have not watched any of the videos.</p>",
        "id": 1343963,
        "sender_full_name": "Ken Clary",
        "timestamp": 1647267186
    },
    {
        "content": "<p>I'd be curious to know more about how people interact with the compose buttons. I personally use the big reply button, but the two buttons on the right are basically invisible to me. So my workflows are:</p>\n<ul>\n<li><strong>Existing topic</strong>: Navigate to it and press the \"Message...\" button.</li>\n<li><strong>New topic</strong>: Navigate to the stream, press the  \"Message...\" button, delete the topic, and enter a new topic name.</li>\n<li><strong>PM</strong>: Navigate via left sidebar if I can find the conversation. Or perhaps start composing with the <code>x</code> shortcut.</li>\n</ul>\n<p>What do other folks do?</p>",
        "id": 1344290,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647292379
    },
    {
        "content": "<p>I basically only start messages via keyboard shortcuts or clicking on a specific message to reply.</p>\n<p>That said, I think the purpose of the \"New topic\" and \"New private message\" buttons is more to address onboarding confusion (\"How do I create a new topic?\"), and I think we should be cautious about analyzing whether those buttons are useful through an analysis of what experience users like myself do <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>.</p>",
        "id": 1344524,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1647304828
    },
    {
        "content": "<p>it’s true that I often just click on the message I want to reply to. but I vary alot in between clicking on buttons, clicking on messages, and using a keyboard</p>",
        "id": 1344525,
        "sender_full_name": "Ken Clary",
        "timestamp": 1647305059
    },
    {
        "content": "<p>I never use compose buttons to reply, but I almost always use the <code>New topic</code> button to start a new topic. For PMs I use the buddy list if the person is present, but if not I go to the <code>New private message</code> button.</p>",
        "id": 1344871,
        "sender_full_name": "Steve Howell",
        "timestamp": 1647355558
    }
]