[
    {
        "content": "<p>I just test-deployed once again changes to have the webapp use the same backend-powered data source for unread counts that we use on mobile.</p>",
        "id": 584094,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1526945570
    },
    {
        "content": "<p>So be on the lookout for any weird behavior when narrowing -- we've fixed all the issues from previous deploys, but that doesn't mean it's perfect now <span class=\"emoji emoji-1f603\" title=\"smiley\">:smiley:</span>.</p>",
        "id": 584095,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1526945619
    },
    {
        "content": "<p>The benefits of this model is that the left sidebar can now immediately render accurately what has unread messages on the first RTT (rather than updating over a few RTTs as we fetch messages), and we no longer have unread messages getting lost in the deep history on a muted stream.  (E.g. my <a class=\"stream\" data-stream-id=\"7\" href=\"/#narrow/stream/7-test-here\">#test here</a> is now correctly displaying my 2737 unread messages there)</p>",
        "id": 584098,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1526945695
    },
    {
        "content": "<p>The main thing I've noticed so far on this iteration is that it's really hard to clear the unreads on my muted streams, since it doesn't mark all as read with <code>End</code> nor does it have particularly large batch sizes.</p>",
        "id": 584103,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1526945817
    },
    {
        "content": "<p>The fix might be to just do a 400 batch size when fetching downwards in a narrow or something.</p>",
        "id": 584105,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1526945831
    },
    {
        "content": "<p>can we do something like </p>\n<ul>\n<li>Make \"End\" in a narrow have special behavior (i.e. send \"mark all as read\" to the backend)</li>\n<li>Show a link at the bottom, that's \"mark all messages as read\"?</li>\n</ul>",
        "id": 584110,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1526945919
    },
    {
        "content": "<p>The bottom link thing is a bit tricky, since you can't get to the bottom inside the feed.  We could have something in the lower-right corner in an overlay position, though.</p>",
        "id": 584116,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1526945990
    },
    {
        "content": "<p>yeah. Though I'm also fine with \"End\" just invariably doing \"mark all as read\".</p>",
        "id": 584123,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1526946211
    },
    {
        "content": "<p>I think there's a bug with muted topics in the left sidebar. Those muted topics are really really old (from GCI). <a href=\"/user_uploads/2/4b/XFjh2bK8wMnDr24_fYZAlvsJ/Screen-Shot-2018-05-21-at-6.43.11-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-05-21-at-6.43.11-PM.png\">Screen-Shot-2018-05-21-at-6.43.11-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/4b/XFjh2bK8wMnDr24_fYZAlvsJ/Screen-Shot-2018-05-21-at-6.43.11-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-05-21-at-6.43.11-PM.png\"><img src=\"/user_uploads/2/4b/XFjh2bK8wMnDr24_fYZAlvsJ/Screen-Shot-2018-05-21-at-6.43.11-PM.png\"></a></div>",
        "id": 584222,
        "sender_full_name": "Joshua Pan",
        "timestamp": 1526953452
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"857\">@Joshua Pan</span> it's not a bug in the new code.  What's going on is that those muted topics you never read (they'd just been lost in the deep history a year ago, because before we fixed this, Zulip stopped displaying muted topics significantly older than your older unread non-muted message)</p>",
        "id": 584240,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1526967905
    },
    {
        "content": "<p>But it does make me wonder whether we need some sort of announcement feature when enabling this for folks to avoid them thinking it's a bug.</p>",
        "id": 584241,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1526967927
    },
    {
        "content": "<p>I see. I'll go ahead and mark them as read then.</p>",
        "id": 584242,
        "sender_full_name": "Joshua Pan",
        "timestamp": 1526967959
    },
    {
        "content": "<p>I think there's probably a reasonable cutoff where we can just automatically mark really old messages as read.</p>",
        "id": 584285,
        "sender_full_name": "Steve Howell",
        "timestamp": 1526982862
    },
    {
        "content": "<p>If we're paranoid that we're gonna ruin somebody's day by marking 3-month-old muted messages as read, another solution would be to have some kind of big-hammer \"Mark all muted topics as read\" UI available.</p>",
        "id": 584331,
        "sender_full_name": "Steve Howell",
        "timestamp": 1526991608
    },
    {
        "content": "<p>Has anyone noticed issues with this other than having to mark super-old messages as read?</p>",
        "id": 584836,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1527025204
    },
    {
        "content": "<p>I'd be wary of marking messages as read based on any kind of heuristic without user action.</p>\n<p>As a user, that kind of behavior makes me not trust that I can rely on the read/unread behavior to help me eventually get to something if I want to -- and that leads to feeling I have to catch up on everything right now, or else miss something forever.</p>",
        "id": 584931,
        "sender_full_name": "Greg Price",
        "timestamp": 1527032415
    },
    {
        "content": "<p>Is this change still test-deployed here? I just played a bit with the #commits stream, which I apparently have muted and haven't read in nearly a year, and here's what I see:</p>\n<ul>\n<li>The unread count in the sidebar is 609.</li>\n<li>When I hit \"end\", I jump down a bunch to the apparent end, and the count drops to 508.</li>\n<li>About a half-second later, a bunch more messages show up below my cursor, all unread, and the count jumps back up.</li>\n</ul>",
        "id": 584952,
        "sender_full_name": "Greg Price",
        "timestamp": 1527034781
    },
    {
        "content": "<p>(I just noticed that stream and was going to unsubscribe, but thought I'd clear the unreads first)</p>",
        "id": 584953,
        "sender_full_name": "Greg Price",
        "timestamp": 1527034813
    },
    {
        "content": "<p>It is.  The only thing unexpected there is the count jumping back up.</p>",
        "id": 584955,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1527034814
    },
    {
        "content": "<p>Well, and the count is too low to begin with. :)</p>",
        "id": 584957,
        "sender_full_name": "Greg Price",
        "timestamp": 1527034827
    },
    {
        "content": "<p>Just to follow up, Greg and I did some debugging, and his issue is that we limit to just 5000 unread messages with our query, and he has like 27K, so that's why more messages were appearing.</p>",
        "id": 585009,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1527036446
    },
    {
        "content": "<p>So my conclusion is before turning this on for everyone, we need to:</p>\n<ul>\n<li>Add some sort of banner (maybe where we put the desktop notifications notice) to notify users about the changes in how Zulip does unread counts for folks who have old unread messages.  I have some ideas for how to do this.</li>\n<li>Make <code>End</code> in a narrow mark everything as read.  You can use page-down if you want to just jump a few at a time</li>\n<li>Probably raise that 5000 limit to something significantly bigger (perf-wise, it's still under 0.5s on <a href=\"http://chat.zulip.org\" target=\"_blank\" title=\"http://chat.zulip.org\">chat.zulip.org</a> for fetching his 30K)...</li>\n</ul>",
        "id": 585010,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1527036534
    },
    {
        "content": "<p>That plan sounds good!</p>",
        "id": 585050,
        "sender_full_name": "Greg Price",
        "timestamp": 1527039290
    },
    {
        "content": "<p>With a reasonable limit like 30k or 50k, I'd probably still run into this kind of behavior if I tried to catch up on my Recurse Center unreads... but with <code>End</code> doing the right thing, I might hardly notice because in the busiest streams I'd just be doing that (and then unsubscribing) anyway.</p>\n<p>Even just the part where the unread counts I saw would be thousands, instead of a misleadingly approachable-looking hundreds, would shift me toward mass-clearing them, and also give me lower expectations of the counts being exact or behaving in totally predictable ways.</p>",
        "id": 585054,
        "sender_full_name": "Greg Price",
        "timestamp": 1527039480
    },
    {
        "content": "<p>(I think a lot of Recursers are generally in the same boat as me in that org in that they have vast numbers of unreads, often in muted streams.)</p>",
        "id": 585055,
        "sender_full_name": "Greg Price",
        "timestamp": 1527039527
    },
    {
        "content": "<p>To reply to one of your questions (in a video and in chat here) that's been discussed less than others:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"22433\">Vlad Korobov</span> <a href=\"#narrow/stream/101-design/topic/Redesign.20to.20be.20like.20Discord/near/1303334\">said</a>:</p>\n<blockquote>\n<ul>\n<li>what's up with unread message indicator? how important is that? why on the left side? how visible/subtle it should be?</li>\n</ul>\n</blockquote>\n<p>In my usage I find the unread-message indicator helps quite a lot in quickly orienting me when I'm looking at an old thread that has some new messages -- which is a large fraction of the threads I read. It helps me quickly see, OK, <em>here's</em> the messages I haven't read yet; above that are the messages that I saw in the past and probably don't need to read again.</p>\n<p>In one of the videos you referred a couple of times to an unread <em>count</em>, like maybe putting a count of unread messages somewhere over the message list instead of having indicators on the messages. But that wouldn't really serve this purpose, because it wouldn't be visually colocated with the messages it's telling me are unread. If it says there are 3 unreads, I could maybe count from the bottom, one, two, three, OK, this is the first unread message… but even when that works, it's a lot more work and I likely might as well just reread-skim and find where it stops being familiar.</p>\n<p>I think the version in your prototypes where the indicator is thinner works fine, though.</p>",
        "id": 1304440,
        "sender_full_name": "Greg Price",
        "timestamp": 1641364425
    },
    {
        "content": "<p>(You can view starred messages per stream/topic. Narrow to the stream/topic, then click the search bar and add <code>is:starred</code>. You can bookmark the resulting URL if you want. <a href=\"help/search-for-messages\">Documentation</a>.)</p>",
        "id": 1304525,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1641377228
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> One way to address the unread # count in the left panel is to do what Gmail does. Gmail list only the total unread message count for \"All Messages\" and for all Streams, they just place a small dot next to a stream if there's an unread message (and not display the # of unread messages) in that category. It's a really good compromise between providing information while reducing clutter. <span class=\"user-mention\" data-user-id=\"22433\">@Vlad Korobov</span></p>",
        "id": 1304556,
        "sender_full_name": "Bethany Davis",
        "timestamp": 1641389607
    },
    {
        "content": "<p>Above is how Gmail handles it in the collapse mode. For the extended more to the left panel, what they do is bold (and in black font color) any stream with unread message and then in a very light grey - put the unread message count.</p>",
        "id": 1304557,
        "sender_full_name": "Bethany Davis",
        "timestamp": 1641389779
    },
    {
        "content": "<p>I'm not sure in which case Gmail acts like that. I understand your suggestion and open to it. But Gmail does output number of unread per tag: <a href=\"/user_uploads/2/47/3D4QudOn7s1M38ylAhiVz48w/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/47/3D4QudOn7s1M38ylAhiVz48w/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/47/3D4QudOn7s1M38ylAhiVz48w/image.png\"></a></div>",
        "id": 1304644,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1641404069
    },
    {
        "content": "<p>Gmail is just not a good comparison here.</p>",
        "id": 1304653,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1641404389
    },
    {
        "content": "<blockquote>\n<p>count of unread messages somewhere over the message list instead of having indicators on the messages.</p>\n</blockquote>\n<p>I like how Slack solves that problem (Instagram too): There is a clear line which separates old from new. But it wouldn't work if we want to have a feature to mark some messages as unread. So are we about truly <strong>read/unread</strong> situation or we are in <strong>keep up with the new staff</strong> situation?</p>\n<p>Slack shows a big red NEW line separator, similar to how Zulip separates Today and Yesterday:  count of unread messages somewhere over the message list instead of having indicators on the messages.<br>\n<a href=\"/user_uploads/2/ca/ZWio-CvtUXnf7DckxfrWFgxD/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/ca/ZWio-CvtUXnf7DckxfrWFgxD/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/ca/ZWio-CvtUXnf7DckxfrWFgxD/image.png\"></a></div>",
        "id": 1304656,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1641404568
    },
    {
        "content": "<p>I don't think the Slack solution is gonna work for all Zulip views, since it's not always necessarily the case that there's a clear partition between read messages and unread messages (even before the mark-as-unread case that Vlad correctly alludes to).</p>",
        "id": 1304662,
        "sender_full_name": "Steve Howell",
        "timestamp": 1641404821
    },
    {
        "content": "<p>understand</p>",
        "id": 1304665,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1641404959
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"5140\">Aman Agrawal (amanagr)</span> <a href=\"#narrow/stream/101-design/topic/unread.20message.20indicators/near/1304653\">said</a>:</p>\n<blockquote>\n<p>Gmail is just not a good comparison here.</p>\n</blockquote>\n<p>I agree with that. In Gmail, I think most users go thought the messages in their inbox without referring to the labels at all. In Zulip, unread counts in the left sidebar are very helpful for deciding what to read.</p>",
        "id": 1304774,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1641416986
    },
    {
        "content": "<blockquote>\n<p>unread counts in the left sidebar are very helpful for deciding what to read</p>\n</blockquote>\n<p>Thank you for that clarification</p>",
        "id": 1304786,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1641417251
    },
    {
        "content": "<p>Yeah, I very frequently use the combination of the unread count and topic in the left sidebar to decide what to read, especially when I'm behind and trying to decide how to prioritize my time -- and we've heard from plenty of users that they do the same thing.  </p>\n<p>I think it's still an option to offer a setting for users who prefer to not see the numbers that would do something lighter (e.g. just bolding topics/stream names with unreads), and it's worth considering whether offering that is worth the maintenance tradeoffs that come with it.</p>",
        "id": 1304877,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1641423834
    }
]