[
    {
        "content": "<p>Currently when a user is in root domain and try to access /login or /signup they would be redirected to find accounts page. This is not the ideal workflow. Instead of this the users should be taken to a page that allows them to enter the subdomain of the organization and redirects the /login and /signup page of the organization. What should be the url of this page which allows users to jump to any organization by entering the subdomain?</p>\n<p><a href=\"user_uploads/2/9d/psLaqDkjTCORT8NETuMDIRID/enter-realm.gif\" target=\"_blank\" title=\"user_uploads/2/9d/psLaqDkjTCORT8NETuMDIRID/enter-realm.gif\">enter-realm.gif</a> </p>\n<div class=\"message_inline_image\"><a href=\"user_uploads/2/9d/psLaqDkjTCORT8NETuMDIRID/enter-realm.gif\" target=\"_blank\" title=\"enter-realm.gif\"><img data-src-fullsize=\"/thumbnail?url=user_uploads%2F2%2F9d%2FpsLaqDkjTCORT8NETuMDIRID%2Fenter-realm.gif&amp;size=full\" src=\"/thumbnail?url=user_uploads%2F2%2F9d%2FpsLaqDkjTCORT8NETuMDIRID%2Fenter-realm.gif&amp;size=thumbnail\"></a></div><p>The GIF uses /enter as the URL of the page.</p>",
        "id": 639396,
        "sender_full_name": "Vishnu KS",
        "timestamp": 1535446419
    },
    {
        "content": "<p>I totally agree. This is super confusing as a user. Find accounts makes no sense to someone without clearer explanation on the fact that zulip hosts some realms and they are sign-up only right now. Not sure if we plan on having any public facing test/demo realms ( perhaps separate from this one, or maybe the public facing aspects will be limited to some streams. I've seen that feature requested on here recently. ).</p>\n<p>I think just a bit more explanation around this and adding a \"Sign in\" button would be a good start. You could link to Find Accounts from page <span class=\"user-mention\" data-user-id=\"52\">@Vishnu Ks</span> has setup but it seems secondary.</p>",
        "id": 639442,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1535457461
    },
    {
        "content": "<p>Maybe <code>/accounts/go</code>?<br>\nAnd yeah, as a V2 this page can have something like \"Forgot your Zulip URL? Click here to get a reminder.\" that goes to our current <code>/accounts/find</code></p>",
        "id": 639551,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1535473921
    }
]