[
    {
        "content": "<p>Kicking off a separate thread regarding this:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/101-design/topic/Design.20for.20user.20group.20card.2E/near/1347870\">said</a>:</p>\n<blockquote>\n<p>I think that's probably a useful step, though I'll note that we do not intend for user groups to have long descriptions, so the screenshot is kinda misleading. In general I want to do a more holistic redesign of the user groups setting UI to perhaps be more similar to the two-panel \"Stream settings\" UI, so I don't want to necessarily go too deep into tweaking the current system.</p>\n<p>I guess in particular:</p>\n<ul>\n<li>We want to be able to browse user groups using filters etc. like our other table-based components.</li>\n<li>We want the set of members for user groups to be browsable like stream subscribers.</li>\n<li>We want to be able to support multiple screens worth of user group settings, such as a list of permissions the group has.</li>\n<li>We want to be able to browse subgroups.</li>\n</ul>\n</blockquote>",
        "id": 1347941,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647629863
    },
    {
        "content": "<p>The broader context is that in <a href=\"https://github.com/zulip/zulip/pull/19525\">#19525</a> we plan to make user groups much more powerful, and we'll need a UI for viewing and managing the new functionality.</p>",
        "id": 1347943,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647629937
    },
    {
        "content": "<p>A proposal is to make the groups management UI similar to the stream management UI, including:</p>\n<ul>\n<li>List of groups on the left, with two tabs (all groups, and groups to which the user belongs).</li>\n<li>Right-side panel for viewing and managing a specific group.</li>\n<li>Tabs within the right-side panel for the things <span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> mentioned above, i.e. something like \"General\", \"Personal\", \"Permissions\", and \"Subscribers\".</li>\n</ul>\n<p>I'll spend more time to hammer out the specifics after 5.0, but do folks think the general direction makes sense?</p>",
        "id": 1347950,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647630137
    },
    {
        "content": "<p>Without getting too much into the weeds of actual solutions, I 100% agree we can make this experience better, and as others have alluded to, we have other UI that we can emulate here.</p>",
        "id": 1347959,
        "sender_full_name": "Steve Howell",
        "timestamp": 1647630495
    }
]