[
    {
        "content": "<p>Hi folks! We have a \"Show user list on left sidebar in narrow windows\" display option, which puts the user list at the bottom of the left sidebar when the window is too narrow to display it on the right.</p>\n<p>I've been wondering for a while whether we should drop this option, because we have not been consistently testing it when modifying the left sidebar, and it doesn't feel to me like the added overhead of testing / debugging each time we make changes there is worth it for the value that it adds. (This option is broken on CZO at the moment because we didn't test it when adding the PMs section.)</p>\n<p>What do folks think about the idea of dropping support for it? Does anyone here use it (in this community or in other Zulip organizations), and if so, could you share what about it you like?</p>\n<p>With the addition of the new private messages section (<a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/private.20messages.20section.20.2320870\">#design &gt; private messages section #20870</a> ), it seems like we're addressing some of the need for that option, since users will be able to always see conversations (and presence status) for folks they talk to most frequently.</p>",
        "id": 1460450,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1667852930
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"20576\">@Cosmic Sound</span> FYI if you have any input in this.</p>",
        "id": 1460606,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1667862027
    },
    {
        "content": "<p>Not sure how is related to my issue.</p>",
        "id": 1460616,
        "sender_full_name": "Cosmic Sound",
        "timestamp": 1667863126
    },
    {
        "content": "<p>Since you reported the issue related to user list in the left sidebar, I thought you might have feedback here. No problem if you don't!</p>",
        "id": 1460619,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1667863658
    },
    {
        "content": "<p>Just to give some background, there are two situations that I can recall as motivating this option:</p>\n<ul>\n<li>You're in a small organization where <code>streams + users &lt; 25</code>, where it might feel nice to just have all of your items (users and streams) in one sidebar, because on a normal monitor, there's enough space to fit them all. One special case of this is where you're just using a single stream with up to a couple dozen users, where the left sidebar space might feel pretty empty.</li>\n<li>You are using Zulip in a vertical format wide screen monitor. In this situation, it's possible that there won't be enough width for both sidebars to be open, and you've got so much scrollable real estate in the left sidebar that you'd rather just have the users be reached by scrolling, rather than it being a panel you need to click to open/view.</li>\n</ul>",
        "id": 1461184,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1667936854
    },
    {
        "content": "<p>I've not tested this option with a vertical monitor in years, so I have no idea whether its current implementation is helpful for that second purpose effectively.</p>",
        "id": 1461185,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1667936927
    },
    {
        "content": "<p>I've wanted to remove this option for a long time, in that its definition of \"user list goes in left sidebar only in narrow windows\" is pretty weird; the ways to resolve that are to remove the option or to make it instead \"user list goes in left sidebar\".</p>",
        "id": 1461187,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1667937010
    },
    {
        "content": "<p>I don't think that the new design for private messages in the left sidebar exactly covers those two possible motivations for having the user list in the left sidebar; if you want to be able to see everyone in the organization and start a PM with them with a single click, that is really only possible with the right sidebar's UI.</p>",
        "id": 1461189,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1667937198
    },
    {
        "content": "<p>A user has suggested adding a \"New PM\" button to the section to help solve for the \"how do I send a PM?\" issue.</p>",
        "id": 1461230,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1667942771
    },
    {
        "content": "<p>I collected a bit of feedback on this in open communities (<a href=\"https://rust-lang.zulipchat.com/#narrow/stream/122653-zulip/topic/users.20in.20left.20sidebar.20option.20feedback\">here</a> and <a href=\"https://leanprover.zulipchat.com/#narrow/stream/236604-Zulip-meta/topic/users.20in.20left.20sidebar.20option.20feedback\">here</a>).</p>\n<p>One person commented that the buddy list is useful for starting PM threads, and maybe we want some kind of button in the PMs section to help with that.</p>\n<p>One person currently has the setting turned on, but doesn't really care if it goes away, so long as the alternative leaves just as much width for messages (which it does).</p>\n<p>Some users commented that our default solution to narrow windows works well for them.</p>",
        "id": 1461720,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668028090
    },
    {
        "content": "<p>I have filed <strong>Remove the \"Show user list on left sidebar in narrow windows\" display option</strong> <a href=\"https://github.com/zulip/zulip/pull/23517\">#23517</a>, marked a release goal. However, the plan is to keep around the data about who has selected the feature, so that it's possible to re-add it if we get strong demand from users.</p>",
        "id": 1461849,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1668039876
    },
    {
        "content": "<p>I think that's a good plan. I think we've fixed the major bugs that this had with <a class=\"stream-topic\" data-stream-id=\"101\" href=\"/#narrow/stream/101-design/topic/private.20messages.20section.20.2320870\">#design &gt; private messages section #20870</a>. It's still a messy UX with weirdly sized scrollable regions, but I think that's always been the case for this setting.</p>",
        "id": 1462084,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668060921
    },
    {
        "content": "<p>I noticed two issues tracked in GitHub that are related to the user/buddy list in the left sidebar. I wasn't sure if we wanted to close those out now that this feature/option has been removed?</p>\n<ul>\n<li><a href=\"https://github.com/zulip/zulip/pull/3916\">#3916</a>, \"Display left side userlist in narrows\" doesn't work with pinned streams</li>\n<li><a href=\"https://github.com/zulip/zulip/pull/6061\">#6061</a>, user list on left sidebar in narrow windows takes up majority of sidebar instead of streams</li>\n</ul>",
        "id": 1596503,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1687361901
    },
    {
        "content": "<p>If we've entirely removed the option, I'd close the issues as WONTFIX.</p>",
        "id": 1596504,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1687362180
    },
    {
        "content": "<p>Agreed, closed both of those, thanks!</p>",
        "id": 1599189,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1687835269
    }
]