[
    {
        "content": "<p>I am working on the issue <a href=\"https://github.com/zulip/zulip/pull/19090\">#19090</a> to improve users list admin page for mobile widths.<br>\nThe issue suggests to hide the <code>last active</code> column, but we would need to do something else too.<br>\n<a href=\"/user_uploads/2/3/zVZ-Rh1gAYpp2Pn5jHBV3JR7/Screenshot-from-2021-08-04-14-50-27.png\">rename-last-active.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/3/zVZ-Rh1gAYpp2Pn5jHBV3JR7/Screenshot-from-2021-08-04-14-50-27.png\" title=\"rename-last-active.png\"><img src=\"/user_uploads/2/3/zVZ-Rh1gAYpp2Pn5jHBV3JR7/Screenshot-from-2021-08-04-14-50-27.png\"></a></div><p>One thing is that instead of the two actions buttons, we can have something like three-dot menu which expands to give two options. Any other ideas?</p>",
        "id": 1243553,
        "sender_full_name": "Sahil Batra",
        "timestamp": 1628069570
    },
    {
        "content": "<p>The three-dot menu seems reasonable... I wouldn't spend a ton of time on this, since org settings on mobile web are not a highly visible area.</p>",
        "id": 1243735,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1628099090
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"10242\">@Sahil Batra</span> I'm not sure it's worth the implementation complexity of doing that sort of micro-optimization -- just removing \"last active\" makes it possible to read, if a bit annoying.  And switching to a 3-dots menu for mobile only will only save a few pixels.</p>\n<p>Realistically what someone is likely to do for more serious goals is just turn their phone sideways, which will work well.</p>",
        "id": 1256470,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1631839488
    },
    {
        "content": "<p>What I think would be reasonable to consider is if we want to just move to a 3-dots menu instead of those icons in all cases -- that might be cleaner design overall.</p>",
        "id": 1256471,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1631839548
    },
    {
        "content": "<p>The main downside is I guess the extra click to actually do things.  But I've never been super happy with the visuals of those colors Actions icons.</p>",
        "id": 1256472,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1631839581
    },
    {
        "content": "<p>I agree that that the icons look funky... But if we bury them under another click, we should think about the experience of bulk actions -- an extra click is a big pain point if you are trying to do something 20 times.</p>",
        "id": 1256704,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1631892682
    },
    {
        "content": "<p>Yeah, I agree with that concern as well.  Certainly I find the various Google admin products that do bury everything under a bonus click to be pretty annoying.</p>",
        "id": 1259414,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1632778344
    }
]