[
    {
        "content": "<p>Hi</p>\n<p>Sometimes I spend a couple of days without opening Zulip chat and there are tons of unread messages. I try to read a couple and dismiss the popup asking me to mark all as read. But when I get tired of reading, I just want to skip to the end and I have never found a button to do that, so I kept scrolling the messages. I have found the option to mark all messages as read on the left menu but I don't think is very intuitive. Wouldn't be better if that option was somewhere near the message area?</p>",
        "id": 824135,
        "sender_full_name": "Clara Dantas",
        "timestamp": 1583013729
    },
    {
        "content": "<p>Well, there are tradeoffs here.  You can scroll to the bottom of a message view or use the End key to do that for an individual view (which in the \"All messages\" view marks everything as read)</p>",
        "id": 824147,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1583020525
    },
    {
        "content": "<p>But we do need to be cautious about making it too easy to accidentally mark everything as read.</p>",
        "id": 824148,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1583020539
    },
    {
        "content": "<p>One thing we're likely to do very soon is a change similar to <a href=\"https://github.com/zulip/zulip/commit/d79a7a8c35bdfbe8dd776f8c0acb6069422d2d7c\" target=\"_blank\" title=\"https://github.com/zulip/zulip/commit/d79a7a8c35bdfbe8dd776f8c0acb6069422d2d7c\">d79a7a8c35bdfbe8dd776f8c0acb6069422d2d7c</a> replacing the modal for unread messages; I think that should be a fairly quick change for anyone interested, and will help a lot since users can just leave that notice up until they're ready to hit it.</p>",
        "id": 824149,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1583020588
    },
    {
        "content": "<p>yeah I was thinking in something like that actually. When I finish the issue I'm currently working on, if none still hasn't done this I could do it  :)<br>\nShould I open an issue for this?</p>",
        "id": 824163,
        "sender_full_name": "Clara Dantas",
        "timestamp": 1583023208
    }
]