[
    {
        "content": "<p>Hello Sir, hope you're doing good.</p>\n<p>I, Hitesh Khairwal, am a pre-final year undergraduate student at Indian Institute of Technology (IIT) Roorkee, India. I am interested in participating in GSoC '19, Visual Design project to improve user interaction and user experince of logged out pages.</p>\n<p>Spending this winter at Udacity, where I worked on 2 projects from scratch. From empathizing with users and stakeholders (Applying goal-oriented design, trying to be empathetic throughout, not using empathy as a step) to doing research and providing a solution (balanced functional and aesthetic value addition) which got live and taking feedback to iterate. Where I worked closely with front-end developers, customer service and sales team to make it functional.</p>\n<p>Last summer at ClearTax as a Product Design Intern, where I worked on a product in a lean UX environment where I focused on finding a solution to the problem while concentrating on my hypothesis, trying to validate them with directional research, reducing the waste produced during the design cycle and enhancing the UX and interface through multiple iterations. It went hand in hand with an Agile development framework. The learning experience from my last internship has helped me improve my process and approach towards problems.</p>\n<p>Being an active member of various groups in IIT Roorkee campus. I have experience in managing various design teams on a university level. As a member of Cognizance'18 (Cognizance is the annual tech fest of IIT Roorkee and Asia's second largest technical festival), I worked in the team and followed a certain procedure to create an Identity system and visual design work. This year I led the design team of Cognizance'19 with 20 designers. I know how important teamwork is to build anything and to achieve any goal, where different people with different perspectives put their ideas on a table and finally create something.</p>\n<p>I'm writing this message to express my interest to work with you, It would be a great help if you can guide me on this project. I'm highly motivated and enthusiastic to work on this project. I'm certain, this project seems like a great opportunity for me to learn a lot in the process, and given my skill-set and competencies, I believe I'll be able to contribute positively to the ongoing works at Zulip.</p>\n<p>I look forward to hearing from you</p>\n<p>Thank you</p>",
        "id": 728699,
        "sender_full_name": "Hitesh Khairwal",
        "timestamp": 1554481714
    },
    {
        "content": "<p>Hi Hitesh, thanks for writing in. Do you have samples of your work, e.g. from the activities mentioned above?</p>",
        "id": 728703,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1554483408
    },
    {
        "content": "<p>Hey, Sir!! Yes, I'm attaching my portfolio below where you can see some work with detailed directional research with final aesthetic user interfaces and other visual work. I'm really excited and working on potential solutions for logged out pages. It would be a great help if you can guide me on this project. </p>\n<p>Portfolio Link: <a href=\"https://drive.google.com/open?id=1ejVvoLJjQM1xtGgwhJ-Jh_yF5gHwiFTi\" target=\"_blank\" title=\"https://drive.google.com/open?id=1ejVvoLJjQM1xtGgwhJ-Jh_yF5gHwiFTi\">https://drive.google.com/open?id=1ejVvoLJjQM1xtGgwhJ-Jh_yF5gHwiFTi</a></p>",
        "id": 728871,
        "sender_full_name": "Hitesh Khairwal",
        "timestamp": 1554502906
    }
]