[
    {
        "content": "<p>In <a href=\"https://github.com/zulip/zulip/pull/21942\">#21942</a>, we implemented a change so that when a spectator logs in, their location within Zulip is preserved. However, we did not do this for users who <em>sign up</em> rather than logging in.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> 's <a href=\"https://github.com/zulip/zulip/pull/21942#issuecomment-1112495629\">comment</a> was that redirecting in case of sign-up would mean that the user wouldn't land on the Welcome Bot thread. However, I really think that we should still preserve the spectator's location in this situation, so that they can actually complete whatever action they wanted to do that caused them to click \"sign up\".</p>\n<p>Zulip is (we hope!) perfectly usable without reading Welcome Bot right away, and those messages will still be there (as unreads) for later reference.</p>\n<p>Thoughts? CC <span class=\"user-mention\" data-user-id=\"5140\">@Aman Agrawal (amanagr)</span></p>",
        "id": 1384302,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1653430484
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span> <a href=\"#narrow/stream/101-design/topic/web-public.20streams.20redirect/near/1384302\">said</a>:</p>\n<blockquote>\n<p>However, I really think that we should still preserve the spectator's location in this situation, so that they can actually complete whatever action they wanted to do that caused them to click \"sign up\".</p>\n</blockquote>\n<p>I agree. When I'm on some website and then I'm persuaded to make an account, I think of it as a pretty significant marker of the quality of the site whether it successfully preserves the context of what I was doing, or dumps me on the home page.</p>",
        "id": 1384317,
        "sender_full_name": "Greg Price",
        "timestamp": 1653432091
    },
    {
        "content": "<blockquote>\n<p>When I'm on some website and then I'm persuaded to make an account, I think of it as a pretty significant marker of the quality of the site whether it successfully preserves the context of what I was doing, or dumps me on the home page.</p>\n</blockquote>\n<p>I agree with that statement.</p>",
        "id": 1384402,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1653452329
    },
    {
        "content": "<blockquote>\n<p>I really think that we should still preserve the spectator's location in this situation, so that they can actually complete whatever action they wanted to do that caused them to click \"sign up\".</p>\n</blockquote>\n<p>Thinking more about it, it sounds reasonable to do.</p>",
        "id": 1384403,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1653452610
    },
    {
        "content": "<p>Ok, cool. <span class=\"user-mention\" data-user-id=\"5140\">@Aman Agrawal (amanagr)</span> would you be up for putting up a PR when you get a chance?</p>",
        "id": 1384411,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1653457335
    },
    {
        "content": "<p>Yes</p>",
        "id": 1384413,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1653457413
    },
    {
        "content": "<p>I opened <a href=\"https://github.com/zulip/zulip/pull/22151\">#22151</a> which does this for direct email signups. Working on external authentication methods. I will have to setup a production server and enable atleast google signup completely to work on it, right? Or is there is a simpler route?</p>",
        "id": 1386209,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1653913535
    }
]