[
    {
        "content": "<p>We've <a href=\"#narrow/stream/2-general/topic/onboarding.20diary.20.28Steve.29/near/1149760\">talked previously</a> about Welcome Bot's messages being too long. Let's talk about improvements! For context, here's the current message:</p>\n<blockquote>\n<p>Hello, and welcome to Zulip!</p>\n<p>This is a private message from me, Welcome Bot. Here are some tips to get you started:</p>\n<ul>\n<li>Download our <a href=\"/apps\">Desktop and mobile apps</a></li>\n<li>Customize your account and notifications on your <a href=\"#settings\">Settings page</a></li>\n<li>Type <code>?</code> to check out Zulip's keyboard shortcuts</li>\n</ul>\n<p>The most important shortcut is <code>r</code> to reply.</p>\n<p>Practice sending a few messages by replying to this conversation. If you're not into keyboards, that's okay too; clicking anywhere on this message will also do the trick!</p>\n</blockquote>\n<p>if you reply to that, it writes:</p>\n<blockquote>\n<p>Congratulations on your first reply! <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>\n<p>Feel free to continue using this space to practice your new messaging skills. Or, try clicking on some of the stream names to your left!</p>\n</blockquote>\n<p>I was impressed with how <a href=\"https://quill.chat\">Quill</a> does this — their messages look like <a href=\"/user_uploads/2/27/s_GSZEo38HFyOTi_zmokNe2l/0000-recent.png\">this</a>.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/27/s_GSZEo38HFyOTi_zmokNe2l/0000-recent.png\" title=\"this\"><img src=\"/user_uploads/2/27/s_GSZEo38HFyOTi_zmokNe2l/0000-recent.png\"></a></div><p>I think it's likely that the \"confirm your name\" makes people way more likely to actually reply to the Welcome Bot, which is a good way to get them used to sending messages. I think the technique of drip-feeding people tidbits of info with calls to action is pretty powerful.</p>\n<p>I also wonder if we should make a new private channel for each user with just Welcome Bot and the user, so we can get them used to topics. I could imagine having the welcome bot start new topics for different types of info, ask/teach the user to start a new topic, etc. Do folks think that's worth prototyping?</p>\n<p>Would love to hear people's thoughts on this :)</p>",
        "id": 1203320,
        "sender_full_name": "Wesley Aptekar-Cassels",
        "timestamp": 1623108943
    },
    {
        "content": "<p>Yeah, I really like the idea of providing something meaningful to actually reply about.</p>",
        "id": 1203349,
        "sender_full_name": "Greg Price",
        "timestamp": 1623109490
    },
    {
        "content": "<p>A private stream with Welcome Bot to demo topics in is interesting. One thing that might be quite tricky in order to get that to work well is that people's first idea of what's going on with streams and topics often isn't quite right… and then the key thing for a teacher to do is to identify what mental model the person has, and what they need to see in order to correct it. And that is probably tough to teach Welcome Bot to do.</p>",
        "id": 1203360,
        "sender_full_name": "Greg Price",
        "timestamp": 1623109875
    },
    {
        "content": "<p>Also, if it's actually a private stream, we risk polluting organizations with one private stream per user.</p>",
        "id": 1204547,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1623197674
    },
    {
        "content": "<p>Quill's onboarding dialog appears to be a copy of Slack's from a few years ago.</p>",
        "id": 1204549,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1623197728
    }
]