[
    {
        "content": "<p>In a different topic we saw how many icons might be exposed to different kinds of formatting/pasting, which is available inside compose box as a special syntax. Some suggested simplification look strange personally to me but for others might be \"lower barrier of entrance in Zulip\". <br>\nFor example pasting lists. I think its very easy to type <code>-</code> or <code>1.</code> in the message but there are users who would prefer UI for that (<a href=\"https://github.com/zulip/zulip/issues/20305\">issue</a>). I thought of a strategic way to address this problem with 2 different kinds of users. And I'm not asking to decide on that, but just want to share an idea.<br>\nThe preview icon could be a switch between <code>source code editing</code> and <code>WYSIWYG mode</code>. A user might switch that on for the first time and just leave it like this and keep composing messages there. Icons and hotkeys stay the same.</p>",
        "id": 1308990,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1642016072
    },
    {
        "content": "<p>I understand that there might be problems of switching between to editable modes, but depending on how you started a new message we could understand that if started in WYSIWYG mode a backtick symbols around a word should be escaped... or better we could catch those dynamically and force input of  \\`a...  to be <code>a...</code><br>\nI understand that this is a big and complex project but I would personally interested working on it as a developer</p>",
        "id": 1309001,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1642016377
    },
    {
        "content": "<blockquote>\n<p>The preview icon could be a switch between source code editing and WYSIWYG mode.</p>\n</blockquote>\n<p>I know we've discussed WYSIWYG compose editing before, but I had this same thought earlier this week and I don't think it's something we've talked about.</p>",
        "id": 1309140,
        "sender_full_name": "Yash RE",
        "timestamp": 1642022508
    },
    {
        "content": "<p>WYSIWYG editing is one of those features that often seems like a good idea but can be very challenging to make not bad in practice.  A big part of the challenge is just that there's a ton of details that one needs to get right -- all of us have used WYWIWYG experiences where it's impossible to make it look how you want it to or the thing you're typing is annoyingly included in the bold/link/whatever that was next to it in the body.</p>\n<p>This is a solvable problem -- and something we could introduce incrementally as an optional method that isn't the default while we shake out issues -- but it'd be a big investment and I don't think obviates the need to have a good compose experience that is not WYWIWYG for the many users who prefer that.  (Folks may remember Slack had probably their biggest incident of users complaining about their product direction when they changed their compose box to be WYWIWYG, and were forced by that pressure to provide a way to use the old experience).</p>",
        "id": 1309394,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1642029576
    },
    {
        "content": "<p>So I think it makes sense to invest our time into making Zulip's current compose box excellent before spending time on trying to add a WYWIWYG option, since they would directly compete for design/engineering effort.</p>",
        "id": 1309395,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1642029617
    },
    {
        "content": "<p>agree</p>",
        "id": 1309465,
        "sender_full_name": "Vlad Korobov",
        "timestamp": 1642034167
    },
    {
        "content": "<p>I'm not sure if I even want full wsiwyg because we support latex and a bunch of things where wsiwyg is extreme.... I would however, appreciate instant feedback with a couple of things.<br>\nI like what discord does:</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/ed/t4-0VWW5S8fSKp-n7ET7y3MT/130122-discord-wsiwyg.gif\"><img src=\"/user_uploads/2/ed/t4-0VWW5S8fSKp-n7ET7y3MT/130122-discord-wsiwyg.gif\"></a></div>",
        "id": 1309553,
        "sender_full_name": "Yash RE",
        "timestamp": 1642051762
    },
    {
        "content": "<p>How challenging would it be to implement a Discord-style to visually display some formatting while still showing the original markdown, as <span class=\"user-mention silent\" data-user-id=\"9808\">Yash RE</span> suggests? Have we discussed a technical design for this in the past?</p>",
        "id": 1309853,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642108146
    },
    {
        "content": "<p>As a side note, <span class=\"user-mention silent\" data-user-id=\"699\">Anders Kaseorg</span> has also pointed out in the past that being able to show formatting in the compose box would let us mark up the <code>&lt;time</code> widget text so that it's easier to read, e.g. &lt; time:<strong>2022-01-13</strong>T<strong>13:07:37</strong>-08:00&gt;.</p>",
        "id": 1309854,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642108160
    },
    {
        "content": "<p>I suspect someone has a syntax-highlighting Markdown editor component we can use, once we fix our Markdown syntax to be standards-compatible.</p>",
        "id": 1309861,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1642108415
    },
    {
        "content": "<blockquote>\n<p>once we fix our Markdown syntax to be standards-compatible.</p>\n</blockquote>\n<p>Is there an issue or set of issues for this?</p>",
        "id": 1309865,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642108528
    },
    {
        "content": "<p>No, that’s something we need to finish planning out.</p>",
        "id": 1309866,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1642108701
    },
    {
        "content": "<p>Here's my favorite of our previous threads about WYSIWYG editing:<br>\n<a href=\"#narrow/stream/6-frontend/topic/live.20preview.20within.20the.20compose.20box/near/874607\">https://chat.zulip.org/#narrow/stream/6-frontend/topic/live.20preview.20within.20the.20compose.20box/near/874607</a></p>\n<p>There's good discussion there about the UI possibilities, including that neat light-touch WYSIWYG that Discord does. Then the thread also goes into a conversation about the future of our Markdown syntax.</p>",
        "id": 1309921,
        "sender_full_name": "Greg Price",
        "timestamp": 1642112544
    },
    {
        "content": "<p>Here's another good bit of background on WYSIWYG editing:<br>\n<span class=\"user-mention silent\" data-user-id=\"17945\">Wesley Aptekar-Cassels</span> <a href=\"#narrow/stream/137-feedback/topic/WYSIWYG.20Composer.20Box/near/1209958\">said</a>:</p>\n<blockquote>\n<p>I definitely understand why people want a WYSIWYG editor. Some context here is that writing an editor is <a href=\"https://lord.io/text-editing-hates-you-too/\">extremely difficult</a>, and necessary to do WYSIWYG well. I know multiple people who have spent years working fulltime on text editors on the web, and exactly zero people who have successfully shipped something they're happy with.</p>\n<p>Even huge companies can't get this right: the Twitter webapp is a custom text editor, and it frequently messes up whitespace when people copy/paste, among many other problems.</p>\n<p>I highly recommend people read the article I linked above. WYSIWYG is extremely difficult to make.</p>\n</blockquote>\n<p>from a different thread which covers overlapping ground.</p>",
        "id": 1309949,
        "sender_full_name": "Greg Price",
        "timestamp": 1642113642
    }
]