[
    {
        "content": "<p>Hello, we have a server that was previously using email authentication, and are adding Microsoft LDAP. We are running 4.7 updated 11/6/2021. </p>\n<p>I'm run through the docs and go our settings to what I think they should be. <br>\nThe issues I'm seeing are:</p>\n<ol>\n<li>\n<p>Login page still requires email? </p>\n</li>\n<li>\n<p>The error log says it can't contact the ldap server. I've tested on the command line with ldapsearch and it gets to the server (had to resolve some TLS cert issue).  In our settings I have ldaps:// and a port :636, I've also tried it without ldap:// and no port. I don't think microsoft allows ldap without the security anymore though.<br>\nThe secrets file has the password for auth_ldap_bind_password = in it but it hasn't been encrypted yet (not sure how do do that or if that is whats supposed to happen).</p>\n</li>\n</ol>\n<p>Random other info: another app Moodle is able to use the same LDAP server using the same service account, and sees users and such fine using ldaps:// with port 636. <br>\nAny thoughts?</p>",
        "id": 1277695,
        "sender_full_name": "Tyson Parker",
        "timestamp": 1636231867
    },
    {
        "content": "<ol>\n<li>No the Login does work by the attribute you set in the LDAP config (I think uid by default).</li>\n<li>The secrets file will not be encrypted. I do not know why you get no contact to the ldap server. But this does mean that there is some issue with the LDAP \"url\" (AUTH_LDAP_SERVER_URI). I am using LDAPs so this should not be a problem.<br>\nMy configuration is <code>AUTH_LDAP_SERVER_URI = \"ldaps://ldap.example.com\"</code></li>\n</ol>",
        "id": 1277701,
        "sender_full_name": "Felix (strifel)",
        "timestamp": 1636232149
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"15808\">@Felix (strifel)</span> thank you for your response. The login page still says email so wasn't sure if this changable to avoid confusion by users.</p>\n<p>Are you using microsoft ldap? The default for MS is samaccountname, which I've updated in our config. </p>\n<p>When I ssh into the box and use the ldapsearch cli I connect ok after fixing a cert issue. Is there a similiar thing I need to do inside zulip to make it ignore or acknowledge a specific cert?</p>",
        "id": 1277980,
        "sender_full_name": "Tyson Parker",
        "timestamp": 1636387180
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"18622\">@Tyson Parker</span> </p>\n<p>I think you need to disable standard email login to have the label disappear</p>\n<p>No I am using OpenLDAP, so I do not know much about Active Directory.</p>\n<p>Zulip would have to know the correct certificate to connect to LDAP. I would think it uses the ones out of the systems certificate chain, but I do not know much about that, either</p>",
        "id": 1278022,
        "sender_full_name": "Felix (strifel)",
        "timestamp": 1636393280
    },
    {
        "content": "<p>Thanks Felix. I've updated the topic name to include windows LDAP. We had a linux based LDAP years ago but had other issues and switched to windows to correct, but now we have new windows issues. Can't seam to Win all the time here. lol</p>",
        "id": 1278105,
        "sender_full_name": "Tyson Parker",
        "timestamp": 1636402515
    },
    {
        "content": "<p>Last error regarding ldap in the error.log is <br>\nldap.SERVER_DOWN: {'result': -1, 'desc': \"Can't contact LDAP server\", 'ctrls': [], 'info': '(unknown error code)'}</p>",
        "id": 1278164,
        "sender_full_name": "Tyson Parker",
        "timestamp": 1636405470
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"18622\">@Tyson Parker</span> I'd make sure your firewall isn't blocking access to your LDAP server, and go through our <a href=\"https://zulip.readthedocs.io/en/latest/production/authentication-methods.html#troubleshooting\">LDAP troubleshooting guide</a> which I think recommends to <code>query_ldap</code> tool for debugging this sort of thing.</p>",
        "id": 1278170,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1636405676
    },
    {
        "content": "<p>Thanks Tim, running through the ldap troubleshooting you linked.</p>",
        "id": 1278180,
        "sender_full_name": "Tyson Parker",
        "timestamp": 1636406204
    },
    {
        "content": "<p>Alright troubleshooting FTW!<br>\nWas missing <br>\nLDAP_APPEND_DOMAIN = \"<a href=\"http://companyname.org\">companyname.org</a>\"<br>\nLDAP_EMAIL_ATTR = \"mail\"<br>\nAUTH_LDAP_USERNAME_ATTR = \"sAMAccountName\"</p>",
        "id": 1278190,
        "sender_full_name": "Tyson Parker",
        "timestamp": 1636408144
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"18622\">Tyson Parker</span> has marked this topic as resolved.</p>",
        "id": 1278191,
        "sender_full_name": "Notification Bot",
        "timestamp": 1636408166
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24093\">@JackBauer78</span> This was the thread where I had similar issues, and sorted it out with Sam then switched to CN for final use.</p>",
        "id": 1375527,
        "sender_full_name": "Tyson Parker",
        "timestamp": 1651180702
    }
]