[
    {
        "content": "<p>I'm wondering if there's some way to make users moderators of a specific stream, instead of moderators of the entire organization.</p>\n<p>We went live using Zulip in production yesterday, and I've rebuilt all of my tools (webhooks and programs that generated emails) that used to put \"stuff\" into our previous chat software to put \"stuff\" into Zulip instead, and I've noticed that I as the admin user can mark things as resolved, and it's been useful for me (server outage? resolved.  help request? resolved) and I'm wondering if I can give others the ability to do that \"safely\".</p>\n<p>It would be neat if I was able to make users moderators of specific streams (can I do this and am just missing it?) so they can mark topics as resolved in that stream.  For example, our marketing team has a stream, it's private to just the marketing team, things that people want posted on social media or whatever go into it from a webhook, and they want to be able to mark stuff as \"complete\" without typing \"I took care of posting this on service X\"</p>",
        "id": 1617584,
        "sender_full_name": "Steve",
        "timestamp": 1690579753
    },
    {
        "content": "<p>Hi Steve -- if the \"Mark as resolved\" functionality is what your users need, they get that once their accounts reach a certain age. New members do not get that by default, and since you just went live, that might be the issue. See <a href=\"https://zulip.com/help/restrict-permissions-of-new-members#restrict-permissions-of-new-members\">https://zulip.com/help/restrict-permissions-of-new-members#restrict-permissions-of-new-members</a> for changing the duration of that waiting period.</p>",
        "id": 1617598,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1690580629
    },
    {
        "content": "<p>See also <a href=\"https://github.com/zulip/zulip/pull/19525\">#19525</a>, which is ongoing work.</p>",
        "id": 1617600,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1690580664
    },
    {
        "content": "<p>I believe there is a way to manually promote new members to full members, but I can't seem to find docs for that, so I might either be mistaken or ignorant--hopefully someone else can chime in here.</p>",
        "id": 1617601,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1690580666
    },
    {
        "content": "<p>I don't know a way to skip the waiting period explicitly.</p>",
        "id": 1617603,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1690580712
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"26369\">@Karl Stolley</span> and <span class=\"user-mention\" data-user-id=\"12178\">@Alex Vandiver</span> , I had that set to \"None\" thinking they'd instantly become full members (or make member == full member) so I've changed it to one day.  Have a great weekend.</p>",
        "id": 1617694,
        "sender_full_name": "Steve",
        "timestamp": 1690587317
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"27440\">Steve</span> has marked this topic as resolved.</p>",
        "id": 1617695,
        "sender_full_name": "Notification Bot",
        "timestamp": 1690587321
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"27440\">Steve</span> has marked this topic as unresolved.</p>",
        "id": 1618458,
        "sender_full_name": "Notification Bot",
        "timestamp": 1690895246
    },
    {
        "content": "<p>OK, probably bad form to come back to a topic that I myself marked as resolved, but, maybe because my users are LDAP users and are \"never created\" or \"never signup\", it seems that I'm not having people grow up into full users.</p>\n<p>The default setting was 3 days I think, and I had changed it down to one day last week on Friday, but all of my users are still \"Member\" instead of \"Full Member\", and can't see the resolve button unless I promote them to a higher user permission such as \"Moderator\"</p>\n<p>Is there maybe some LDAP attribute they need to tell it how \"old\" their account is?</p>",
        "id": 1618459,
        "sender_full_name": "Steve",
        "timestamp": 1690895567
    },
    {
        "content": "<p>Users will still have \"Member\" as their role. There's no visual way to note whether a user is a new member or a full member. Other than looking at their joined date in their profile and comparing that to the waiting period time.</p>\n<p>Could it have to do with the organization settings for editing topics? <a href=\"https://zulip.com/help/restrict-moving-messages\">https://zulip.com/help/restrict-moving-messages</a></p>\n<p>There's both a setting for who can edit topics and for how long they can edit topics. The time limit can be set to \"Any time\", which will never limit changing / resolving the topic.</p>",
        "id": 1618464,
        "sender_full_name": "Lauryn Menard",
        "timestamp": 1690896497
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"21836\">@Lauryn Menard</span> !  It was the \"Who can move messages to another topic\" permission, which I changed from \"Admins and moderators\" to \"Admins, moderators and members\", I wouldn't have guessed that's what was happening, but now that I think about it the topic does seem to change from \"topic\" to \"<span aria-label=\"check mark\" class=\"emoji emoji-2714\" role=\"img\" title=\"check mark\">:check_mark:</span> topic\", and I assumed the <span aria-label=\"check mark\" class=\"emoji emoji-2714\" role=\"img\" title=\"check mark\">:check_mark:</span> was stored elsewhere with a separate database query asking \"topic resolved, yes / no?\" and then prepending the check to the topic cosmetically.</p>",
        "id": 1618475,
        "sender_full_name": "Steve",
        "timestamp": 1690899345
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"27440\">Steve</span> has marked this topic as resolved.</p>",
        "id": 1618476,
        "sender_full_name": "Notification Bot",
        "timestamp": 1690899407
    }
]