[
    {
        "content": "<p>Would like to reset a zulip realm to only the configuration without the users. I tried to delete_users -a which deleted everyone but now they are all deactivated users. I don't want to rebuild all the streams and other configuration. </p>\n<p>Story/Goal:<br>\nEach semester want to create new zulip instance with new students but same streams/configuration from last semester.<br>\nHow I was going to do this: clear out the old realm users (after migrating it to an alumni realm/server- already done), export and import it into the new realm for the new semester with the previous semesters settings/streams. </p>\n<p>Is there another way to accomplish this?</p>",
        "id": 1392492,
        "sender_full_name": "Tyson Parker",
        "timestamp": 1655227350
    },
    {
        "content": "<p>Hmm, not sure, the best way I can think of would be  to just set up a fresh org with the desired starting configuration, export it and keep the export data - and then it can be used to bootstrap each new semester in the future. Although that may have some issue with upgrading the server, since the old export can become incompatible with new server versions. But it can be worked around by</p>\n<ol>\n<li>Importing the org on the original Zulip version</li>\n<li>Upgrade Zulip server</li>\n<li>Export the org</li>\n</ol>\n<p>Resulting in export data with the right, newest format.</p>",
        "id": 1392523,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1655236248
    },
    {
        "content": "<p>Someone may have a better idea</p>",
        "id": 1392524,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1655236261
    },
    {
        "content": "<p>It <strong>might</strong> be possible to do this manually by <code>.delete()</code>ing <code>UserProfile</code> objects directly, but thinking about how to do this with confidence that it won't break something seems harder than the export way</p>",
        "id": 1392525,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1655236333
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"18622\">Tyson Parker</span> has marked this topic as resolved.</p>",
        "id": 1392783,
        "sender_full_name": "Notification Bot",
        "timestamp": 1655317211
    },
    {
        "content": "<p>I think it might be useful to have an integration bot that can do this, don't know if the bot have access to deleting users, etc</p>",
        "id": 1393791,
        "sender_full_name": "Rafid Aslam",
        "timestamp": 1655691606
    }
]