[
    {
        "content": "<p>Hi! Is there a preferred way of bulk adding users that are managed in Active Directory, but haven't signed in to Zulip yet?<br>\nWe would like to add a batch of users and subscribe them to specific streams before they sign in for the first time. According to <a href=\"https://github.com/zulip/zulip/issues/12457\">this GitHub issue</a>, one way would be to create them with a dummy password and perform any management actions. <code>manage.py sync_ldap_user_data</code> only seems to update existing users, but not create any new ones. Is there a better/more convenient way to add users that haven't yet signed in?</p>",
        "id": 1430732,
        "sender_full_name": "Carl Julius Gödecken",
        "timestamp": 1662480017
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24697\">@Carl Julius Gödecken</span> Hmm, no I don't think there's any good built-in way right now. Thanks for the reminder of the github issue though, i'll try to research it a bit further - but  i think it may not be that easy to implement since it seems like it'll require being able to list and iterate over all the user entries in the directory and I'm not sure if <code>django-auth-ldap</code> that we rely on supports that (since it's intended as an authentication mechanism rather than a toolkit for making queries...).</p>\n<p>Though I imagine that with some scripting,  if you could in your own  way fetch the  list of user emails from ldap you could then run the <code>manage.py create_user</code> command in a loop to create these users.</p>",
        "id": 1430765,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1662484359
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24697\">@Carl Julius Gödecken</span> one option you can use is sending users customized invitation links to set the set of initial stream subscriptions for them.</p>",
        "id": 1430883,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1662491788
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"10349\">@Mateusz Mandera</span> Thank you! I'll go with the script then, the GitHub thread also includes a link to a gist that iterates over all users in AD.</p>",
        "id": 1431233,
        "sender_full_name": "Carl Julius Gödecken",
        "timestamp": 1662528328
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> Thanks for your suggestions as well! We'll go with the bulk user creation since that seems simpler (we're creating users and streams for a university program where users won't have access to their email before starting).</p>",
        "id": 1431235,
        "sender_full_name": "Carl Julius Gödecken",
        "timestamp": 1662530756
    }
]