[
    {
        "content": "<p>i was looking through the docs but couldnt find anything related to adding / removing users to a stream via rest api.</p>\n<p>My use case would be an e-commerce site where someone either purchases a product or subscribes to a different product and will then be added to a certain stream.. if the subscription runs out, it will be removed from the stream.. All that should be done automatically.</p>\n<p>the website runs on rails, i found a way to talk to the zulip api but havent found any suitable endpoint i could talk to to achieve the desired behavior</p>\n<p>is there some way to do that?</p>",
        "id": 1238708,
        "sender_full_name": "Andreas",
        "timestamp": 1627235315
    },
    {
        "content": "<p><a href=\"https://zulip.com/api/subscribe\">https://zulip.com/api/subscribe</a></p>",
        "id": 1238711,
        "sender_full_name": "Felix (strifel)",
        "timestamp": 1627237921
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"20964\">@Andreas</span> just doing a mention to make sure you saw that.  Before resolving this topic, I'd love to hear any thoughts on what we could improve in the documentation to make this easier to find.</p>",
        "id": 1238773,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1627252907
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"15808\">@Felix (strifel)</span> yeah, i saw that, <del>but if i understood that correctly it lets only ME subscribe to it..(?)</del></p>\n<p>strike that, i totally overlooked the <code>principals</code> property.. i blame the time of day</p>\n<p>thanks a lot!</p>\n<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>  i think your docs are superb, actually.. had no trouble finding it and they have just the right verbosity. the issue processing it was a <code>layer 8</code> problem</p>",
        "id": 1238846,
        "sender_full_name": "Andreas",
        "timestamp": 1627280381
    },
    {
        "content": "<p>OK, thanks for the feedback! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 1238916,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1627314448
    }
]