[
    {
        "content": "<p>Noticed a really useful bot here, called \"Topic Bridge Bot\" which links two threads where one of the threads is mentioned in another. I was wondering if there's any way we could use something similar for self-hosted installations? </p>\n<p>Any pointers on how to do this, or if the bot itself is documented somewhere? Appreciate the help.</p>",
        "id": 1637923,
        "sender_full_name": "Siddhartha Golu",
        "timestamp": 1694417476
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"22333\">@Brijmohan Siyag</span> is the code for that bot available somewhere? It would be great to include it in the <code>python-zulip-api</code> repository so folks who want it can use it.</p>",
        "id": 1638279,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1694456130
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"25688\">@Siddhartha Golu</span> I'd also be curious to hear more about your thoughts on it; the feature is the kind of thing that we could build as a native feature in Zulip (probably controlled by a setting, since I'm not sure everyone would want it).</p>",
        "id": 1638280,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1694456158
    },
    {
        "content": "<p>Oh, having it be a native feature would be wonderful. I'll expand on my use-case a bit more:</p>\n<p>There are two separate streams for customer orders - Stream A where by default every information related to an order comes, and Stream B where we're tracking if there's a complaint for an order. Stream B would be a subset of Stream A. Now whenever a complaint comes, we add a message in Stream A saying Order 1 got a complaint and create a new topic in Stream B. However, there's no direct correlation b/w the two topics and we need to manually crosspost in the two topics to establish a link.</p>\n<p>Call it bidirectional linking if you will. This sort of linking would be beneficial in cases where we don't want to completely move the messages from one topic to another, and still keep them related.</p>",
        "id": 1638648,
        "sender_full_name": "Siddhartha Golu",
        "timestamp": 1694493402
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"25688\">@Siddhartha Golu</span> ok, so in that case you potentially would want it to be something you can turn on for specific streams, but not have on everywhere? Or would you be fine with it being something that just happens everywhere by default like the bot's current mode here?</p>",
        "id": 1638925,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1694538742
    },
    {
        "content": "<p>I think default works. The bot will be used primarily in cases where there's been a digression in the discourse, or where there's some linkage between two topics - both the cases would benefit from having some way to go from one topic to another.</p>\n<p>Github issues mention is a good example of this.</p>",
        "id": 1638951,
        "sender_full_name": "Siddhartha Golu",
        "timestamp": 1694542267
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/31-production-help/topic/add.20.22topic.20bridge.20bot.22.20in.20self-hosted.20installations/near/1638279\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"22333\">Brijmohan Siyag</span> is the code for that bot available somewhere? It would be great to include it in the <code>python-zulip-api</code> repository so folks who want it can use it.</p>\n</blockquote>\n<p>It is available <a href=\"https://github.com/brijsiyag/zulip-api-examples/blob/main/topic_links.py\">here</a>. You can modify it as per your need.<br>\nI will create a PR by saturday on the <code>python-zulip-api</code> after doing some refactoring.</p>",
        "id": 1639155,
        "sender_full_name": "Brijmohan Siyag",
        "timestamp": 1694554921
    }
]