[
    {
        "content": "<p>Even as admin, I cannot add subscribers to private streams I'm not myself subscribed to. I can remove everyone, but cannot add anyone. IMO this is inconsistent behaviour, especially for admin accounts, which should have full control over every stream or none at all.</p>",
        "id": 958208,
        "sender_full_name": "Christoph",
        "timestamp": 1595879799
    },
    {
        "content": "<p>This is consistent behavior, with the rule \"Administrators cannot access private message or private stream content unless an existing subscriber adds them\".  </p>\n<p>We are considering adding a feature to allow \"Organization owners\", a new concept in 3.0, to change the rules for how private streams work; since there's definitely organizations for whom that preference doesn't make sense.</p>",
        "id": 958218,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595880128
    },
    {
        "content": "<p>Okay, thank you for explaining the reasoning behind this decision, I get it now. Nevertheless, it does not really make sense to give admins the permission to remove subscribers from streams they're [the admins] not subscribed to.</p>",
        "id": 959854,
        "sender_full_name": "Christoph",
        "timestamp": 1595946896
    },
    {
        "content": "<blockquote>\n<p>it does not really make sense to give admins the permission to remove subscribers from streams they're [the admins] not subscribed to.</p>\n</blockquote>\n<p>Agreed, I don't think we should allow that under the current model, though it doesn't seem  super harmful</p>",
        "id": 960009,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1595956259
    },
    {
        "content": "<p>The plan here, for context, is to add a \"Stream admin\" role that can help fill in the gaps here; that will definitely be in 4.0.</p>",
        "id": 960157,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595959098
    },
    {
        "content": "<p>(There's an open PR we'll be starting to integrate any day now)</p>",
        "id": 960158,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595959107
    },
    {
        "content": "<p>Thank you, that sounds great!</p>",
        "id": 964405,
        "sender_full_name": "Christoph",
        "timestamp": 1596106209
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/31-production-help/topic/adding.20subscribers.20to.20private.20streams/near/960157\">said</a>:</p>\n<blockquote>\n<p>The plan here, for context, is to add a \"Stream admin\" role that can help fill in the gaps here; that will definitely be in 4.0.</p>\n</blockquote>\n<p>Hi,</p>\n<p>just to follow up: we're running Zulip 5.5 and there is no role \"stream admin\" yet. Is this supposed to be a global role like \"Moderator\" or \"Administrator\"? IMO the most logical way would be to implement this on a per-stream basis, so no one is a Stream Admin for more then their own streams. But as of version 5.5 creators of streams cannot  unsubscribe people from their own streams unfortunately...</p>",
        "id": 1408736,
        "sender_full_name": "Christoph",
        "timestamp": 1658490975
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16782\">@Christoph</span> we ended up moving away from the original stream administrator plan (which was going to be per-stream) in favor of using user groups. You can follow the work here: <a href=\"https://github.com/zulip/zulip/issues/19525\">https://github.com/zulip/zulip/issues/19525</a></p>",
        "id": 1408861,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1658511896
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>  thank you, I did not realise this idea had been overhauled in the meantime.</p>",
        "id": 1409561,
        "sender_full_name": "Christoph",
        "timestamp": 1658672602
    }
]