[
    {
        "content": "<p>Hi! I'm running zulip on a virtual private server and want to add a second organization (I don't know how to check the server version, but I updated to master on November 14, so it's not ancient). From the documentation I can see more or less how to do it, but before starting I want to write out the steps here. I hope someone knowledgeable will point out if I got something wrong, or fill in missing details.</p>\n<p><a href=\"https://zulip.readthedocs.io/en/latest/production/multiple-organizations.html#the-root-domain\">Here</a> it says </p>\n<div class=\"codehilite\"><pre><span></span><code>You can mix having an organization on the root domain and some others on subdomains (e.g. subdivision.zulip.example.com),\nbut this only works well if there are no users in common between the two organizations, because the auth cookies for the root\ndomain are visible to the subdomain (so it’s not possible for a single browser/client to be logged into both). So we don’t\nrecommend that configuration.\n</code></pre></div>\n<p>I want to have overlapping users, so I have to move the existing organization to a subdomain first.  It says <a href=\"https://zulip.com/help/change-organization-url#self-hosting\">here</a> how that works:</p>\n<div class=\"codehilite\"><pre><span></span><code>If you&#39;re self-hosting, you can change the root domain of your server by changing the EXTERNAL_HOST setting. If you&#39;re hosting\nmultiple organizations and want to change the subdomain for one of them, you can use\ndo_change_realm_subdomain(realm, &quot;new_subdomain&quot;) in a management shell.\n</code></pre></div>\n<p>Is that the right way to do it? Strictly speaking I don't want to \"change\" the subdomain, but move the only existing organization from root to sub.</p>\n<p>Assuming that's the correct way, is it enough to tell existing users to update their URLs after that? Isn't there some certificate registered externally that is bound to the URL? I thought I remembered something like that from the install process, but maybe I got it wrong.</p>\n<p>Assuming I successfully moved the existing organization to a subdomain with the previous steps, the next step is to create a new organization on another subdomain. This is described <a href=\"https://zulip.readthedocs.io/en/latest/production/multiple-organizations.html\">here</a>, the relevant steps seem to be the following:</p>\n<div class=\"codehilite\"><pre><span></span><code>* Make sure you have SSL certificates for all of the subdomains you’re going to use. If you’re using our Let’s\nEncrypt instructions, it’s easy to just specify multiple subdomains in your certificate request.\n\n* If necessary, modify your nginx configuration to use your new certificates.\n\n* Use ./manage.py generate_realm_creation_link again to create your new organization. Review the install\ninstructions if you need a refresher on how this works.\n</code></pre></div>\n<p>OK so it seems like I have to deal with certificates after all. So do I have to request certificates for both subdomains I'm creating in the process? How do I do that using LetsEncrypt/Certbot ? In the <a href=\"https://zulip.readthedocs.io/en/latest/production/ssl-certificates.html\">documentation page</a> I can only see how to \"enable automation\".</p>\n<p>The second step says to modify nginx configuration if necessary. I don't know what that means. Will it be necessary?</p>\n<p>Thanks a lot in advance!</p>",
        "id": 1121230,
        "sender_full_name": "Jonas F",
        "timestamp": 1613743025
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"17356\">@Jonas F</span> yes, that is the correct way to move from the root domain to a subdomain.</p>",
        "id": 1121404,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1613757376
    },
    {
        "content": "<p>If you use <code>scripts/setup/setup-certbot</code> to get Certbot certs, you can pass multiple domains and it'll get certificates for all of them.</p>",
        "id": 1121406,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1613757442
    },
    {
        "content": "<p>(Wildcart certs are more of a pain and not supported by that script, I think, but also not necessary if you just need 2)</p>",
        "id": 1121407,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1613757451
    },
    {
        "content": "<p>Thanks! I'll give it a try and come back if I get stuck.</p>",
        "id": 1121455,
        "sender_full_name": "Jonas F",
        "timestamp": 1613760851
    },
    {
        "content": "<p>Am I supposed to get the certificates for the subdomain that I want to move the organization to before or after doing <code>do_change_realm_subdomain(realm, \"new_subdomain\")</code>? I just tried to get the certificate first and it didn't work. Specifically I did <code>setup-certbot --email=EMAIL subdomain.xxx-xxx-xx-xxx.hosting-provider-rdns.com</code>, where <code>xxx-xx-xxx-xxx.hosting-provider-rdns.com</code> is the url under which we currently access our zulip server, and <code>xxx-xxx-xx-xxx</code> the ip-address (with fields the 4 fiels in reverse order for some reason). The <code>setup-certbot</code> command gives the error message</p>\n<div class=\"codehilite\"><pre><span></span><code>Challenge failed for domain subdomain.xxx-xx-xxx-xxx.hosting-provider-rdns.com\nhttp-01 challenge for subdomain.xxx-xx-xxx-xxx.hosting-provider-rdns.com\nCleaning up challenges\nSome challenges have failed.\n\nIMPORTANT NOTES:\n - The following errors were reported by the server:\n\n   Domain: subdomain.xxx-xx-xxx-xxx.hosting-provider-rdns.com\n   Type:   dns\n   Detail: DNS problem: NXDOMAIN looking up A for\n  subdomain.xxx-xx-xxx-xxx.hosting-provider-rdns.com - check that a DNS record\n   exists for this domain\n</code></pre></div>\n<p>Is the problem maybe that the original URL is already a subdomain? Would I have to get my own domain-name instead of using the autogenerated URL from the hosting provider? </p>\n<p>If it's relevant, doing just <code>setup-certbot --email=EMAIL xxx-xxx-xx-xxx.hosting-provider-rdns.com</code> without the subdomain prefix results in the warning <code>You have an existing certificate that has exactly the same domains or certificate name you requested and isn't close to expiry.</code>.</p>",
        "id": 1121517,
        "sender_full_name": "Jonas F",
        "timestamp": 1613775085
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"17356\">@Jonas F</span> this is purely a DNS configuration issue -- the state of the Zulip server's configuration isn't relevant to whether Certbot will issue a certificate or not.</p>",
        "id": 1122543,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1614037778
    },
    {
        "content": "<p>(Zulip's <code>nginx</code> configuration, which is what integrates with Certbot, doesn't interact with what organizations are configured in the database).</p>",
        "id": 1122544,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1614037807
    },
    {
        "content": "<p>Thanks but what does that mean for me? Do I have to change something in the configuartion console of the hosting provider? Do I have to get my own domain name? I know that I can reach the server under the url <code>xxx-xxx-xx-xxx.hosting-provider-rdns.com</code>, so something with DNS seems to work.</p>\n<p>Sorry for the confused question, any help is highly appreciated.</p>",
        "id": 1122550,
        "sender_full_name": "Jonas F",
        "timestamp": 1614038445
    },
    {
        "content": "<p>You likely need to contact your hosting provider and/or use their panel to configure the subdomain to point to your server in DNS.</p>",
        "id": 1122555,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1614039009
    },
    {
        "content": "<p>Without configuring it explicitly, nothing would cause <code>subdomain.example.com</code> to exist if you've only configured <code>example.com</code> previously.</p>",
        "id": 1122557,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1614039045
    },
    {
        "content": "<p>I see, thanks again!</p>",
        "id": 1122577,
        "sender_full_name": "Jonas F",
        "timestamp": 1614041191
    }
]