[
    {
        "content": "<p>Hi, everyone! Pls, can someone help with my last question in the link below?</p>\n<p><a href=\"https://github.com/zulip/zulip/issues/26084\">https://github.com/zulip/zulip/issues/26084</a></p>\n<p>Thanks</p>",
        "id": 1601832,
        "sender_full_name": "Flávio Zarur Lucarelli",
        "timestamp": 1688132402
    },
    {
        "content": "<p>friends?</p>",
        "id": 1602958,
        "sender_full_name": "Flávio Zarur Lucarelli",
        "timestamp": 1688397062
    },
    {
        "content": "<p>Hi Flávio -- Your question is whether alerts can be set to certain defaults on an organization basis. I don't believe that is possible, but let's see if others chime in.</p>\n<p>For future reference, you're likely to get better responses if you choose a better topic name and actually include your question inline, rather than linking out.</p>",
        "id": 1602959,
        "sender_full_name": "Karl Stolley",
        "timestamp": 1688397364
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"26348\">@Flávio Zarur Lucarelli</span>: There's no way to do this currently.  You can see some previous related discussions at <a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/IDEA.3A.20force.20notification\">#feedback &gt; IDEA: force notification</a> and <a class=\"stream-topic\" data-stream-id=\"137\" href=\"/#narrow/stream/137-feedback/topic/FR.20-.20Organization.20Notification.20Enforcement\">#feedback &gt; FR - Organization Notification Enforcement</a>.</p>",
        "id": 1603024,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1688405108
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 1603137,
        "sender_full_name": "Flávio Zarur Lucarelli",
        "timestamp": 1688415740
    },
    {
        "content": "<p>So Id have to enable it in each user manually? All I wanted is to be able to call someone's attention. Sometimes people are not in focus on zulip and I need to ring them.</p>",
        "id": 1603139,
        "sender_full_name": "Flávio Zarur Lucarelli",
        "timestamp": 1688415815
    },
    {
        "content": "<p>If you need to get their attention, you should @ them.  By default, this will pop up a desktop notification and a push notification to their mobile device, as well as an email to them.  But if they have decided that they don't want all of those, they can have turned any of those notification forms off -- because that's their preference.  If you want to override their preferences, you will need to tell them to change them, or log in as them and set them yourself.</p>",
        "id": 1603144,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1688416239
    },
    {
        "content": "<p>Hi, friend. But many folks don't receive email notifications. I myself disable them, as I find it a bit annoying, many emails...</p>\n<p>One quick question, inside settings / Notifications, can I have a different sound for message sent versus mentions?</p>\n<p>Thanks and have a great weekend.</p>",
        "id": 1609917,
        "sender_full_name": "Flávio Zarur Lucarelli",
        "timestamp": 1689346872
    },
    {
        "content": "<p>If you find even the emails annoying, think about how annoying it would be for someone to force a pop-up notification anytime they wanted!  I think you're making a compelling case for why we don't have a way to force a notification. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>\n<p>Sending a message doesn't make a notification sound, so I'm a bit confused by your question.</p>",
        "id": 1609934,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1689349792
    },
    {
        "content": "<p>Hey, friend</p>\n<p>How are you? I understand. All msgs I received I hear a sound, aame as notifications... knock knock sound.</p>\n<p>The thing is, as a manager, I wanted to be able to call attention on someone. The other day I had to talk to someone and if I had a way to make a small alert sound, different from the sound when a new message comes in, it wouldve helped. I tried to call the person, who had his phone on silent...</p>\n<p>So, as  a managed, I could desire that, for a certain user, plausible feature imho. a different alert sound to ring/call someone.</p>\n<p>This is the alert I listen when I receive new msgs or mention someone.</p>\n<p><a href=\"/user_uploads/2/6b/vkVUb74PCkpIS6fIz1qZ8q7m/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/6b/vkVUb74PCkpIS6fIz1qZ8q7m/image.png\" title=\"image.png\"><img src=\"/user_uploads/2/6b/vkVUb74PCkpIS6fIz1qZ8q7m/image.png\"></a></div><p>So, if I could have a different alert to call someone's attention, it would be neat, but I understand, perhaps there's not much demand for that, right?</p>\n<p>Thanks and have a great weekend.</p>",
        "id": 1619852,
        "sender_full_name": "Flávio Zarur Lucarelli",
        "timestamp": 1691173143
    },
    {
        "content": "<p>Dear <span class=\"user-mention\" data-user-id=\"12178\">@Alex Vandiver</span> How are you? Can you pls give me a final comment on what I replied to you? Thanks and have a great weekend!</p>",
        "id": 1634414,
        "sender_full_name": "Flávio Zarur Lucarelli",
        "timestamp": 1693589486
    },
    {
        "content": "<p>We don't currently have any way to do this.  I suspect that the closest version of this we might implement is custom-per-user notification sounds, so folks can set a different sound effect for when they get messages from a manager.  But I don't think we are likely to add any stronger way for a <em>sender</em> to notify recipients.</p>",
        "id": 1634416,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1693589797
    },
    {
        "content": "<p>Dear <span class=\"user-mention\" data-user-id=\"12178\">@Alex Vandiver</span> , appreciate it!! Custom per-user sounds would be awesome ;)</p>",
        "id": 1641377,
        "sender_full_name": "Flávio Zarur Lucarelli",
        "timestamp": 1694803635
    }
]