[
    {
        "content": "<p>How to automatically delete user's upload file. like saved for 30 days</p>",
        "id": 807753,
        "sender_full_name": "R2",
        "timestamp": 1578557925
    },
    {
        "content": "<p>I join. And better with the file size condition - if the file is larger than xx MB</p>",
        "id": 813579,
        "sender_full_name": "Felix",
        "timestamp": 1580466353
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14399\">@R2</span> <span class=\"user-mention\" data-user-id=\"12634\">@Felix</span> can you talk about the goal/use case for that?  There's a message retention policy feature (which would delete old messages) that we're planning to make available soon, or is this something specific to uploaded files.  And is the goal storage reduction or security?</p>",
        "id": 813645,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1580502819
    },
    {
        "content": "<p>Looking forward to the message retention policy feature. Would be nice to purge a stream after a set time.</p>",
        "id": 815373,
        "sender_full_name": "fitze",
        "timestamp": 1581102812
    },
    {
        "content": "<p>A way to globally purge old attachments would be great, if it doesn't exist already.</p>",
        "id": 817875,
        "sender_full_name": "hb-it",
        "timestamp": 1582033352
    },
    {
        "content": "<p>not only purge old attachments but also messages. this is kinda related to privacy policy and stuff like that. any ETA for when the retention policy will land on self hosted instances?</p>",
        "id": 823549,
        "sender_full_name": "PeGaSuS",
        "timestamp": 1582917651
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"15037\">@PeGaSuS</span> the retention policy feature may be usable right now; we implemented the feature (with tests) and just have been waiting on being able to do sufficient production-side performance testing before advertising it.  So it should be ready soon, hopefully in 2.2.</p>",
        "id": 823615,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1582921020
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> that's amazing news. thanks for the quick reply.</p>",
        "id": 823651,
        "sender_full_name": "PeGaSuS",
        "timestamp": 1582925521
    },
    {
        "content": "<p>I am facing the same issue right now and while searching, found this topic. Our server space is tight and user uploads are piling. Would I break something on the zulip server if I just delete everything in \"uploads/files\" that is, say, 30 days or older?</p>",
        "id": 919745,
        "sender_full_name": "Sebastian Elsner",
        "timestamp": 1593519166
    },
    {
        "content": "<p>Hi all. We are facing to a disk space issue. old messages are being cleaned, but not uploaded files. and we have installed V 3.2, is the uploaded files auto-clean feature implanted??</p>",
        "id": 1217851,
        "sender_full_name": "lne",
        "timestamp": 1624552799
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"17197\">@lne</span> certainly the feature described above was implemented, but I think it only deletes references to files, not the files themselves.</p>\n<p><span class=\"user-mention\" data-user-id=\"10349\">@Mateusz Mandera</span> does that fit your recollection?  If so, we should at least open an issue for making the archive tool auto-delete files that no longer appear in Attachment or ArchiveAttachment (with care taken to avoid racing with new file uploads).</p>",
        "id": 1217888,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1624554728
    },
    {
        "content": "<p>I think it should be pretty straightforward for the local file uploads backend; I'm less sure about the S3 backend (just because one needs a way to iterate through files to potentially delete, and I don't recall if there's a nicer batched iterator API for that).</p>",
        "id": 1217890,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1624554790
    },
    {
        "content": "<p>Yeah, the retention system doesn't delete the actual files. I'll open an issue.</p>",
        "id": 1217896,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1624554982
    },
    {
        "content": "<p>Great. Let's tag it as a priority; it's something I'd backport a fix to 4.x when we have one.</p>",
        "id": 1217902,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1624555083
    },
    {
        "content": "<p>thanks for you answers. If the oldest files are not referenced anymore, I'll remove them with a bash hack for now.</p>",
        "id": 1219077,
        "sender_full_name": "lne",
        "timestamp": 1624607127
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"173\">Sebastian Elsner</span> <a href=\"#narrow/stream/31-production-help/topic/Auto.20delete.20user's.20upload.20file/near/919745\">said</a>:</p>\n<blockquote>\n<p>I am facing the same issue right now and while searching, found this topic. Our server space is tight and user uploads are piling. Would I break something on the zulip server if I just delete everything in \"uploads/files\" that is, say, 30 days or older?</p>\n</blockquote>\n<p>Hi, I came here for exactly the same reason. We want to keep old messages, but not old file uploads. A file upload retention policy based on filetype and size would be really nice.</p>",
        "id": 1277921,
        "sender_full_name": "Philipp Huebner",
        "timestamp": 1636365140
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"22107\">@Philipp Huebner</span> can you talk more about the details here?  I'd expect adding more disk to be an easy solution unless there's a very large amount of data being uploaded.  </p>\n<p>It's not a good experience for users to have uploaded files be unexpectedly deleted, so we'd want to be pretty thoughtful about how we communicated a feature of that form with users, so I'd like to make sure we understand the reason one would need this clearly.</p>",
        "id": 1278172,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1636405837
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> I fully understand your concerns when looking only at Zulip. At my employer however there are already too many places where employees can place + share files, management does not want Zulip to become yet another data grave where we keep more and more files for all eternity of which 99% will never be accessed again.<br>\nFor now I solved this according to my employers wishes as best I could by limiting new uploads to 5MB and writing a script that uses the Django shell to delete all attachments older than 7 days if they are above 1MB and not a PDF or a common picture format. PDFs and pictures may stay (for now). I announced this in our <a class=\"stream\" data-stream-id=\"2\" href=\"/#narrow/stream/2-general\">#general</a> stream.<br>\nIt would be better though,if instead of simple deletion, a replacement message in its place would inform about the deletion.<br>\nAnd really awesome would it be to be informed with each upload or already uploaded attachment about when this will be deleted according to the defined retention policy.</p>",
        "id": 1278415,
        "sender_full_name": "Philipp Huebner",
        "timestamp": 1636439530
    },
    {
        "content": "<p>Thanks for sharing that background!</p>",
        "id": 1278672,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1636477534
    },
    {
        "content": "<p>If you already have, eg, Google Drive, I vaguely wonder if disabling uploads entirely would be better? (Is that possible? I'm somehow not seeing upload-related settings...)</p>",
        "id": 1278899,
        "sender_full_name": "Alex Dehnert",
        "timestamp": 1636504444
    },
    {
        "content": "<p>I would not want to loose the feature of simply pasting partial screenshots into a Zulip message.</p>",
        "id": 1278944,
        "sender_full_name": "Philipp Huebner",
        "timestamp": 1636524653
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"591\">@Alex Dehnert</span> yes, one can, but only in <code>/etc/zulip/settings.py</code>, so it's not in the settings UI.</p>",
        "id": 1279165,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1636570866
    }
]