[
    {
        "content": "<p>If we have a single authentication backend, is there a way to trigger the authentication to use that provider without presenting the authentication options?</p>",
        "id": 899313,
        "sender_full_name": "Tim April",
        "timestamp": 1591710018
    },
    {
        "content": "<p>We don't seem to have an option for that. I think it's possible to achieve that by tweaking <code>login_page</code> view in <code>zerver/views/auth.py</code> to redirect to the auth URL of the corresponding authentication backend.<br>\n(Having something like : <code> return HttpResponseRedirect(reverse('login-social', args=['github']))</code>)</p>",
        "id": 899419,
        "sender_full_name": "Dinesh Ch",
        "timestamp": 1591721528
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"10349\">@Mateusz Mandera</span> FYI</p>",
        "id": 899525,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1591724213
    },
    {
        "content": "<p>We should do some design on this.  There is potential utility in showing the login page even with just one login backend, both to show the organization description (probably low-value in a corporate setting, but appropriate if e.g. GitHub is the only backend for an OSS project) and potentially to distinguish account creation from login where appropriate.  So this probably should be some sort of option; the question is what form of option it should take?</p>",
        "id": 899530,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1591724304
    },
    {
        "content": "<p>One possibility is that this should be a realm-level setting in the \"Authentication methods\" page rather than a server-level setting, and we just need to add that checkbox.  Not sure what to call it; maybe (\"Skip login page when only one authentication backend is enabled\")?</p>",
        "id": 899536,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1591724383
    }
]