[
    {
        "content": "<p>Ok, I've been running Zulip for few months now, and I am ready to start implementing bots. After several idiotic mistakes, I finally think I have the boilerplate bot ready to run. Unfortunately, I'm getting an SSL error, which brings me back to the beginning production install, during which I glossed over the ssl cert step.</p>\n<p>I am trying to follow the certbot \"manual\" instructions linked from the Zulip help docs (my server does not live on the public internet): <a href=\"https://certbot.eff.org/docs/using.html#manual\">https://certbot.eff.org/docs/using.html#manual</a></p>\n<p>It looks like I need to place a file in /.well-known/acme-challenge/, but I am not finding that directory in the expected places: /var/www/example or /usr/share/nginx/html. Into which directory for Zulip should this file go?</p>\n<p>I am assuming with the above that the error I now get when running zulip-run-bot</p>\n<div class=\"codehilite\" data-code-language=\"Python\"><pre><span></span><code><span class=\"n\">ERROR</span><span class=\"p\">:</span> <span class=\"n\">SSL</span> <span class=\"n\">ERROR</span>\n\n<span class=\"n\">Have</span> <span class=\"n\">you</span> <span class=\"n\">started</span> <span class=\"n\">the</span> <span class=\"n\">server</span><span class=\"err\">?</span>\n<span class=\"n\">Or</span> <span class=\"n\">did</span> <span class=\"n\">you</span> <span class=\"n\">misspecify</span> <span class=\"n\">the</span> <span class=\"n\">URL</span><span class=\"err\">?</span>\n</code></pre></div>\n<p>Is because I have not set up SSL correctly in the first place...</p>",
        "id": 1068280,
        "sender_full_name": "Matt Hall",
        "timestamp": 1606072652
    },
    {
        "content": "<p>Aaaaaand this was the solution that worked for me: <a href=\"https://letsencrypt.org/docs/certificates-for-localhost/\">https://letsencrypt.org/docs/certificates-for-localhost/</a>  and <a href=\"https://github.com/zulip/zulip/blob/master/puppet/zulip/files/nginx/zulip-include-common/certbot\">https://github.com/zulip/zulip/blob/master/puppet/zulip/files/nginx/zulip-include-common/certbot</a></p>\n<p>Basically, unless you spoof by having a .com or .org registered domain pointing to a local IP, and then generate a cert for the .com or .whatever, you can't really use certbot, even on manual mode. But, you can make a cert and key with openssl and add it to your certificate store authority.</p>",
        "id": 1068307,
        "sender_full_name": "Matt Hall",
        "timestamp": 1606089057
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16790\">@Matt Hall</span> interesting; where would you recommend we update the documentation to help the next person with this issue?</p>",
        "id": 1068353,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1606103493
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> ,</p>\n<p>For the SSL cert part of the install, I really sent myself on a wild goose chase. I found the subject pretty tough to figure out, and the help I got on <a class=\"stream\" data-stream-id=\"31\" href=\"/#narrow/stream/31-production-help\">#production help</a>  really helped a lot. I think copying (or re-writing, to avoid plagiarism the info from the letsencrypt link would be helpful. I am running Zulip on a Debian tower. Putting the zulip-combined-crt into /usr/local/share/ca-certificates and then running sudo update-ca-certificates got rid of the SSL error when running the bot script. Mozilla still tells me that the connection is untrusted, but I gave up on getting the browser to accept the self-signed cert awhile ago.</p>\n<p>So, I guess some information about manually putting the certificate in that path might be helpful, too?</p>",
        "id": 1068888,
        "sender_full_name": "Matt Hall",
        "timestamp": 1606165371
    }
]