[
    {
        "content": "<p>Hi there! </p>\n<p>I've installed a self-hosted Zulip server, and am now installing and configuring some bots. I've managed to install and run the Wikipedia bot without any problems. I'm using the Zulip Botserver - with a botserverrc config file, as recommended, as I want to add several other bots. Many bots, however, require config values to be passed - e.g., API keys for various services, like Github, Gitlab, OpenWeatherMap, etc. </p>\n<p>Is there a way to dynamically pass these configuration values to Botserver, via the botserverrc file? Or are we supposed to hard-code these values in the bot's .conf file? If so, where will those files be located on the server? - is it the one in <code>/usr/local/lib/python3.8/dist-packages/zulip_bots</code>?</p>",
        "id": 1026098,
        "sender_full_name": "Lux Logica",
        "timestamp": 1601185832
    },
    {
        "content": "<p>Follow-up: I've worked it out. The config needs to be passed by setting up a separate \"bot configuration' file - which we have to pass as an argument to the zulip-botserver command. Got it <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 1026112,
        "sender_full_name": "Lux Logica",
        "timestamp": 1601190994
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"17357\">@Lux Logica</span> yeah, that's right!  If you have thoughts for how we could improve this system or its docs to have made this clearer, please share them!</p>",
        "id": 1026696,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1601316855
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> I did make some suggestions <a href=\"#narrow/stream/19-documentation/topic/bots.20docs/near/1026079\">here</a>. Indeed, for SysAdmins who just want to get bots installed and running, the docs are somewhat scattered, difficult to follow, and generally unfriendly - in contrast to the rest of the Zulip docs, which is excellent.  Perhaps that's because the bots are still a 'beta' feature? I'm sure it'll improve.</p>",
        "id": 1026968,
        "sender_full_name": "Lux Logica",
        "timestamp": 1601330562
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"17357\">@Lux Logica</span> awesome, thanks for the feedback.  I agree that section is much less polished; your feedback will help direct the concrete work to make it better.</p>",
        "id": 1027649,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1601422390
    }
]