[
    {
        "content": "<p>We recently had an employee that we had to fire immediately, which we did the usual offboarding of following our internal Offboarding Policy, first being the deactivation of the Active Directory account and force changing the password. Disabling the Zulip account wasn't in the SOP since we use Active Directory authentication, which we assume that the access will be denied since we 1.Disabled the AD account 2.Changed the password.</p>\n<p>In the evening, my employee called me after working hours to inform me that he still saw this disabled user online(the employee with the disabled user telling other employees that he still had access.</p>\n<p>We would like to ask and clarify if the Zulip App(Android &amp; iOS) cache the user credentials in the app itself or does it have to authenticate every time the app is opened? If the credentials aren't cached, how often is it being checked against the active directory server?</p>\n<p>Thank you!</p>",
        "id": 1539523,
        "sender_full_name": "Gyver Chang",
        "timestamp": 1680399150
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24612\">@Gyver Chang</span> I'll start by noting that this would have happened whether the user was logged in in themobile app or just the browser (or desktop application) , because:</p>\n<ol>\n<li>In the browser (or desktop application), they'd have stayed with their logged in session.</li>\n<li>The mobile app indeed cashes credentials - when the user logs in in the app, the app ends up fetching the user's API key.</li>\n</ol>\n<p>The ldap integration allows setting up automatic user deactivation (<a href=\"https://zulip.readthedocs.io/en/latest/production/authentication-methods.html#automatically-deactivating-users\">https://zulip.readthedocs.io/en/latest/production/authentication-methods.html#automatically-deactivating-users</a>) - but that's not ideal for a situation like yours, because as noted in the doc <code>The user will be fully deactivated the next time your manage.py sync_ldap_user_data cron job runs</code> - so that can be very delayed.</p>\n<p>If you want a change in your user directory like that to be immediately reflected in Zulip (by terminating their active sessions and revoking the API key) you'll need SAML with SLO (<a href=\"https://zulip.readthedocs.io/en/latest/production/authentication-methods.html#idp-initiated-saml-logout\">https://zulip.readthedocs.io/en/latest/production/authentication-methods.html#idp-initiated-saml-logout</a>) or SCIM</p>",
        "id": 1539601,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1680430994
    }
]