[
    {
        "content": "<p>Hi everyone, </p>\n<p>I've built a CentOS 7 development server using the guide but I'm not sure how to change this into a production server? Can anyone point in the right direction please?</p>",
        "id": 54038,
        "sender_full_name": "Simon Weir",
        "timestamp": 1479073002
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"weirjr@hotmail.com\">@Simon Weir</span> there isn't a supported way to turn a development server into a production server; they have significantly different dependencies.  If you're interested, we can talk about how to make the Zulip production environment work on CentOS; it won't be a small project but probably half the work you've already done if you have a development server working </p>",
        "id": 54199,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1479158399
    },
    {
        "content": "<p>@TimAbbott,</p>\n<p>If you provide me with some instructions or something along those lines I would be grateful. I managed to get the CentOS 7 server working in a couple of days but I really need a production version. At the moment I've installed a Rocket Chat server but I would prefer a Zulip server.</p>",
        "id": 54742,
        "sender_full_name": "Simon Weir",
        "timestamp": 1479236828
    },
    {
        "content": "<p>Do you know puppet?</p>",
        "id": 54743,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1479236937
    },
    {
        "content": "<p>I'm aware of it, haven't really used it though. </p>",
        "id": 54744,
        "sender_full_name": "Simon Weir",
        "timestamp": 1479236969
    },
    {
        "content": "<p>Likely the main thing that needs to happen is adding conditionals in our puppet configuration to use the package names for things like <code>nginx</code>, <code>memcached</code>, etc. that are present in CentOS rather than Debian/Ubuntu</p>",
        "id": 54745,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1479236981
    },
    {
        "content": "<p>And I assume you don't want to run an Ubuntu VM or use a hosted Zulip instance (<a href=\"https://zulipchat.com/\" target=\"_blank\" title=\"https://zulipchat.com/\">https://zulipchat.com/</a>)?</p>",
        "id": 54746,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1479237024
    },
    {
        "content": "<p>Nope, we are a CentOS house and I need to keep everything CentOS</p>",
        "id": 54747,
        "sender_full_name": "Simon Weir",
        "timestamp": 1479237054
    },
    {
        "content": "<p>Did you run into any issues installing a Zulip development environment on CentOS?  Just curious if our instructions have any bugs</p>",
        "id": 54748,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1479237140
    },
    {
        "content": "<p>I did have a few issues actually, the documentation is missing and incorrect in a few places</p>",
        "id": 54749,
        "sender_full_name": "Simon Weir",
        "timestamp": 1479237172
    },
    {
        "content": "<p>Would it be best to start with a clean server for the production build or update the development version?</p>",
        "id": 54750,
        "sender_full_name": "Simon Weir",
        "timestamp": 1479237196
    },
    {
        "content": "<p>OK; I'd love it if you posted notes on the issues or submitted a PR updating those so we can fix the docs without someone repeating your debugging</p>",
        "id": 54751,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1479237215
    },
    {
        "content": "<p>I should be able to get some notes together at some point. </p>",
        "id": 54752,
        "sender_full_name": "Simon Weir",
        "timestamp": 1479237280
    },
    {
        "content": "<p>Hmm, I'm not sure, it might be easier to start with the development server but I'd probably want to do things in a way where as you went we updated the production installer to work, and you might at the end do a clean rebuild</p>",
        "id": 54753,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1479237283
    },
    {
        "content": "<p>If you're up for learning a bit of puppet, the main thing that needs to be modified is the manifests under<code>puppet/zulip/manifests</code></p>",
        "id": 54754,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1479237291
    },
    {
        "content": "<p>A lot of those have lists of packages to install; those lists would need to be put inside conditions for whether it's DPKG vs. RPM, and in the latter case use the names of those same packages in the RPM world</p>",
        "id": 54755,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1479237332
    },
    {
        "content": "<p>So I'd probably start with just trying to get <code>base.pp</code> to run cleanly on CentOS</p>",
        "id": 54756,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1479237407
    },
    {
        "content": "<p>And once we have that working, we should have a pattern we can use to convert the rest</p>",
        "id": 54757,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1479237419
    },
    {
        "content": "<p>Ok, I'll give it a go and let you know how I get on</p>",
        "id": 54758,
        "sender_full_name": "Simon Weir",
        "timestamp": 1479237430
    },
    {
        "content": "<ul>\n<li>redacted, sorry.</li>\n</ul>",
        "id": 57487,
        "sender_full_name": "fuero",
        "timestamp": 1479676655
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"weirjr@hotmail.com\">@Simon Weir</span> did you have a chance to share some notes about the problems you had with the docs?</p>",
        "id": 62952,
        "sender_full_name": "Sumana Harihareswara",
        "timestamp": 1480448722
    }
]