[
    {
        "content": "<p>After updating ~80 users with <code>./manage.py change_user_email</code>, we had a problem where the user list continued to show the old email, and sending private messages was difficult.</p>",
        "id": 261997,
        "sender_full_name": "Shane Kearns",
        "timestamp": 1501765447
    },
    {
        "content": "<p>restarting memcached via <code>sudo service memcached restart</code> <em>and</em> getting people to log in again seems to fix it</p>",
        "id": 261998,
        "sender_full_name": "Shane Kearns",
        "timestamp": 1501765515
    },
    {
        "content": "<p>restarting the zulip server via <code>scripts/restart-server</code> preserves stuff in memcached so it didn't fix the problem</p>",
        "id": 261999,
        "sender_full_name": "Shane Kearns",
        "timestamp": 1501765708
    },
    {
        "content": "<p>I'll create an issue, just wanted to discuss first to be sure it's not a duplicate or already fixed on master</p>",
        "id": 262000,
        "sender_full_name": "Shane Kearns",
        "timestamp": 1501765892
    },
    {
        "content": "<p>I assume you're running 1.6?  The history here is this:</p>\n<ul>\n<li>before 1.6, it was basically impossible to change emails without restarting memcached, due to how aggressively we cache user data, plus back then a lot of front end code worked with emails instead of user ids to identify users</li>\n<li>we tried very hard to fix this in 1.6, but it would not surprise me if there are still some bugs</li>\n<li>we have not done anything since 1.6 related to this that I'm aware of</li>\n</ul>\n<p>Long story short, if you're running 1.6, I would file an issue.  Thanks for reporting this, and sorry about the trouble!</p>",
        "id": 262002,
        "sender_full_name": "Steve Howell",
        "timestamp": 1501766241
    },
    {
        "content": "<p>using 1.5.3 so it's probably already been dealt with</p>",
        "id": 262004,
        "sender_full_name": "Shane Kearns",
        "timestamp": 1501767443
    },
    {
        "content": "<blockquote>\n<p>plus back then a lot of front end code worked with emails instead of user ids to identify users</p>\n</blockquote>\n<p>I guess this included the association of users with (local) avatars</p>",
        "id": 262005,
        "sender_full_name": "Shane Kearns",
        "timestamp": 1501767894
    },
    {
        "content": "<p>Yep, avatars were a major pain point before 1.6.</p>",
        "id": 262007,
        "sender_full_name": "Steve Howell",
        "timestamp": 1501768229
    },
    {
        "content": "<p>I should clarify what I said early about \"we have not anything since 1.6 related to this.\"  On master we are actually touching a lot of email-related code as part of making it possible to use the same email in multiple organizations.  This includes touching the script that Shane was using.</p>",
        "id": 262011,
        "sender_full_name": "Steve Howell",
        "timestamp": 1501769242
    },
    {
        "content": "<p>Fixed avatars using the <code>user_avatar_hash</code> function to generate old/new filenames for renaming.</p>",
        "id": 262075,
        "sender_full_name": "Shane Kearns",
        "timestamp": 1501775492
    }
]