[
    {
        "content": "<p>The command <code>manage.py changepassword</code> takes the user's email as an argument, but not the organization.  Trying to change the password of a user who uses the same email on multiple organizations, results in failure.</p>\n<p>To get around this, we can use the generic email <code>user{user-id}@zulip-domain.com</code>, which is unique. However, this only works if we  switch \"Who can access user email addresses\" to \"Nobody\". It would be nice not to have to toggle a parameter in order to be able to change a password.</p>\n<p>It seems it would be simpler to just use the user-id as an argument. Otherwise, if using the email, the realm ID could be added as an argument. Ideally, both methods should work.</p>",
        "id": 1269566,
        "sender_full_name": "Plankter",
        "timestamp": 1634820915
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"15931\">@Plankter</span> I believe we fixed this bug, but it might not have been backported to the 4.x series; let me find the details.</p>",
        "id": 1269654,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1634839828
    },
    {
        "content": "<p>It looks like the fix was backported to Zulip 4.4.</p>",
        "id": 1269656,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1634839880
    },
    {
        "content": "<p>So check if you're already running that version; if you are, we should investigate further.</p>",
        "id": 1269657,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1634839898
    },
    {
        "content": "<p>(Basically the <code>changepassword</code> management command is a Django builtin that's totally unaware of realms as a concept, and we replaced it with a custom version that is aware of them).</p>",
        "id": 1269658,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1634839933
    },
    {
        "content": "<p>Thanks for the fast answer!  Having the realms added is great. I'm afraid I'm still stuck with version 3, waiting for a calming of the conference season to upgrade. I'll be sure to test this as soon as I can.</p>",
        "id": 1269669,
        "sender_full_name": "Plankter",
        "timestamp": 1634840401
    },
    {
        "content": "<p>OK, that explains it <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 1269748,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1634842804
    }
]