[
    {
        "content": "<p>Good day,</p>\n<p>I'm wanting to import bunches of custom emojis that I want to share across the server (as each organization are sharing lots of users  etc.) and especially as I create a new organization on the server, to also have those \"cloned/copied\" and creation time.</p>\n<p>Is that currently \"supported\" behaviour somehow for Zulip, as I haven't seen that mentioned specifically</p>",
        "id": 1099916,
        "sender_full_name": "Hendrik Visage",
        "timestamp": 1610813888
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14796\">@Hendrik Visage</span> yes, you can do that sort of bulk import via <a href=\"https://zulip.com/api/upload-custom-emoji\">https://zulip.com/api/upload-custom-emoji</a>.</p>",
        "id": 1100090,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1610837398
    },
    {
        "content": "<p>But <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>  that only goes to a specific organization, not all the organizations on a server that I'm needing/wanting to do?</p>",
        "id": 1100186,
        "sender_full_name": "Hendrik Visage",
        "timestamp": 1610867711
    },
    {
        "content": "<p>in other words, I still must do it for each organization, and when I add more, repeat for them too.</p>",
        "id": 1100191,
        "sender_full_name": "Hendrik Visage",
        "timestamp": 1610868923
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14796\">@Hendrik Visage</span> correct.  If you're self-hosting you could instead add a bunch of <code>zulip_extra_emoji</code> manually instead (the <img alt=\":zulip:\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/unicode/zulip.png\" title=\"zulip\"> emoji is implemented this way), I suppose, or modify <code>do_create_realm</code> to do the uploads when a realm is created.  </p>\n<p>(Can you talk more about the use case?  If this seems like something lots of folks might want we could think about writing documentation for how to do it)</p>",
        "id": 1100774,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1610974359
    },
    {
        "content": "<p><em>MY</em> problem is that the organizations aren't hiding the users that is not part of a specific group to other users not in that group (and the \"public\" streams are also too public then in this case), so to hide diffferent clients from each other, the simplest/secure way is then to create a organization per client. (I'm also host on behalf of a client their client's stuff, so it's levels of clients etc., the Zulip group model doesn't quite fit that, and I don't ever expect Zulip to cater for that, when the simple solution is the organizations) </p>\n<p>So yes, it does mean that I'm \"part\" logged into multiple organizations (and I'm so looking forward to be able to sort the organizations in the Desktop App's left bar list)</p>\n<p>Now, in each of these organizations, I still have lots of things shared (or rather, preparing to share) like deploy streams and now the emojis etc. and some emojis <em>I</em> want to have in each of these organizations on this self hosted Zulip server.</p>",
        "id": 1100783,
        "sender_full_name": "Hendrik Visage",
        "timestamp": 1610975766
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14796\">@Hendrik Visage</span> OK.  I think the <code>zulip_extra_emoji</code> route might be the most convenient for that approach, but you could also just write a little script using the API in a loop.  Depends how many clients you have <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 1101586,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1611035438
    }
]