[
    {
        "content": "<p>Hello! I’m interested in customizing the messages given to users by the built-in bots, Welcome and Notification. Where do I go to change that text? Thanks!</p>",
        "id": 1464325,
        "sender_full_name": "Tahoma Soft",
        "timestamp": 1668513556
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"25138\">@Tahoma Soft</span> you'll need to fork Zulip to do it; most of the text is in <code>zerver/lib/onboarding.py</code>.</p>",
        "id": 1464686,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668539637
    },
    {
        "content": "<p>Can you talk about what sorts of changes you'd like to make? It might help us think about how to improve them, if the changes are not super specific to your organization.</p>",
        "id": 1464687,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668539666
    },
    {
        "content": "<p>(Or if there's a feature we could add that lets the organization administrators include some custom text)</p>",
        "id": 1464688,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1668539678
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> ! I will spin-up a fork and take a look at the onboarding.py material.</p>\n<p>Some of the customization is organizational specific; the more general aspects of what I want to do are:  </p>\n<ul>\n<li>Make the existing welcome bot a HelpBot that can be requested by the user, but doesn't run for them unless requested</li>\n<li>Create a new welcome bot that has more of a 'human touch' to it.  In this case, have it come from the admin and/or person inviting a new user,  encourage the user to contact them directly by replying, and mentioning the HelpBot above as another option for assistance.</li>\n</ul>\n<p>Regards,</p>\n<p>Erik</p>",
        "id": 1464853,
        "sender_full_name": "Tahoma Soft",
        "timestamp": 1668544137
    }
]