[
    {
        "content": "<p>Hi,</p>\n<p>is it possible to change the default privacy of a stream when being created? If for example I want all my streams to be private by default, can this be done?</p>\n<p>Thanks in advance!</p>",
        "id": 952380,
        "sender_full_name": "Christoph",
        "timestamp": 1595582864
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16782\">@Wurzelmann</span> we don't have that feature; can you talk more about your use case? </p>\n<p>(And administrator can change a stream from public to private if one is created not in a way your policies prefer)</p>",
        "id": 952927,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595611207
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> I'd like new streams (whether being created by admins or users should not matter) to be private by default and not visible to others. The use case is an organisation with multiple departments and we do not want to clutter everyone's view with lots of streams.</p>",
        "id": 952947,
        "sender_full_name": "Christoph",
        "timestamp": 1595611525
    },
    {
        "content": "<p>Hmm, I'm not sure I understand the clutter concern -- public streams would not show up in the left sidebar -- that only has streams a user has joined.</p>",
        "id": 952977,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595611951
    },
    {
        "content": "<p>So it's only the \"Manage streams\" UI that would show them.</p>",
        "id": 952978,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595611963
    },
    {
        "content": "<p>And that you can manage by naming streams with the department name in the name to make it easier to manage, without losing the usability benefits of users being able to browse and join streams in other departments relevant to their work without being added by another user.</p>",
        "id": 952981,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595612002
    },
    {
        "content": "<p>Thank you for this information, but one problem persists: users can join any public stream simply by entering its address, which we do not want by default. That's why a private-by-default setting would be great to have IMO.</p>",
        "id": 957340,
        "sender_full_name": "Christoph",
        "timestamp": 1595840141
    },
    {
        "content": "<p>Other problems regarding this:</p>\n<p>1) url-probing: it's possible to guess urls by simply entering the digits at the beginning, e.g. \"13\" for stream\"13-test\".<br>\n2) users can subscribe to any public streams when guessing the url correctly, this is exactly why we do not want a stream to be public by default</p>",
        "id": 957557,
        "sender_full_name": "Christoph",
        "timestamp": 1595852669
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16782\">@Wurzelmann</span> certainly if your intent is to not have public streams, then you don't want to use public streams and just try to pretend they're private.  URL probing isn't the main issue there -- the main \"issue\" is the security model of public streams limits access.</p>\n<p>One option you could consider is adding your users as Guest users, who effectively treat all streams as public streams.  Are you self-hosting?  If so, the simplest option would be to add a line of code to block the creation of public streams.</p>",
        "id": 957939,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595874517
    },
    {
        "content": "<p>We're selfhosting and using LDAP for authentication, but we're planning on using guest accounts too. Thank you for the suggestion, we're looking into this, but I'm wondering why no one ever asked for this? An option in the organisation's settings for setting new streams automatically to \"private\" would be great, just to have the option. I'm sure others would appreciate this too.</p>",
        "id": 958004,
        "sender_full_name": "Christoph",
        "timestamp": 1595875377
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16782\">@Wurzelmann</span> would you just want to change the default, or prevent creation of public streams?</p>",
        "id": 958084,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595876507
    },
    {
        "content": "<p>Changing the default would be enough, I guess. It could be a setting in the global options for admins</p>",
        "id": 958139,
        "sender_full_name": "Christoph",
        "timestamp": 1595877433
    },
    {
        "content": "<p>By the way, I have another issue with streams and subscriptions, should I start a new topic or just add it here, since it's related?</p>",
        "id": 958141,
        "sender_full_name": "Christoph",
        "timestamp": 1595877548
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16782\">@Wurzelmann</span> I'd do a new topic if it's a different issue.</p>",
        "id": 958161,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595878922
    },
    {
        "content": "<p>(If it ends up spawning a long discussion about a different feature, we'll be glad you did so)</p>",
        "id": 958162,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595878935
    },
    {
        "content": "<p>I don't want to hijack this conversation, but I'm also having some trouble figuring out how to manage this situation. We're a small org and so far the same people have always been members of all the streams, which have been public streams. Now, we're onboarding a new employee and I want to be able to add them to streams they need to see, without seeing history. I'm not clear on what to do here. Do I need to manually change all the streams to \"private; protected history\" now and then add her after that? Will I as the admin be able to see all the new streams once they're private? I tested unsubscribing from one private stream and now cannot resubscribe (but can still search and view the messages). I'm having trouble understanding the behavior here.</p>",
        "id": 961030,
        "sender_full_name": "Steve Shank",
        "timestamp": 1595979355
    },
    {
        "content": "<p>By the way, I already invited the new user and then realized there were some sensitive topics, so I deactivated their user account and I'm not sure how to reactivate them in the right way, since they've already been invited to all the streams.</p>",
        "id": 961031,
        "sender_full_name": "Steve Shank",
        "timestamp": 1595979372
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"6605\">@Steve Shank</span> I believe all you should need to do is make the streams private with protected history to achieve your goals.  The other option, if this user is a contractor or otherwise special, is add the new user as a guest; that will make them experience all public streams as private with protected history.</p>",
        "id": 961082,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595980269
    },
    {
        "content": "<p>I changed most streams to private with protected history. </p>\n<p>If I originally added the user and provided access to all streams and then deactivated the user, do you think the fact that they were added to a stream before it became private with protected history will enable them to see all the historical messages when I reactivate them? Or are messages only displayed to them if their create date is after their join date?</p>",
        "id": 961190,
        "sender_full_name": "Steve Shank",
        "timestamp": 1595982040
    },
    {
        "content": "<p>Hrm, when a user is created, they get initialized with 1000 messages of history from before they joined in their default streams.</p>",
        "id": 961254,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595983040
    },
    {
        "content": "<p>So, certainly some history.</p>",
        "id": 961255,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595983058
    },
    {
        "content": "<p>Thanks for taking the time to answer all these questions. Is there a way to prevent history at this point? Can I delete the user and start again, now that the streams are private?</p>",
        "id": 961276,
        "sender_full_name": "Steve Shank",
        "timestamp": 1595983478
    },
    {
        "content": "<p>Yes, that would work.  <code>manage.py change_user_email</code> could rename it, or you could delete it (carefully!  See <a href=\"https://github.com/zulip/zulip/issues/10533\">https://github.com/zulip/zulip/issues/10533</a>)</p>",
        "id": 961314,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595984151
    },
    {
        "content": "<p>Perfect! Thanks</p>",
        "id": 961377,
        "sender_full_name": "Steve Shank",
        "timestamp": 1595987871
    }
]