[
    {
        "content": "<p>Since I'm encountering a similar problem here, just so I'm understanding it right - The Electron client will throw the 'does not appear to be a valid Zulip server' if there is something not completely ok with the certificate?</p>\n<p>We have a rather old 1.4.something instance running at one of our sites. That does not work directly with the current client since the necessary information like icon etc. is not provided. I cloned that thing, upgraded it to 1.7.1 and still get the error. Now there I have a *.ourdomain.com certificate installed but for the cloned instance, the host name is <a href=\"http://zulip.test.ourdomain.com\" target=\"_blank\" title=\"http://zulip.test.ourdomain.com\">zulip.test.ourdomain.com</a>. This will of course give you a warning in the browser but still happily work.</p>",
        "id": 535582,
        "sender_full_name": "Michael Elbel",
        "timestamp": 1520851224
    },
    {
        "content": "<p>Not exactly.  It seems that electron does not accept private CAs like the one from Active Durectory. I have AD and a perfectly working in other things (even ssl inspections on firewall) certificate but zulip-desktop doesn't work with it anyway. It works<br>\n with some cheap wildcard certificate I have for my *.domain.pl</p>",
        "id": 535583,
        "sender_full_name": "Tomasz Dymek",
        "timestamp": 1520851423
    },
    {
        "content": "<p>Yeah, that was expected. My case is a bit different in that it <em>is</em> a commercial Certificate that just does not fit the host name properly :-|</p>",
        "id": 535704,
        "sender_full_name": "Michael Elbel",
        "timestamp": 1520857998
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"1799\">@Michael Elbel</span> can you post the specific error you're getting?  Also <span class=\"user-mention\" data-user-id=\"53\">@Akash Nimare</span> FYI.</p>",
        "id": 536043,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1520868599
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"1799\">@Michael Elbel</span>  Let's Encrypt might be a quick solution if the environment allows it.</p>",
        "id": 536538,
        "sender_full_name": "Oktay X",
        "timestamp": 1520886023
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>, <span class=\"user-mention\" data-user-id=\"53\">@Akash Nimare</span>  I'm getting the boilerplate</p>\n<div class=\"codehilite\"><pre><span></span>**https://zulip-new.int.ourdomain.de does not appear to be a valid Zulip server. Make sure that **\n\n**(1) you can connect to that URL in a web browser and **\n\n** (2) if you need a proxy to connect to the Internet, that you&#39;ve configured your proxy in the Network settings **\n\n** (3) its a zulip server**\n</pre></div>\n\n\n<p>I now verified that it's actualy the installed certificate for *.consol.de, which is one subdomain too general, by changing the server name to <a href=\"http://zulip-new-int.consol.de\" target=\"_blank\" title=\"http://zulip-new-int.consol.de\">zulip-new-int.consol.de</a> where the client is happy. It might be a good idea to at least be more specific in the error message because </p>\n<ul>\n<li>yes, I can connect in a web browser</li>\n<li>no, I don't need a proxy</li>\n<li>yes, it is a zulip server</li>\n</ul>\n<p><span class=\"emoji emoji-1f601\" title=\"grin\">:grin:</span> </p>\n<p>In our case it's not a big issue, since we will have a valid commercial certificate for the final server name. I was just stumped by the error remaining the same whether it's a very old server that just does not identify itself properly as a zulip server and a invalid certificate.</p>",
        "id": 537415,
        "sender_full_name": "Michael Elbel",
        "timestamp": 1520932502
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"1799\">@Michael Elbel</span> thanks for the detailed info. Currently, we don't distinguish between the different certificate errors so we only show the general error.</p>",
        "id": 537623,
        "sender_full_name": "Akash Nimare",
        "timestamp": 1520941840
    },
    {
        "content": "<p>I'll be adding this to my tasks in GSoC proposals <span class=\"emoji emoji-263a\" title=\"relaxed\">:relaxed:</span></p>",
        "id": 537766,
        "sender_full_name": "Abhigyan Khaund",
        "timestamp": 1520946144
    },
    {
        "content": "<p>Yeah, this seems like a pretty high-value thing to make debugging easier.</p>",
        "id": 538063,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1520962272
    }
]