[
    {
        "content": "<p>Desktop client shows that a stream is empty (even that it is not), and locks up. The client seams responsive. Hover still works, and you can click on other streams, but stream doesn't change. You can still click on another organization, and that one works fine.<br>\nRestarting the client temporarily resolves the issue with the responsiveness, but clicking on that stream still results in the same situation<br>\nIf the client doesn't lock up, then when clicking on a topic shows the topic messages, and clicking back on the stream shows all messages.</p>\n<p>This happened on the following combinations<br>\nClient 5.9, Server 6.1<br>\nClient 5.10, Server 6.1<br>\nClient 5.10, Server 7.0</p>\n<p>The only thing done the day before was: a user was deleted - not disabled. <br>\nMajority of the messages are short videos of bugs, and the deployment tends to grow over 20 GB, so deleting the users and then deleting the orphaned files, is a cleanup method we use. Most of the videos become irrelevant after a few days, and there is currently no way for an admin user to delete other users files. For some reason, my guys don't want to impose message retention other than forever <span aria-label=\"frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"frown\">:frown:</span></p>\n<p>Not sure if this is the cause. We usually wait several months before deleting the user, but because we had PostgreSQL problems, we did this one the day after the users departure.</p>",
        "id": 1584013,
        "sender_full_name": "Tomislav Ple훾ko",
        "timestamp": 1685686424
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"12174\">@Tomislav Ple훾ko</span> what mechanism are you using to delete users?</p>",
        "id": 1584299,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1685714554
    },
    {
        "content": "<p><code>./manage.py delete_user -u &lt;UPN&gt; -f</code><br>\nAll users are AD synched, and usually before deleting the users, first I disable then and wait for a few months.</p>",
        "id": 1584318,
        "sender_full_name": "Tomislav Ple훾ko",
        "timestamp": 1685716080
    },
    {
        "content": "<p>But, now I'm not sure that this is the reason. Colleague tells me that the same problem (deadlocking) happens to him when accessing a newer stream which actually was empty until today. None of the deleted users ever posted anything there.</p>",
        "id": 1584322,
        "sender_full_name": "Tomislav Ple훾ko",
        "timestamp": 1685716173
    }
]