[
    {
        "content": "<p>I've just installed a zulip server. It works from a browser but the desktop client displays an error message: </p>\n<div class=\"codehilite\"><pre><span></span>https://eos.domain.pl/ does not appear to be a valid Zulip server. Make sure that\n(1) you can connect to that URL in a web browser and\n (2) if you need a proxy to connect to the Internet, that you&#39;ve configured your proxy in the Network settings\n (3) its a zulip server\n</pre></div>\n\n\n<p>I'm using a certificate issued by my own CA and its certificate is installed in the system. The android App displayed warning but allowed to connect.</p>\n<p>Can someone help me?</p>",
        "id": 529141,
        "sender_full_name": "Tomasz Dymek",
        "timestamp": 1520453215
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"5674\">@Tomasz Dymek</span> as of now, we don't support the self-signed CA. We have an open PR for this which adds the custom/self-signed support on Linux - <a href=\"https://github.com/zulip/zulip-electron/pull/383\" target=\"_blank\" title=\"https://github.com/zulip/zulip-electron/pull/383\">#D383</a>.</p>",
        "id": 529168,
        "sender_full_name": "Akash Nimare",
        "timestamp": 1520453847
    },
    {
        "content": "<p>I'm using active directory CA,  and this CA is trusted by workstation.<br>\nSo does the destktop client have its own certificate store, or uses the system one. I have also a wildcard certificate for *.domain.pl issued by commercial CA.  Browser do trust this certificate.  Will it work with  the desktop clinet?</p>",
        "id": 529195,
        "sender_full_name": "Tomasz Dymek",
        "timestamp": 1520454078
    },
    {
        "content": "<blockquote>\n<p>So does the desktop client have its own certificate store, or uses the system one.</p>\n</blockquote>\n<p>Currently, we don't support this. We'll be adding a feature to import the certificate from user's keychain very soon.</p>",
        "id": 529205,
        "sender_full_name": "Akash Nimare",
        "timestamp": 1520454269
    },
    {
        "content": "<p>Well, I'll try tomorrow  switch to commercial cert or lets encrypt cert</p>",
        "id": 529210,
        "sender_full_name": "Tomasz Dymek",
        "timestamp": 1520454458
    }
]