[
    {
        "content": "<p>Just realized we had another question- what exactly is the difference in organization/realm types right now? When we created it, it asked us if we wanted Community vs Corporate. The description on that difference was things like 'Private message viewing, retention' etc. Made a lot of sense.</p>\n<p>But... none of the things described under Corporate seem to exist? Admins can't view any private messages- can't even see a full list of private streams (possibly due to <a href=\"https://github.com/zulip/zulip/pull/3786\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/3786\">#3786</a> ). I was intrigued that the discussion in <a href=\"https://github.com/zulip/zulip/pull/3786\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/3786\">#3786</a> didn't even mention Community vs Corp. We've wondered if we're missing an admin page url, or if this feature is just not fully implemented.</p>",
        "id": 299922,
        "sender_full_name": "Sean Wallitsch",
        "timestamp": 1508282916
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"shidarin@gmail.com\" data-user-id=\"3733\">@Sean Wallitsch</span> Even though we ask for community vs. corporate now, we are missing some key features for both groups.  This will change over time.</p>",
        "id": 299944,
        "sender_full_name": "Steve Howell",
        "timestamp": 1508283860
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"shidarin@gmail.com\" data-user-id=\"3733\">@Sean Wallitsch</span> to add a bit of context, I think we've actually stopped asking that question in the upcoming release.  But the idea was primarily to set policy for the <a href=\"http://zulipchat.com\" target=\"_blank\" title=\"http://zulipchat.com\">zulipchat.com</a> hosted platform, so that users would know what to expect.</p>",
        "id": 299947,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1508283937
    },
    {
        "content": "<p>Great, that explains a lot. Thank you guys.</p>",
        "id": 299948,
        "sender_full_name": "Sean Wallitsch",
        "timestamp": 1508283988
    }
]