[
    {
        "content": "<p>Hi :) I have a user reporting a really strange problem. He gets notification mails from our Zulip server because of new PMs. But then, he cannot find those PMs after logging in. Neither in the iOS-App, nor in the Mac-App, nor in the browser. It is as if the PM had never been written.<br>\nThis issue appeared now for multiple times.<br>\nPlease consider:</p>\n<ul>\n<li>It's not that PMs generally do not work for this user. We communicated via PM and it worked fine.</li>\n<li>The user is trustworthy, so he does not make fun of me.</li>\n<li>The problematic messages all come from foreign first-time users (new students from different countries).</li>\n<li>He did not mute those users.</li>\n</ul>\n<p>Do you have any idea what could be going on?</p>",
        "id": 1275544,
        "sender_full_name": "Robert (ro-i)",
        "timestamp": 1635886077
    },
    {
        "content": "<p>Is it possible that the user has multiple accounts, and the PMs were sent to a different account than the one to which the user is logged in?</p>",
        "id": 1275546,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1635886525
    },
    {
        "content": "<p>Oh yeah! He has indeed two accounts! That was the problem. Thank you so much, <span class=\"user-mention\" data-user-id=\"699\">@Anders Kaseorg</span> <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span> </p>\n<p>This reminds me that I really need to bother <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> again with <a href=\"https://github.com/zulip/zulip/pull/16208\">the PR from <span class=\"user-mention\" data-user-id=\"15808\">@Felix (strifel)</span></a> which would build the foundation for my PR to enhance the SAML authentication.<br>\nBecause this is a really annoying problem for our users: Our university does not use the primary email address as persistent identifier. So people can easily change their primary email address. But if they forget to change it withing Zulip <strong>first</strong>, they always get a new account...</p>",
        "id": 1275572,
        "sender_full_name": "Robert (ro-i)",
        "timestamp": 1635888353
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"17322\">@Robert (ro-i)</span> thanks for the reminder.  I'm super super swamped right now but we should be able to find a time to integrate that this year.</p>",
        "id": 1275598,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1635889340
    }
]