[
    {
        "content": "<p>im creating a zulip org where any user can join. to limit abuse I would like to disable linkifying links and disable emojis. is this possible?</p>\n<p>(in general I'd like to disable everything _but_ plain text, sort of like hackernews, and I found options to disable everything I think — except the above two)</p>",
        "id": 1384119,
        "sender_full_name": "dynodino",
        "timestamp": 1653419003
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24221\">@dynodino</span>: Zulip doesn't have a configuration option to disable either of those, no.</p>\n<p>What's the problem you're trying to avoid by removing them?</p>",
        "id": 1384148,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1653422569
    },
    {
        "content": "<p>As I mentioned, i'd like to limit abuse as much as possible. In big communities this does make a difference. Eg hacker news disables emojis.</p>",
        "id": 1384376,
        "sender_full_name": "dynodino",
        "timestamp": 1653440387
    },
    {
        "content": "<p>I realized I can hide emojis via css (unsure what the easiest way to add custom css is). I can also disable links via css (pointer-events: none) but I would like to enable links for admins and mods.</p>",
        "id": 1384441,
        "sender_full_name": "dynodino",
        "timestamp": 1653467292
    },
    {
        "content": "<p>Zulip doesn't have that functionality, and I don't think we're likely to build it, either.</p>\n<blockquote>\n<p>As I mentioned, i'd like to limit abuse as much as possible. </p>\n</blockquote>\n<p>What <em>sort</em> of abuse is possible with emojis which isn't with text?</p>",
        "id": 1384633,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1653524469
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"12178\">@Alex Vandiver</span>. It's a bit nuanced. Again hacker news is an example. Emojis is easily solvable though with some custom css. The linkifying problem is trickier though.</p>\n<p>What's an easy way to add custom css? Just patch a css file?</p>",
        "id": 1384660,
        "sender_full_name": "dynodino",
        "timestamp": 1653527729
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"24221\">dynodino</span> <a href=\"#narrow/stream/31-production-help/topic/disable.20linkify.20and.20emojis/near/1384660\">said</a>:</p>\n<blockquote>\n<p>It's a bit nuanced.</p>\n</blockquote>\n<p>Care to explain the nuance?</p>\n<blockquote>\n<p>Again hacker news is an example.</p>\n</blockquote>\n<p>So you've said -- but it's not clear to me what <em>problem</em> you're trying to solve by forcing Zulip to emulate the Hacker News style.</p>\n<blockquote>\n<p>Emojis is easily solvable though with some custom css.</p>\n</blockquote>\n<p>I suspect this is a much harder problem than you think.  Are you going to CSS away the emoji reaction context menu?  The emoji picker that pops up when you type <code>:zulip:</code>?  The emoji when they're pasted in as characters in the input box, like <span aria-label=\"checkbox\" class=\"emoji emoji-2611\" role=\"img\" title=\"checkbox\">:checkbox:</span>️?  The emoji from the mobile apps, which don't use CSS at all?</p>\n<p>In short, I think we can provide better suggestions when you talk about the actual behavioral problems you're trying to solve, and not the solutions you've decided upon.</p>",
        "id": 1384697,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1653547205
    },
    {
        "content": "<p>I appreciate your patience Alex! For the css, <code>.message_content .emoji {display: none}</code> should probably be sufficient for now, even if it is a bit of a hack. Must users use the webapp, not the mobile or desktop app.</p>\n<p>I'm trying to solve two problems,</p>\n<p>1- abusing/spamming emojis (text is much less of a nuisance, so leads to less abuse). <br>\n2- overuse of emojis. i'm moving to zulip from telegram + whatsapp, partially due to (a few) users who overuse emojis. That causes a major reduction in the quality of the conversation, as then thoughtful discussions are replaced with trite reactions. This isn't a universal problem — some groups have excellent emoji etiquette, but it is a problem for our community.</p>",
        "id": 1385900,
        "sender_full_name": "dynodino",
        "timestamp": 1653710831
    }
]