[
    {
        "content": "<p>Hi, I got notified on mail about this issues, it occured when a user accepted his invitation and joined our server.</p>",
        "id": 1363560,
        "sender_full_name": "Cosmic Sound",
        "timestamp": 1649507629
    },
    {
        "content": "<p><a href=\"https://pastebin.com/t7is4DKy\">https://pastebin.com/t7is4DKy</a></p>",
        "id": 1363561,
        "sender_full_name": "Cosmic Sound",
        "timestamp": 1649507745
    },
    {
        "content": "<p>Looks like your SMTP server hung when Zulip was trying to send the new user email.</p>",
        "id": 1363645,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1649526466
    },
    {
        "content": "<p>Out of curiosity, could there be an option to not use the verification email step?  Seems like the user has proved they have access to the email address already since that is where the link went in the first place so ought not to be a security risk?</p>",
        "id": 1363729,
        "sender_full_name": "Amit",
        "timestamp": 1649534305
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"23744\">@Amit</span> can you talk more about the situation in question? It's already the case that if the user clicks an invitation to a specific email address to start creating an account, then we will not require a second confirmation email.</p>",
        "id": 1364157,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649637929
    },
    {
        "content": "<p>Just did a test new user invite to a new email and you're right, that is exactly the behavior - apologies for misremembering!</p>\n<p>Abusing this thread's scope a little, could I ask if there might eventually be a mode that does not involve the zulip server itself sending emails at all?  The docs for how to set up email sending are very good but it does add an external dependency that a semi-literate type like me might find a barrier.  Primary drawback that comes to mind is that something like password reset would require admin intervention but for very small-scale installs ought to be manageable</p>",
        "id": 1364165,
        "sender_full_name": "Amit",
        "timestamp": 1649640307
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"23744\">@Amit</span> the other downside of not having email setup is that email notifications are a significant part of the user experience.</p>",
        "id": 1364184,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649651957
    },
    {
        "content": "<p>I agree it'd be nice from an accessibility of setup standpoint to have an option to not have email setup; our current thinking is that the downsides in terms of \"no way to reset password\" and \"no way to notify users\" make it not a configuration that's particularly useful to add.</p>",
        "id": 1364185,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649652043
    }
]