[
    {
        "content": "<p>Hello,<br>\nI have a general question on how to use apache2 as web server to run docker-zulip container image.<br>\nI want to host docker-zulip container and apache2 on the same physical server.  <br>\nI am aware of that zulip is designed to be run on nginx. <br>\nHowever, we want to run zulip docker container on apache2 instead. </p>\n<p>I only can find how to run docker-zulip container on nginx. (the following article)<br>\n<a href=\"https://github.com/zulip/docker-zulip/wiki/Proxying-via-nginx-on-host-machine\">https://github.com/zulip/docker-zulip/wiki/Proxying-via-nginx-on-host-machine</a></p>\n<p>However, I can't find any thing that describes on how to run docker-zulip container on apache2. <br>\nI have tried to follow a document below on how to run zulip as reverse server on apache2, but when I apply it on docker-zulip container, it didn't work.<br>\n<a href=\"https://github.com/qnxor/zulip/blob/master/docs/production/deployment.md#apache2-configuration\">https://github.com/qnxor/zulip/blob/master/docs/production/deployment.md#apache2-configuration</a></p>\n<p>Also, I have my owner SSL certificates which I receive from third party. <br>\nThank you so much for taking the time to read my question.</p>",
        "id": 1316941,
        "sender_full_name": "jcheng",
        "timestamp": 1643298619
    },
    {
        "content": "<p>I was able to run docker-zulip contain as a reverse server with apache2 as web server. <br>\nHowever, I don't seem able to create user account? <br>\nCan anyone show me how to create user account and admin user account? <br>\nThank you so much for reading my questions.</p>",
        "id": 1317359,
        "sender_full_name": "jcheng",
        "timestamp": 1643323913
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"22988\">@jcheng</span> what did you try to create an account?  The installer ends with outputting a link you can use, or you can use <code>manage.py generate_realm_creation_link</code> to make a new one.</p>",
        "id": 1317467,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1643334007
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 1319862,
        "sender_full_name": "jcheng",
        "timestamp": 1643666004
    }
]