[
    {
        "content": "<p>Can I enable responding to emails that are received via Zulip? So, when a person replies to the topic, it sends the message to the original sender?</p>",
        "id": 1287711,
        "sender_full_name": "Khionu Sybiern",
        "timestamp": 1638158738
    },
    {
        "content": "<p>Does <a href=\"https://zulip.readthedocs.io/en/latest/production/email-gateway.html\">https://zulip.readthedocs.io/en/latest/production/email-gateway.html</a> help?</p>",
        "id": 1287715,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1638163162
    },
    {
        "content": "<p>That's only one-way</p>",
        "id": 1287729,
        "sender_full_name": "Khionu Sybiern",
        "timestamp": 1638166178
    },
    {
        "content": "<p>The other direction is controlled by people's notification settings, and the outgoing mail configuration: <a href=\"https://zulip.readthedocs.io/en/latest/production/email.html\">https://zulip.readthedocs.io/en/latest/production/email.html</a></p>",
        "id": 1287741,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1638169865
    },
    {
        "content": "<p>That's not what I want, though. The email that sends to the stream may not even be a user on the stream, so replying to such an email can't rely on notifications</p>",
        "id": 1287754,
        "sender_full_name": "Khionu Sybiern",
        "timestamp": 1638175200
    },
    {
        "content": "<p>Oh, I think I understand now -- sorry for not getting it earlier.  You mean if a random person on the internet uses a stream's incoming email address to send a message to a stream, is there any way of them getting replies on that stream via emails that Zulip sends them?</p>\n<p>No, not currently.  I think there's a little security complication there, since forging emails isn't hard, and we don't want to send people emails for messages on a stream if they've not explicitly chosen to receive them.  There'd also need to be a way to show that the email address was \"subscribed\" to the stream, so people sending there would be aware of this extra semi-user that was getting their messages.</p>\n<p>There's probably a model where we automatically make an account for the email address that sent in the message, and subscribe it to just that one stream with email notifications for it on -- but the user would certainly need a way to opt into those, which is pretty much tantamount to the regular account creation flow.</p>",
        "id": 1287873,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1638207322
    },
    {
        "content": "<p>Perhaps this is helpful? <a href=\"https://zulip.com/help/using-zulip-via-email\">https://zulip.com/help/using-zulip-via-email</a></p>",
        "id": 1287955,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1638219347
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"12178\">Alex Vandiver</span> <a href=\"#narrow/stream/31-production-help/topic/email.20question/near/1287873\">said</a>:</p>\n<blockquote>\n<p>Oh, I think I understand now -- sorry for not getting it earlier.  [...]</p>\n</blockquote>\n<p>Thank you for the explanation! And no worries, I figure it wouldn't be a common desire.I see how you might see it as a security issue, but this would be more akin to opting into a Google Groups kind of functionality. Especially with how Google slowly culls down the usefulness of Google Groups, I think another platform adopting the whole \"group behind an email\" functionality is pretty important, and I think Zulip provides a great base for that.</p>",
        "id": 1288163,
        "sender_full_name": "Khionu Sybiern",
        "timestamp": 1638236566
    }
]