[
    {
        "content": "<p>I'm trying to install zulip in a production machine. I put my email and the domain in the command line but I'm hafing a error: --email=&lt;mail&gt;@&lt;domain&gt;: not found.</p>\n<p>when I open the log file, the only info that i have is:</p>\n<div class=\"codehilite\"><pre><span></span><code>Installing Zulip\nUsage:\n  install --hostname=zulip.example.com --email=zulip-admin@example.com [options...]\n  install --help\n\nOptions:\n  --hostname=zulip.example.com\n      The user-accessible domain name for this Zulip server, i.e., what users will type\n      in their web browser.  Required, unless --no-init-db is set and --certbot is not.\n  --email=zulip-admin@example.com\n      The email address of the person or team who should get support and error emails\n      from this Zulip server.  Required, unless --no-init-db is set and --certbot is\n      not.\n\n  --certbot\n      Obtains a free SSL certificate for the server using Certbot,\n      https://certbot.eff.org/  Recommended.  Conflicts with --self-signed-cert.\n  --self-signed-cert\n      Generate a self-signed SSL certificate for the server. This isn’t suitable for\n      production use, but may be convenient for testing.  Conflicts with --certbot.\n  --cacert=/path/to/ca.pem\n      Set the CA which used to establish TLS to all public internet sites during the\n      install process; used when this command is run once in a highly-controlled\n      environment to produce an image which is used elsewhere.  Uncommon.\n\n  --postgres-version=12\n      Sets the version of Postgres that will be installed.\n  --postgres-missing-dictionaries\n      Set postgresql.missing_dictionaries, which alters the initial database.  Use with\n      cloud managed databases like RDS.  Conflicts with --no-overwrite-settings.\n  --no-init-db\n      Does not do any database initialization; use when you already have a Zulip\n      database.\n\n  --no-overwrite-settings\n      Preserve existing `/etc/zulip` configuration files.\n  --no-dist-upgrade\n      Skip the initial `apt-get dist-upgrade`.\n</code></pre></div>\n<p>How can I debug/fix  it?</p>",
        "id": 1129066,
        "sender_full_name": "Iago Moreira",
        "timestamp": 1615321674
    },
    {
        "content": "<p>I suspect you're calling the installer with a newline somewhere in the command.  Can you copy/paste the whole prompt and what you're running, and the result?</p>",
        "id": 1129109,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1615329340
    }
]