[
    {
        "content": "<p>We've run into a problem when installing the zulip server on an aws ubuntu instance where we're getting a message  in the \"detail\" section stating it has an invalid response from our domain with a code 404, and also stating that:</p>\n<p>The Certificate Authority failed to download the temporary challenge files created by Certbot. Ensure that the listed domains serve their content from the provided --webroot-path/-w and that files created there can be downloaded from the internet.</p>\n<p>Some challenges have failed.<br>\nAsk for help or search for solutions at <a href=\"https://community.letsencrypt.org\">https://community.letsencrypt.org</a>. See the logfile /var/log/letsencrypt/letsencrypt.log or re-run Certbot with -v for more details.</p>\n<p>So far we've successfully attempted utilizing certbot separately to acquire a certificate, and we've tried to search the log files as recommended, but we keep getting denied access to the zulip folder itself within the ubuntu instance.</p>\n<p>Please advise</p>",
        "id": 1577858,
        "sender_full_name": "Anton Reid",
        "timestamp": 1685131190
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"27090\">@Anton Reid</span> the most likely problem here is that your server isn't on the public Internet, and those the LetsEncrypt servers can't reach your host to verify you own the domain.</p>",
        "id": 1578147,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1685143703
    },
    {
        "content": "<p>To my understanding, the zulip server won't install unless the full installation process completes, including the certbot/lets encrypt portion of the installation section. So how do we install the zulip server if there needs to be a server online for the certbot/lets encrypt portion of the installation process itself?</p>",
        "id": 1578467,
        "sender_full_name": "Anton Reid",
        "timestamp": 1685153225
    },
    {
        "content": "<p>Is there a way to install the zulip server without the certbot section, and then be able to run the certbot process after the zulip server is already installed?</p>",
        "id": 1578468,
        "sender_full_name": "Anton Reid",
        "timestamp": 1685153272
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"27090\">@Anton Reid</span> the installer is designed to take care of running the necessary parts of the server before requesting a certificate from Certbot as part of the installation process; you just need to make sure the host is accessible on the network.</p>\n<p>There is also a documented option to generate a self-signed certificate instead, and then you can do certbot later, if you prefer to do that for some reason.</p>",
        "id": 1579558,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1685313446
    }
]