[
    {
        "content": "<p>Hi, Wondering if anyone might be able to point me in the right direction in regards to viewing / exporting logs to Grafana.  I have self hosted server on deb11 clean production build (no docker)</p>\n<p>In regards to viewing, I found mention of <code>./scripts/log-search</code>, but that script doesn't seem to appear on my server.  I tried to create it manually but ran into problems with permissions.</p>\n<p>As far as exporting, any help would be great.  In a perfect world I would like to have logs sent to influxdb and ideally a Grafana template to go with it.  :)  But if that's not possible anything would be great!  The main issue is that I want to be able to monitor ip addresses.</p>",
        "id": 1454215,
        "sender_full_name": "fragment",
        "timestamp": 1666488849
    },
    {
        "content": "<p>For <code>scripts/log-search</code>, that's new in the upcoming 6.0 release.</p>",
        "id": 1454796,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1666659756
    },
    {
        "content": "<p>I'll let <span class=\"user-mention\" data-user-id=\"12178\">@Alex Vandiver</span> answer on the Grafana question since I'm not super familiar with that, but I'm guessing you'll want to upgrade to a 6.0 beta (<a class=\"stream-topic\" data-stream-id=\"1\" href=\"/#narrow/stream/1-announce/topic/server.20releases\">#announce &gt; server releases</a>) first.</p>",
        "id": 1454797,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1666659805
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"25094\">@fragment</span>, Can you talk a little about what you mean by \"monitor IP addresses\"?</p>\n<p>For producing metrics from nginx logs, we have a <code>grok_exporter</code> parser which we're using for CZO and Zulip Cloud which I've not cleaned up enough to push as a PR.  I'm also not entirely sold on <code>grok_exporter</code>, and may prefer <code>mtail</code> for something more maintained and performant.</p>\n<p>But that's derived metrics from logs, not the logs themselves.  I don't have any experience with tailing logs into InfluxDB, but from a quick search it looks like Telegraf would be part of doing that.  The logfiles you'll want to ingest are <code>/var/log/nginx/access.log</code> and either <code>/var/log/zulip/django.log</code> or <code>/var/log/zulip/server.log</code> (the former being more verbose).  In general most files in <code>/var/log/zulip/</code> are potentially interesting, though.  But I'm not familiar with the Telegraf configuration that you'd want to consume those.</p>",
        "id": 1454840,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1666666059
    },
    {
        "content": "<p>It looks like Telegraf's <code>logparser</code> input takes Grok config, so I'll try to get that cleaned up and in a PR if that piece is of interest to you.</p>",
        "id": 1454841,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1666666350
    }
]