[
    {
        "content": "<p>Hi there, <br>\nI'm trying to gain some experience with Zulip server management. I have a bit of experience in MySQL/MariaDB but not postgres. I would like to export our existing postgres Zulip db and import it on a higher version of Zulip (1.4.2 &gt; 1.5.1). <br>\n1. Can this be done?<br>\n2. How can I export the database (even just for backup purposes)?<br>\n3. How can I import the database again?<br>\nAny links, comments, walk-throughs or even video tutorials would be much welcome. <br>\n4. walking about it: are they are zulip videos on how to do things? Would be very useful also to spread the word about it.<br>\nthanks</p>",
        "id": 159338,
        "sender_full_name": "Matthias",
        "timestamp": 1488361791
    },
    {
        "content": "<p>Generally the way that Zulip ugrades works is that we apply Django migrations as part of the upgrade.  Are you familiar with Django's database migration system?  The problem with having folks doing upgrades with export/import of the database is that we modify the structure of the database between major versions, often adding columns to existing tables to support new features and doing other DB stuff as well.</p>",
        "id": 159388,
        "sender_full_name": "Steve Howell",
        "timestamp": 1488378076
    },
    {
        "content": "<p>Django db migration: No, I'm totally new to any of this. I have a bit of VBA background, work as Windows admin, am going to learn vb.NET soon. <br>\nI absolutely thought that you would do changes to the DB. But I read the zulip documentation and thought it a good idea to create a db backup or even write a script that does that in regular intervals. <br>\nThanks for your reply.</p>",
        "id": 159421,
        "sender_full_name": "Matthias",
        "timestamp": 1488383519
    },
    {
        "content": "<p>Are they any walk-through videos of Zulip out there? Youtube doesn't seem to have any. It's a little easier to dig into than just text and snippets.</p>",
        "id": 159422,
        "sender_full_name": "Matthias",
        "timestamp": 1488383600
    },
    {
        "content": "<p>We don't have any videos, though that's actually a good idea!  I wonder how much work it'd be to make a screencast of installing Zulip in production</p>",
        "id": 159491,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1488388687
    },
    {
        "content": "<p>It mostly depends on your software and setup. The <em>screen cast software:</em> needs to be able to pause the recording (made good experience with Bandicam, otherwise open source alternative is ShareX but doesn't allow pausing. Snippets would need to be stitched together with video editor at the end), as for <em>setup:</em> a virtual machine is best so that you can run the screen cast on top of the VM-window even during reboots.</p>",
        "id": 159822,
        "sender_full_name": "Matthias",
        "timestamp": 1488404470
    },
    {
        "content": "<p>I'd say it takes at least 50% longer than the installation process to do the video (because of the explaining and thinking ahead). Maybe 2x as long as the install process for a simple tutorial. I would offer myself but I don't know enough about Zulip to qualify.</p>",
        "id": 159823,
        "sender_full_name": "Matthias",
        "timestamp": 1488404482
    },
    {
        "content": "<p>Really useful is two people doing the talking in an interview type of way; one wanting to learn installing Zulip to ask the right kind of questions, another with lots of experience to answer them.</p>",
        "id": 159824,
        "sender_full_name": "Matthias",
        "timestamp": 1488404516
    },
    {
        "content": "<p>Interesting; <span class=\"user-mention\" data-user-email=\"zulip@feorlen.org\" data-user-id=\"397\">@Andrea  Longo</span> recently clocked install as ~5m if one has done it before</p>",
        "id": 159859,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1488409126
    },
    {
        "content": "<p>That was after downloading the tarball, so somewhat less data to move around.</p>",
        "id": 159864,
        "sender_full_name": "Andrea  Longo",
        "timestamp": 1488409847
    },
    {
        "content": "<p>I did another test install on Ubuntu server VM in virtual box. Took definitely longer than 5min. I would include everything; wget, untar, creating SSL certificate, install, nano settings.py &amp; zulip-secrets.conf, install, db-initialise, realm link, setup screen...</p>",
        "id": 159998,
        "sender_full_name": "Matthias",
        "timestamp": 1488436326
    }
]