[
    {
        "content": "<p>Hi! Could someone tell me what the expected current behavior of the side bar stream sorting and graying out is? <a href=\"https://zulipchat.com/help/organize-the-streams-sidebar\" target=\"_blank\" title=\"https://zulipchat.com/help/organize-the-streams-sidebar\">In the docs</a> I see that one reason streams get grayed out is muting. I also found <a href=\"https://github.com/zulip/zulip/commit/5a130097bf1fc1ee9b7453192defa983f6afb90c\" target=\"_blank\" title=\"https://github.com/zulip/zulip/commit/5a130097bf1fc1ee9b7453192defa983f6afb90c\">this recent commit</a> and associated issue where it seems like another reason streams can get grayed out is when they're \"inactive\". The latter is what I'm more interested in currently, because muting is not a factor in what I'm experiencing (all streams in my examples below are unmuted).</p>\n<p>From the behaviors implied in that commit and the related issue it would seem to me that one would expect grayed out inactive streams would also be put at the bottom, meaning  no grayed out stream would ever appear above a non-grayed out stream.</p>\n<p>The behavior I've observed is that a) my grayed out streams are not at the bottom, they stay wherever they were and b) I'm not sure what \"activates\" grayed out streams such that they get un-grayed-out because there's some where I've just participated and they continue to be grayed out.</p>\n<p>Is this a known issue or just lack of understanding on my part about what makes a stream \"inactive\"?</p>\n<p>Thanks!</p>",
        "id": 754003,
        "sender_full_name": "Noe Martinez",
        "timestamp": 1560552054
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"3748\">@Noe Martinez</span> good question!  streams are grayed out because of muting or because of being inactive.  We currently don't sort muted streams to the bottom.</p>",
        "id": 754052,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1560555839
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"131\">@Rishi Gupta</span> we should probably add a link to \"muted streams\" in the new user docs on the inactive streams behavior?</p>",
        "id": 754054,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1560555861
    },
    {
        "content": "<p>It sounds like for Noe it's not muting? </p>\n<p>My guess is this is either a bug similar to what we were seeing with pinned streams, or something funny with our new \"automatically sort to the bottom\" setting</p>",
        "id": 754058,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1560555970
    },
    {
        "content": "<p>The \"pinned stream\" bug is only fixed in master for 2.1, not 2.0.x, so it could just be that bug (that we don't fix the active state for pinned streams).</p>",
        "id": 754085,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1560556542
    },
    {
        "content": "<p>Yeah sorry if I phrased it confusingly but I meant to say \"I'm aware that muting is one reason streams get grayed out but in my case that shouldn't be a factor, so I'd like to learn the expectation for graying out due to inactivity\"</p>",
        "id": 754142,
        "sender_full_name": "Noe Martinez",
        "timestamp": 1560557734
    },
    {
        "content": "<p>Yes, so can you provide details on a case where you have a greyed-out non-muted stream not at the bottom?</p>",
        "id": 754151,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1560557908
    },
    {
        "content": "<p>(Is it a \"pinned stream\"?  As mentioned, there was a bug with those and now they are treated as never inactive because that seems to better match the user intent)</p>",
        "id": 754152,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1560557913
    },
    {
        "content": "<p>Indeed it appears the issue is only in the pinned area for me, so it sounds like 2.1 should make that moot! I agree that never graying due to inactivity better matches the pinned intent, so thanks for that change.  Thanks for the info!</p>",
        "id": 754195,
        "sender_full_name": "Noe Martinez",
        "timestamp": 1560562335
    }
]