[
    {
        "content": "<p>Hi there, I have been using Zulip for close to a month and really loving it so far. I want to scale it further aftre testing with over 10+ users. I am thinking of setting up high availability for my Zulip instance. I saw that this is available for enterprise customers, what about community users like ourselves? I know that the DB will need to have high avaibility, what about the web server? Can we just set up a few web servers, point to the DB and that's all?</p>\n<p>Thank you!</p>",
        "id": 1431344,
        "sender_full_name": "Gyver Chang",
        "timestamp": 1662553660
    },
    {
        "content": "<p>The <a href=\"https://zulip.readthedocs.io/en/latest/production/requirements.html#scalability\">docs on Scalability</a> may be of interest to you. In general, unless you have Herculean loads, it's best to <a href=\"https://zulip.readthedocs.io/en/latest/production/postgresql.html\">externalize the database</a> and have a <em>hot spare</em> application server, as coordinating sessions between load-balanced application server instances is expensive and provides little effective additional availability over a hot spare.</p>",
        "id": 1431347,
        "sender_full_name": "Matt",
        "timestamp": 1662554793
    },
    {
        "content": "<p>Hey thanks for the quick reply! Not going to have herculean loads for sure, the max users I would have on my servers is max 200 I believe? I'm looking for high availbility as power outages are quite common in my area(I work in Ho Chi Minh City, Vietnam) and we had 3-4 power outages for the last 4 weeks alone. To force my users to migrate from a super high availbility Teams setup and/or Whatsapps, I need to promise stability and with the power outages, I am not confident i promising my users similar uptime to Teams and/or Whatsapp. I have 3 servers spread over Central/Southern Vietnam so I can easily set up a PostgreSQL Cluster over 3 different regions, the only question is the webserver :)</p>",
        "id": 1431348,
        "sender_full_name": "Gyver Chang",
        "timestamp": 1662555070
    },
    {
        "content": "<p>Hotspare sounds good but I don't want to wake up 3am in the morning to turn on the hotspare =X</p>",
        "id": 1431349,
        "sender_full_name": "Gyver Chang",
        "timestamp": 1662555092
    },
    {
        "content": "<p>So you can have a load-balancer (or a set of load-balancers, depending on your mitigations) in front of the application servers, configured to send traffic to the \"primary\" unless it fails, and then send traffic to the \"secondary\", etc. The key is just to make sure all of the traffic is going to only one instance at a time.</p>",
        "id": 1431350,
        "sender_full_name": "Matt",
        "timestamp": 1662555404
    },
    {
        "content": "<p>Ah I see, sounds good. So you were saying the key is to make sure the traffic is going to one instance at a time?</p>",
        "id": 1431351,
        "sender_full_name": "Gyver Chang",
        "timestamp": 1662555464
    },
    {
        "content": "<p>Correct!</p>",
        "id": 1431352,
        "sender_full_name": "Matt",
        "timestamp": 1662555529
    },
    {
        "content": "<p>Ok thanks, that's great advise. Appreciate it :)</p>",
        "id": 1431359,
        "sender_full_name": "Gyver Chang",
        "timestamp": 1662556088
    },
    {
        "content": "<p>Just to ask, is Postresql Cluster a supported database configuration?</p>",
        "id": 1431360,
        "sender_full_name": "Gyver Chang",
        "timestamp": 1662556106
    },
    {
        "content": "<p>Zulip supports <a href=\"https://www.postgresql.org/docs/current/warm-standby.html\">PostgreSQL warm standby</a> natively <a href=\"https://zulip.readthedocs.io/en/latest/production/deployment.html#postgresql-warm-standby\">https://zulip.readthedocs.io/en/latest/production/deployment.html#postgresql-warm-standby</a>  but has no guidance on other methods. In general, for the best performance, Zulip likes to have \"one\" of something at a time, so that caching optimizations, memory management, sessions/profiles optimization can provide the best experience.</p>",
        "id": 1431366,
        "sender_full_name": "Matt",
        "timestamp": 1662556490
    },
    {
        "content": "<p>That's great info thanks!<br>\nOne more question.. regarding file upload backends, basically any backend that I mount a folder on it works right? s3 backend is out for us because the latency to S3 servers are pretty bad from Vietnam.</p>",
        "id": 1431383,
        "sender_full_name": "Gyver Chang",
        "timestamp": 1662559698
    },
    {
        "content": "<p>Yes, as long as you can keep it in sync between the application servers any storage will do.</p>",
        "id": 1431386,
        "sender_full_name": "Matt",
        "timestamp": 1662560288
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"24078\">@Matt Keller</span> you are a life saver :)</p>",
        "id": 1431388,
        "sender_full_name": "Gyver Chang",
        "timestamp": 1662560709
    },
    {
        "content": "<p>Happy to help <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 1431389,
        "sender_full_name": "Matt",
        "timestamp": 1662560870
    }
]