[
    {
        "content": "<p>Howdy folks, I'm doing a deploy of Zulip and I'm trying to work out which directories need to be on my network mount instead of my local mount. I tried just mounting my database over the network (<code>/var/lib/postgresql/</code>), but I found that a custom <code>gif</code> I uploaded no longer was saved. What other directories are relevant, that zulip might change in the course of regular operations?</p>\n<p>This supports a workflow I enjoy where I build VMs for each version, then keep only what needs to be mutable mutable, and just reboot every few days to ensure the software hasn't wandered away.</p>\n<p>I tried tracing <code>/home/zulip/deployments/current/manage.py</code> to find the <code>backup</code> workflow but am unfamiliar enough with Django that I can't just wander the source and find it.</p>",
        "id": 1369173,
        "sender_full_name": "Toyam Cox",
        "timestamp": 1650302818
    },
    {
        "content": "<p>You may find <a href=\"https://zulip.readthedocs.io/en/latest/production/upload-backends.html\">https://zulip.readthedocs.io/en/latest/production/upload-backends.html</a> useful.</p>\n<p>Also, I would guess that you'll be happier accessing your DB using postgres' network protocol than network-mounting postgres's DB directory (and that doing a network-attached block device would be somewhere between the two), but dunno.</p>",
        "id": 1369238,
        "sender_full_name": "Alex Dehnert",
        "timestamp": 1650308358
    },
    {
        "content": "<p>Oh I've got <code>iscsi</code> set up for this prod, which works great<br>\nSo just the database and file upload directory? Sounds good!</p>",
        "id": 1369246,
        "sender_full_name": "Toyam Cox",
        "timestamp": 1650308637
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24040\">@Toyam Cox</span> <a href=\"https://zulip.readthedocs.io/en/latest/production/export-and-import.html#what-is-included\">https://zulip.readthedocs.io/en/latest/production/export-and-import.html#what-is-included</a> and the following sections cover that question in detail.</p>",
        "id": 1369329,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1650311549
    }
]