[
    {
        "content": "<p>Hello, I was wondering if it is possible to import old messages into zulip with the correct timestamp after the org has been created on a self-hosted instance? Our org is moving from multiple telegram group chats to a single zulip instance, and would like to centralize the knowledge base from those groups. <br>\nOne of the ways I was thinking about would be to add them directly to the database, but I'm not sure where to start looking for some references for that.</p>",
        "id": 1437988,
        "sender_full_name": "Radu Pogonariu",
        "timestamp": 1663672075
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"18006\">@Radu Pogonariu</span> so we have data import tools in <code>zerver/data_import/</code>, however, all of those tools are designed to fully import an organization. We will probably at some point have a feature for merging history, but don't have a timeline for that.</p>",
        "id": 1438069,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1663693610
    },
    {
        "content": "<p>I think the first step would be implementing tool like those for processing Telegram exports into the Zulip import format.</p>",
        "id": 1438070,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1663693640
    },
    {
        "content": "<p>The fact that merging history is not supported is not yet documented in <a href=\"https://zulip.readthedocs.io/en/latest/production/export-and-import.html\">https://zulip.readthedocs.io/en/latest/production/export-and-import.html</a>.</p>",
        "id": 1438386,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1663718821
    },
    {
        "content": "<p>I'm not sure that's the best place to document it -- that page is primarily about moving between hardware, but I suppose we could document it there in addition to some other place.</p>",
        "id": 1438397,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1663719095
    },
    {
        "content": "<p>That's where I would look at if my use case is that I'm trying Zulip, and that after a while, have decided to migrate the content my old chat system to Zulip., and want to merge the history. I'd then use the data export conversion tool. It just happens in this case that there is no conversion tool for Telegram data export yet.</p>",
        "id": 1438427,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1663719645
    }
]