[
    {
        "content": "<p>I'm looking at the install guide and I see that the script is the main way Zulip is installed; I don't see instructions for any other method.</p>\n<p>I already have Postgres, RabbitMQ, Memcached, and Redis installed and running in production for other services as well as infrastructure surrounding those and I wanted to ensure that the script won't interfere with them but will simply create its own databases, users, etc.</p>",
        "id": 793966,
        "sender_full_name": "Amolith",
        "timestamp": 1571972655
    },
    {
        "content": "<p>I'm reading through the script now and it <em>looks</em> like it should be fine but, again, I wanted to ask first.</p>",
        "id": 793967,
        "sender_full_name": "Amolith",
        "timestamp": 1571972896
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"13722\">@Amolith</span> <a href=\"https://zulip.readthedocs.io/en/latest/production/deployment.html#running-zulip-s-service-dependencies-on-different-machines\" target=\"_blank\" title=\"https://zulip.readthedocs.io/en/latest/production/deployment.html#running-zulip-s-service-dependencies-on-different-machines\">https://zulip.readthedocs.io/en/latest/production/deployment.html#running-zulip-s-service-dependencies-on-different-machines</a> has some advice on this.  One thing to note is that Zulip does expect to control the names of the databases and authentication of the services it uses, so you'll want to take some care.  If you have another database with the name Zulip wants, I don't guarantee it won't delete-and-create.</p>",
        "id": 794098,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1572032180
    },
    {
        "content": "<p>(One of the things I've been hoping to do on the <code>postgres</code> front is look at switching it from using the default <code>main</code> database name to <code>zulip</code> for what to call the postgres database, but it should primarily work within the <code>zulip</code> schema in any case)</p>",
        "id": 794099,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1572032219
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> Alright, thank you!</p>",
        "id": 794192,
        "sender_full_name": "Amolith",
        "timestamp": 1572044118
    },
    {
        "content": "<p>Hello, the Installer wants to pull data from <a href=\"http://github.com\">github.com</a>, but it is blocked in our network, is it possible to install without the pull or provide the data before running the installer ? Thanks and Regards!</p>",
        "id": 1504330,
        "sender_full_name": "Armin",
        "timestamp": 1675787424
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"25978\">@Armin</span> you can use the Docker image -- that doesn't need to download anything extra in order to install.</p>",
        "id": 1504474,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1675800930
    },
    {
        "content": "<p>And if you're not running in a Docker environment, with <code>docker export</code> you can dump a container image to a tarball and do a manual install from there by copying the appropriate paths out of the tarball and onto the host. I don't necessarily recommend it as it's error prone, but I suspect an environment that blocks GitHub of all places probably has other oddities, and it's thus worth noting that it's <em>possible</em>.</p>",
        "id": 1504500,
        "sender_full_name": "Josh Klar",
        "timestamp": 1675802879
    },
    {
        "content": "<p>Thanks alot to both of you!</p>",
        "id": 1522334,
        "sender_full_name": "Armin",
        "timestamp": 1678473211
    }
]