[
    {
        "content": "<p>We just installed a Zulip instance and disabled the \"Send emails introducing Zulip to new users\", then added users via the API and they all got a message from the Welcome bot, which we did not anticipate and want. Is it possible to change that as a default?</p>",
        "id": 1008709,
        "sender_full_name": "Christoph",
        "timestamp": 1599138806
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16782\">@Wurzelmann</span> Just to make sure we're talking about the same thing, the introductory emails explain Zulip and how to access the desktop/mobile apps (etc.) and are different from Welcome Bot.</p>",
        "id": 1008959,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1599155464
    },
    {
        "content": "<p>I think you can disable Welcome Bot via setting <code>WELCOME_BOT=None</code> in /etc/zulip/settings.py.  That said, I'm curious why you want to disable it?</p>",
        "id": 1008960,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1599155510
    },
    {
        "content": "<p>Sorry for my incorrect terminology, I meant the welcome bot, which notified all users at once about unread messages (I suspect those were some kind of intro messages). We wanted to deploy our Zulip instance, import all users \"silently\", run some more tests and then finally announce the new service to our colleagues. The e-mails that went out immediately took away most of our planning window and left us somewhat unprepared.</p>",
        "id": 1008978,
        "sender_full_name": "Christoph",
        "timestamp": 1599155814
    },
    {
        "content": "<p>Ahh, makes sense.  How were you creating the users?</p>",
        "id": 1008983,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1599155905
    },
    {
        "content": "<p>I wonder if we should just have a documented API for doing that sort of silent creation where the welcome bot messages (and whatnot) would be deferred to when the user actually signs in the first time.</p>",
        "id": 1008987,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1599155941
    }
]