[
    {
        "content": "<p>Hi there, I hope this is the correct place to get advice.</p>\n<p>My team been using Zulip in a small LAN setup in a testing phase and so far, so good :)</p>\n<p>To roll it out to more people outside we'd like to make the setup a bit more polished and proper, so the first step to that would be ensuring SSL works correctly without warnings.</p>\n<p>Our Zulip setup is purely local and without external access at the moment, and we'd like to keep it that way for the foreseeable future which I believe rules out certbot (happy to be corrected if I'm wrong).</p>\n<p>With certbot not being an option, I started to look at ways to generate our own .key/.crt pairs, and have it trusted automatically in the local Windows Active Directory. The generation of keys seems to have multiple solutions online, and Zulip Docs explicitly define about having a \"full chain\". With all that in mind, my two main questions are the following.</p>\n<ul>\n<li>What exact method/program/flags should I use to generate a custom certificate which Zulip would accept?</li>\n<li>After the certificate files are created, can I have the Windows AD CA automatically trust them for all AD users/machines?</li>\n</ul>\n<p>I hope that all makes sense, thanks!</p>",
        "id": 767137,
        "sender_full_name": "Marc",
        "timestamp": 1562941456
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"12910\">@Marc</span> this is the right place!</p>\n<p>I don't know how Windows AD CA works, but generally creating a \"full chain\" means just have the <code>.crt</code> file contain the chain of certificates leading to your trust root.  Google suggests this guide might do what you want: <a href=\"https://www.reddit.com/r/homelab/comments/89rtbw/windows_ca_nginx/\" target=\"_blank\" title=\"https://www.reddit.com/r/homelab/comments/89rtbw/windows_ca_nginx/\">https://www.reddit.com/r/homelab/comments/89rtbw/windows_ca_nginx/</a> </p>\n<p>(If it doesn't, I think <code>nginx</code>, <code>certificate</code>, and <code>Active Directory</code> is a good set of keywords for this)</p>",
        "id": 767473,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1562970287
    },
    {
        "content": "<p>(Our requirements here aren't anything special, just using the popular nginx webserver)</p>",
        "id": 767474,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1562970305
    },
    {
        "content": "<p>//removed</p>",
        "id": 769619,
        "sender_full_name": "Marc",
        "timestamp": 1563456145
    },
    {
        "content": "<p>//removed</p>",
        "id": 769620,
        "sender_full_name": "Marc",
        "timestamp": 1563456197
    },
    {
        "content": "<p>//removed</p>",
        "id": 769621,
        "sender_full_name": "Marc",
        "timestamp": 1563456218
    },
    {
        "content": "<p>//removed</p>",
        "id": 769622,
        "sender_full_name": "Marc",
        "timestamp": 1563456248
    }
]