[
    {
        "content": "<p>I'm looking for a self-hosted solution for my project communication and found the zulip presentation at GSoC mentors summit very promising.<br>\nHowever, the regular installation with the install script won't work as I can't provide an exclusive server for zulip. (I have a rented root server running Ubuntu 14.04, and on it I have running multiple servers, e.g. mail server, GitLab, ownCloud and some more).</p>\n<p>I don't feel comfortable with the suggested solution of installing zulip in a VM on that remote server (to which I have only access through an SSH terminal). Therefore I'd like to know *if* it's possible at all to install zulip manually as a server among others, manually setting up DB, program etc., and if so, if there's a pointer where to look for documentaiton for such a process.<br>\nIf such a process seems feasible but isn't documented yet I might help with such documentation if I'd be directed through the process.</p>",
        "id": 48255,
        "sender_full_name": "Urs Liska",
        "timestamp": 1478043119
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"ul@openlilylib.org\">@Urs Liska</span> we don't have a documented process for doing that.  If you're willing to spend some significant time on setup, we could work on putting together such a documented process together.  There are basically a few services that we configure and one would need to make sure are compatible with whatever else you have running on your machine:</p>\n<ul>\n<li>postgres</li>\n<li>redis</li>\n<li>memcached</li>\n<li>rabbitmq</li>\n<li>nginx</li>\n</ul>\n<p>So step 1 would be to check if you're using any of those (or other things like Apache using their default ports)</p>",
        "id": 48257,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1478043539
    },
    {
        "content": "<p>If I'm willing to spend that time probably depends on *how* ugly it actually becomes. Generally I'm ready to go, and I think such a process would serve you as well, as the current state definitely rules out a significant number of potential users (i.e. people/admins installing zulip).</p>\n<p>Out of my head I can say the folloiwng:</p>\n<ul>\n<li>postgres is installed in v 9.6.0 (and used by a number of other services)</li>\n<li>bash doesn't know about redis, but I'm pretty sure it is running with GitLab (can't say whether this is an advantage or a problem</li>\n<li>nginx is the only web server I use for everything. Apache is installed (by default) but not running</li>\n</ul>\n<p>For the others and redis I need more investigation but can't provide this right now, as my monster day is definitely over now (it's about 60 hours now that I last got out of a real bed in Sunnyvale ...)</p>",
        "id": 48258,
        "sender_full_name": "Urs Liska",
        "timestamp": 1478044050
    },
    {
        "content": "<p>OK; the first issue is going to be what the database names you have in <code>/var/lib/postgresql/9.6</code>; Zulip uses the default of <code>main</code> by default, and we'll need to make that an option (and probably default to \"zulip\") as one piece of simplifying this.  </p>",
        "id": 48259,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1478044258
    },
    {
        "content": "<p>We don't do anything too crazy; the likely things to deal with are going to be stuff like:</p>\n<ul>\n<li>Integrating what we need in /etc/nginx/nginx.conf in some reasonable way (most stuff is in the sites-foo file and thus fine)</li>\n<li>adding postgres 9.6 support to some config files (or installing 9.5; that might be easier)</li>\n<li>nothing with redis if the port is available; we can check with <code>netstat -nlp</code> tomorrow.</li>\n</ul>\n<p>I'm happy to help with any code changes on our end</p>",
        "id": 48261,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1478044399
    },
    {
        "content": "<p>There are directories for 9.4, 9.5 and 9.6, and each contains one item <code>main</code>. However, when opening psql it says <code>psql (9.6.0, Server 9.4.9)</code> and lists me the following:</p>\n<div class=\"codehilite\"><pre><span></span>                                      Liste der Datenbanken\n     Name      | Eigentümer | Kodierung | Sortierfolge | Zeichentyp  |    Zugriffsprivilegien    \n---------------+------------+-----------+--------------+-------------+---------------------------\n mattermost    | postgres   | UTF8      | de_DE.UTF-8  | de_DE.UTF-8 | \n moodle        | moodleuser | UTF8      | de_DE.UTF-8  | de_DE.UTF-8 | =Tc/moodleuser           +\n               |            |           |              |             | moodleuser=CTc/moodleuser\n moodle-db     | moodle     | UTF8      | de_DE.UTF-8  | de_DE.UTF-8 | \n postgres      | postgres   | UTF8      | de_DE.UTF-8  | de_DE.UTF-8 | \n roundcubemail | roundcube  | UTF8      | de_DE.UTF-8  | de_DE.UTF-8 | \n template0     | postgres   | UTF8      | de_DE.UTF-8  | de_DE.UTF-8 | =c/postgres              +\n               |            |           |              |             | postgres=CTc/postgres\n template1     | postgres   | UTF8      | de_DE.UTF-8  | de_DE.UTF-8 | =c/postgres              +\n               |            |           |              |             | postgres=CTc/postgres\n uliska        | postgres   | UTF8      | de_DE.UTF-8  | de_DE.UTF-8 | =Tc/postgres             +\n               |            |           |              |             | postgres=CTc/postgres    +\n</pre></div>\n\n\n<p>Regardless of me understanding where the actual DBs are located, defaulting to <code>zulip</code> definitely sounds like a good idea.</p>",
        "id": 48262,
        "sender_full_name": "Urs Liska",
        "timestamp": 1478044713
    }
]