[
    {
        "content": "<p>I took a copy of my production server and am testing the update from 2.0.7 to 2.1.2<br>\nMigrations took a long time but eventually went through<br>\nHowever, on the resulting server I see memcached errors in the logs, e.g. \"SERVER HAS FAILED AND IS DISABLED UNTIL TIMED RETRY\"<br>\nI see several notes about changes to memcached in the last couple of versions, particularly about adding auth, but those are  all just notes in the changelog, I don't see anything like \"make sure to X\" to fix issues<br>\nDoes anyone know how I can resolve these errors?</p>",
        "id": 825623,
        "sender_full_name": "Mike Ray",
        "timestamp": 1583267712
    },
    {
        "content": "<p>Looking back at the logs -- the first error I see in the trace is \"AUTHENTICATION FAILURE,  host: 127.0.0.1:11211 -&gt; libmemcached/sasl.cc:292\", so I assume this has to be related to the change in 2.1.2:</p>\n<blockquote>\n<p>Added authentication for redis and memcached even in configurations where these are running on localhost, for add hardening against attacks from malicious processes running on the Zulip server.</p>\n</blockquote>",
        "id": 825624,
        "sender_full_name": "Mike Ray",
        "timestamp": 1583267853
    },
    {
        "content": "<p>I did not see any notes about configuring settings related to memcached in the release notes and would still appreciate help on this</p>",
        "id": 825670,
        "sender_full_name": "Mike Ray",
        "timestamp": 1583270322
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"9893\">@Mike Ray</span> We fixed some issues related to that since 2.1.2, can you try upgrading to the current 2.1.x branch?</p>",
        "id": 825672,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1583272204
    },
    {
        "content": "<p>I will test that on a second test instance, as soon as I confirm it has the issue too</p>",
        "id": 825673,
        "sender_full_name": "Mike Ray",
        "timestamp": 1583272450
    },
    {
        "content": "<p>Hmm... initial testing does not show the errors on a fresh installation.<br>\nI'll do another upgrade test and see if the error shows up again or not.</p>",
        "id": 825675,
        "sender_full_name": "Mike Ray",
        "timestamp": 1583274086
    },
    {
        "content": "<p>A second upgrade test did not show an issue. It's quite possible it was human error that cause the initial problem.<br>\nI am going to run through the upgrade a third time and see what happens.</p>",
        "id": 826796,
        "sender_full_name": "Mike Ray",
        "timestamp": 1583424826
    },
    {
        "content": "<p>A repeated upgrade still does not show the issue -- the original issue must have been from user error.<br>\nThanks much for the help!</p>",
        "id": 827278,
        "sender_full_name": "Mike Ray",
        "timestamp": 1583515358
    },
    {
        "content": "<p>Thanks for following up!</p>",
        "id": 827388,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1583527126
    }
]