[
    {
        "content": "<p>If this seems unexpected/abnormal, let me know what additional info I can provide</p>\n<p>IDK if related to <a href=\"#narrow/stream/31-production-help/topic/user_presence.20timeouts\">https://chat.zulip.org/#narrow/stream/31-production-help/topic/user_presence.20timeouts</a></p>\n<p>Since upgrading to 6.2 (self hosted on Digital Ocean)  have started seeing more Timeouts: <em>email subject</em>: Timed out in user_activity after 30 seconds processing 1 events <em>email message</em>: Logger root, from module zerver.worker.queue_processors line 382: Error generated by Anonymous user (not logged in) on XXXXXXX deployment Traceback (most recent call last): File \"/home/zulip/deployments/2023-06-14-04-33-31/zerver/worker/queue_processors.py\", line 317 ...</p>\n<p>Also FIW the memory usage jumped when we upgraded to 6.2. (Is it normal to hover near 97%?)</p>\n<p>Not wanting to wiggle too many things at the same time, we upgraded our server first, waited couple of days, then upgraded Zulip.</p>\n<p>On 6/10 we upgraded the Digital Ocean virtual server from s-1vcpu-2gb to s-2vcpu-4gb  ... our memory usage immediately dropped to 50% when we doubled the RAM of our virtual server.</p>\n<p>The server is is dedicated to running Zulip, default install for self-hosted (eg postgress etc all running on the server) <strong>6 active users max.</strong></p>\n<p>On 6/14 we upgraded from Zulip 6.1 to 6.2. Memory usage immediately hopped right back up to 97%.</p>\n<p><a href=\"/user_uploads/2/6e/ftopjXIHv1I9YSe0L_UiLjAG/Screenshot-2023-06-19-at-15.56.27.png\">Screenshot-2023-06-19-at-15.56.27.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/6e/ftopjXIHv1I9YSe0L_UiLjAG/Screenshot-2023-06-19-at-15.56.27.png\" title=\"Screenshot-2023-06-19-at-15.56.27.png\"><img src=\"/user_uploads/2/6e/ftopjXIHv1I9YSe0L_UiLjAG/Screenshot-2023-06-19-at-15.56.27.png\"></a></div><p>To our handful of users, Zulip itself seems to be operating OK. </p>\n<p>I did a restart-server a couple of days ago and saw no error messages on the console during the restart. Did one again just now, no console error messages. (Memory usage dropped to about 90% right after the restart then creep back up to the 97% range over about 12 hours.)</p>",
        "id": 1595535,
        "sender_full_name": "JP",
        "timestamp": 1687228213
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24468\">@JP</span>: Zulip tries to use all of the memory it detects in the machine -- unused memory is going to waste, in a sense.  Obviously, trying to use <em>more</em> memory than exists is bad, but the ideal is that we're always using it for caches and what-not, since it's so much faster than disk.</p>\n<p>It only detects how much memory is installed when <code>zulip-puppet-apply</code> is run (generally as part of upgrades) so it is not surprising that the memory usage stays the same after doubling what was available (i.e. dropped to 50%) but after the upgrade jumped up to use the newly-detected free space.</p>\n<p>Unless you're seeing OOMs (check via <code>grep \"Killed process\" /var/log/syslog</code>) the memory is not unusual, and not related to the email ingestion errors you're seeing.</p>",
        "id": 1595827,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1687283629
    },
    {
        "content": "<p>The <code>user_activity</code> worker more or less just does a single insert, which should take milliseconds at most, so it stalling for 30s is extremely odd, and points to some system instability.  We've seen <a href=\"#narrow/stream/31-production-help/topic/.5BDjango.5D.20chat.3A.20Timed.20out.20in.20user_activity/near/1414149\">one report of similar</a>, but no clear explanation there, either.</p>\n<p>Can you characterize when those exceptions are happening?  Can you show <code>/var/log/zulip/events_user_activity.log</code> around one of the errors?</p>",
        "id": 1595835,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1687284047
    }
]