[
    {
        "content": "<p>Hi.  I'm trying to debug what has suddenly gone wrong with our Zulip 1.6.0 production installation at <a href=\"http://chat.opentechstrategies.com\" target=\"_blank\" title=\"http://chat.opentechstrategies.com\">chat.opentechstrategies.com</a>.  I'm not a Zulip expert (I didn't install this instance), but I can grep around in logs and do normal sysadmin-y stuff.  The symptoms we're having are that the Zulip server does not appear to be transmitting messages.  When I enter a message into a stream+topic, my browser client indicates that it was sent -- but another person who is supposedly watching that stream+topic (and whom I nick-flagged) does not see the message appear.  Another user says \"I sent messages that went away when I restarted; I restarted because I was unable to edit my messages\".  Also, when I hover over a message I just sent, in the upper right corner of the message box, the refresh, edit, and delete icons are bright red -- which is something I've never seen before (and I wonder what it signifies).</p>",
        "id": 569093,
        "sender_full_name": "Karl Fogel",
        "timestamp": 1524587377
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7673\">@Karl Fogel</span> sounds like the Tornado server is not working (likely the root cause is rabbitmq not working)</p>",
        "id": 569120,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1524589300
    },
    {
        "content": "<p><code>/var/log/zulip/errors.log</code> should have an exception or something.</p>",
        "id": 569121,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1524589309
    },
    {
        "content": "<p>That upper-right corner is the right thing to look at when debugging; the timestamp only appears when a message you sent is confirmed by the server, and an explicit error from the server results in those red icons.</p>",
        "id": 569122,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1524589337
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> Thank you.  I was looking in that error log, but didn't know what to look for.  I'll follow the leads you have given!</p>",
        "id": 569130,
        "sender_full_name": "Karl Fogel",
        "timestamp": 1524589509
    },
    {
        "content": "<p>I would look at the bottom, and expect to find a traceback of some sort, probably happening on startup if you restart the server with <code>scripts/restart-server</code> (it might have given up retrying or something)</p>",
        "id": 569132,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1524589553
    },
    {
        "content": "<p><a href=\"http://zulip.readthedocs.io/en/latest/production/troubleshooting.html\" target=\"_blank\" title=\"http://zulip.readthedocs.io/en/latest/production/troubleshooting.html\">http://zulip.readthedocs.io/en/latest/production/troubleshooting.html</a> may help</p>",
        "id": 569133,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1524589572
    },
    {
        "content": "<p>Thank you so much, Tim.</p>",
        "id": 569357,
        "sender_full_name": "Karl Fogel",
        "timestamp": 1524597257
    },
    {
        "content": "<p>(full reboot of the machine did fix it, but we can still analyze the logs forensically)</p>",
        "id": 569365,
        "sender_full_name": "Karl Fogel",
        "timestamp": 1524597419
    },
    {
        "content": "<p>Cool.  I'd also recommend you upgrade to Zulip 1.8 -- it's a lot more stable and functional <span class=\"emoji emoji-1f603\" title=\"smiley\">:smiley:</span></p>",
        "id": 569378,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1524598814
    }
]