[
    {
        "content": "<p>Is it possible to configure more than one self hosted Jitsi server to be used by Zulip? If yes is there documentation or do we just list multiple instances? If no, can it be easily added?</p>",
        "id": 1362944,
        "sender_full_name": "gl2k000",
        "timestamp": 1649447436
    },
    {
        "content": "<p>That's not currently supported, though a per-realm setting is planned in <a href=\"https://github.com/zulip/zulip/pull/17914\">#17914</a>, and <span class=\"user-mention silent\" data-user-id=\"17516\">Gaurav Pandey (ligmitz)</span> is working on it in <a href=\"https://github.com/zulip/zulip/pull/19788\">#19788</a>.</p>",
        "id": 1362953,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1649447740
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"23786\">@gl2k000</span> is your use case just a different Jitsi server for different realms, or something else?</p>",
        "id": 1363249,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1649462635
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> , it's to have different Jitsi servers as options within the same realm for users.  In case one is unavailable for some reason.  Sorry for the delayed reply but was on vacation. :)</p>",
        "id": 1370810,
        "sender_full_name": "gl2k000",
        "timestamp": 1650483375
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"23786\">@gl2k000</span> what are you imagining the UI would be for selecting a Jitsi server to use?  I suppose I could imagine making the video call button pop up a menu, but that seems less convenient.</p>",
        "id": 1370814,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1650483879
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> maybe similar to mentions.  When you start a mention and type @, it provides a list of available options.</p>",
        "id": 1371207,
        "sender_full_name": "gl2k000",
        "timestamp": 1650561291
    },
    {
        "content": "<p>So if there are multiple options for video call service, when you select the camera it can present you with options similar to when you do a mention.  If there is only one option then that option is posted like currently designed.</p>",
        "id": 1371208,
        "sender_full_name": "gl2k000",
        "timestamp": 1650561342
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>  this feature would also allow users to select the preferred service and have multiple options.  Example, if your audience typically uses Jitsi you choose Jitsi from the options.  If you have an audience that uses Zoom, and you have Zoom configured as a conference option, then you can simply select Zoom.  This would make conferencing more flexible and provide some sort of makeshift redundancy.</p>",
        "id": 1371213,
        "sender_full_name": "gl2k000",
        "timestamp": 1650561591
    },
    {
        "content": "<p>I have groups of people that prefer Jitsi while other groups prefer Zoom.  If I could configure both services and select the better option for the group that I'll be conferencing with, that would be ideal.</p>",
        "id": 1371214,
        "sender_full_name": "gl2k000",
        "timestamp": 1650561644
    },
    {
        "content": "<p>Yeah, I understand how that might be useful for different technologies -- but not the use case for multiple Jitsi options.</p>",
        "id": 1372002,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1650664306
    },
    {
        "content": "<p>We'd likely take a contribution to allow configuring more than one video call provider, with the video call button presenting a menu if more than one is enabled for an organization.</p>",
        "id": 1372003,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1650664352
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> , thank you.  Wish I was a coder and would make it happen.  Unfortunately I'm not.  Appreciate you going over the request.</p>",
        "id": 1372993,
        "sender_full_name": "gl2k000",
        "timestamp": 1650907985
    }
]