[
    {
        "content": "<p>Hi! I tried to install Zulip on a production server and to my surprise it overwrote the default nginx configuration at <code>/etc/nginx/nginx.conf</code>. Mainly, it changed the default user from <code>www-data</code> to <code>zulip</code>, which is... Kind of intrusive?<br>\nIs this expected from the installation script?<br>\nAlso, can I make the self-hosted zulip server work by using regular <code>www-data</code> nginx username?<br>\nCheers.</p>",
        "id": 1427043,
        "sender_full_name": "Thomas Barusseau",
        "timestamp": 1661792923
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"9\" href=\"/#narrow/stream/9-issues/topic/Nginx.20config.20overwritten.20.28self-hosted.29\">#issues &gt; Nginx config overwritten (self-hosted)</a> by <span class=\"user-mention silent\" data-user-id=\"2187\">Greg Price</span>.</p>",
        "id": 1427175,
        "sender_full_name": "Notification Bot",
        "timestamp": 1661799438
    },
    {
        "content": "<p>Yeah, this is expected. It is indeed intrusive, but doing controlling the <code>nginx</code> configuration allows us to ensure <code>nginx</code> has a secure SSL configuration for Zulip, for example.</p>\n<p><a href=\"https://zulip.readthedocs.io/en/latest/production/requirements.html#general\">https://zulip.readthedocs.io/en/latest/production/requirements.html#general</a> details that we expect a dedicated machine.</p>",
        "id": 1427225,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1661801595
    },
    {
        "content": "<p>We don't support running other services on a self-hosted Zulip host (though of course you can share a single hardware host using virtualization or <code>docker-zulip</code>). While I'd like to support every way someone might want to run the software in principle, and we have plans for restructuring how we manage dependencies that might make it feasible, right now we have no easy path to supporting it without dramatically increasing either the complexity of installing Zulip or the complexity of providing responsive free support to self-hosted Zulip users through this stream.</p>",
        "id": 1427229,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1661801749
    },
    {
        "content": "<p>Thanks for the answer! I missed the part were self-hosted expects to be the <strong>only thing</strong> running on the system, might wanna put it at the beginning of the zulip server installation guide? I have no idea if you can modify this document: <a href=\"https://zulip.readthedocs.io/en/stable/production/install.html\">https://zulip.readthedocs.io/en/stable/production/install.html</a><br>\nThank god I was able to recover pretty fast from the failed installation, but I totally didn't expect the software to overwrite existing configurations during installation without notifying me</p>",
        "id": 1427230,
        "sender_full_name": "Thomas Barusseau",
        "timestamp": 1661801767
    },
    {
        "content": "<p>I feel like it used to be on the installer page; must have been moved out in a reorganization at some point.</p>",
        "id": 1427263,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1661802982
    },
    {
        "content": "<p>So our first sentence is this:</p>\n<blockquote>\n<p>To install a Zulip server, you'll need an Ubuntu or Debian system that satisfies                         <br>\n<a href=\"http://requirements.md\">the installation requirements</a>.</p>\n</blockquote>\n<p>We could change it to:</p>\n<blockquote>\n<p>To install a Zulip server, you'll need a dedicated Ubuntu or Debian system that satisfies                         <br>\n<a href=\"http://requirements.md\">the installation requirements</a>.</p>\n</blockquote>",
        "id": 1427265,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1661803096
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24645\">@Thomas Barusseau</span> would that have caught your attention? I could imagine doing something more explicit, but am sensitive to adding more words potentially just making folks skim over important information.</p>",
        "id": 1427266,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1661803141
    },
    {
        "content": "<p>That's great, maybe emphasize on the word? I don't know, it's just that it must be made clear since it's a pretty important requirement. But even without the emphasis, yes it's better this way. Thank you!</p>",
        "id": 1427287,
        "sender_full_name": "Thomas Barusseau",
        "timestamp": 1661804061
    }
]