[
    {
        "content": "<p>Hi, we're currently testing Zulip 5.5 and just configured authentication via OIDC (Keycloak). Is it possible to map more attributes like the avatar and roles, without relying on LDAP?</p>",
        "id": 1417110,
        "sender_full_name": "Fabian Schumacher",
        "timestamp": 1659989341
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24533\">@Fabian Schumacher</span> I don't think that's possible today. <span class=\"user-mention\" data-user-id=\"10349\">@Mateusz Mandera</span> can perhaps comment on how complex it would be to add support for that.</p>",
        "id": 1417141,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1659996625
    },
    {
        "content": "<p>Hmm, depends on the attributes, because specifically avatar and roles would be harder since we don't have an existing mechanism non-ldap backends to sync these I think. Actual custom attributes in the sense of <a href=\"https://zulip.com/help/add-custom-profile-fields\">https://zulip.com/help/add-custom-profile-fields</a> should be easy to implement this since <a href=\"https://github.com/zulip/zulip/commit/c54b48452d7336bf70f181253e1a193c0bbf238b\">c54b48452d7336bf70f181253e1a193c0bbf238b</a> was made very general so that it would easily extend to other backends than saml. </p>\n<p><span class=\"user-mention\" data-user-id=\"24533\">@Fabian Schumacher</span> Can you say more about this info would be given to zulip via OIDC? Would it be in the form of additional values fetched from the /userinfo endpoint? How does that work for the avatar specifically since that's image data rather than a simple string?</p>",
        "id": 1417369,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1660042651
    },
    {
        "content": "<p>We were thinking about mapping user roles and also avatars. Not sure how Keycloak handles these attributes in the response but we decided to just use LDAP for attribute mapping. Thanks anyways :)</p>",
        "id": 1417576,
        "sender_full_name": "Fabian Schumacher",
        "timestamp": 1660073824
    },
    {
        "content": "<p>Images could be fetched from the userinfo endpoint using data urls (as in data:[&lt;mediatype&gt;][;base64],&lt;data&gt;). Was there an option to set which scopes to use with OIDC? I think that avatar would probably be under a different scope than the default ones.</p>",
        "id": 1417850,
        "sender_full_name": "Jussi Talaskivi",
        "timestamp": 1660107072
    },
    {
        "content": "<p>Oh. The standard says that picture claim is actually an URL to the image and it is under the profile scope.</p>",
        "id": 1417862,
        "sender_full_name": "Jussi Talaskivi",
        "timestamp": 1660109238
    }
]