[
    {
        "content": "<p>This report seems concrete enough to investigate, so reposting here:</p>\n<blockquote>\n<p>Trying to mark a topic with thousands of messages as resolved on latest Zulip (6.1). It runs super slow and eventually triggers an OOM on a 8GB memory machine.</p>\n<p>There's a postgres process taking a CPU core 100% all the time.</p>\n</blockquote>",
        "id": 1554395,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1682369331
    },
    {
        "content": "<p>Interesting, probably worth trying to reproduce after I finish <a href=\"https://github.com/zulip/zulip/pull/18899\">#18899</a>, which will certainly help here.</p>",
        "id": 1554416,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1682369992
    },
    {
        "content": "<p>Though resolving is only a topic move, not a stream move, so shouldn't touch the same ACL codepaths.</p>",
        "id": 1554417,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1682370047
    },
    {
        "content": "<p>Yeah, agreed, but I'm doing enough cleanup to confusing variable names and the like that I think it might be materially easier to debug afterwards.</p>",
        "id": 1554470,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1682373515
    },
    {
        "content": "<p>(reposting from issue here as well)<br>\nI also run a 6.1 instance with Postgres 13 and have encountered this as well. This happened in a large topic with 10K+ messages. I tried to recreate the issue in a large topic clicking the \"mark as resolved\" button once but could not recreate the issue. It appears to happen when a user clicks the \"mark as resolved\" button multiple times. The update query against the stream's messages takes 60+ seconds and a user may be wondering why clicking the button hasn't done anything and clicks it again, or a few more times. This causes multiple update queries to be created using all of the server's resources. </p>\n<p>Perhaps a check is needed if an update query is already running for a topic so the button cannot be clicked multiple times?</p>\n<p>Let me know if any more information is needed.</p>",
        "id": 1597713,
        "sender_full_name": "Isaac",
        "timestamp": 1687536654
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"27272\">@Isaac</span> thanks for the report! If the issue requires multiple clicks, I wonder if what we're seeing is some form of deadlock between the multiple clicks. We should at least open an issue for providing a loading spinner on mark-as-resolved-checkbox buttons -- that seems clearly helpful as independent from the existing work tracked in <a href=\"https://github.com/zulip/zulip/pull/18899\">#18899</a> for performance issues.</p>",
        "id": 1597929,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1687547176
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> did you end up creating an issue as described above (for providing a loading spinner and such)?</p>",
        "id": 1602967,
        "sender_full_name": "Andrew Martin",
        "timestamp": 1688398789
    },
    {
        "content": "<p>No; I'm mostlyon parental leave so don't have time to do so right now, but it'd be great if someone took care of that.</p>",
        "id": 1603420,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1688448522
    },
    {
        "content": "<p>Filed <a href=\"https://github.com/zulip/zulip/pull/26190\">#26190</a>.</p>",
        "id": 1604074,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1688560666
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"12178\">@Alex Vandiver</span> thank you!</p>",
        "id": 1604078,
        "sender_full_name": "Andrew Martin",
        "timestamp": 1688560847
    },
    {
        "content": "<p>I also don't think that <a href=\"https://github.com/zulip/zulip/pull/18899\">#18899</a> is relevant here, because it's a topic move, not a stream move, so ACLs and UserMessage rows don't change.</p>",
        "id": 1604079,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1688560897
    }
]