[
    {
        "content": "<p>Hi, is there a way to slow down email sending to something like 1 per second? We currently have Stream Email notifications enabled for all users, and large streams may contain hundreds of users, which means Zulip tries to send out hundreds of missed notification emails in a short period of time. This is straining our Exchange server and causing outgoing emails to fail.</p>",
        "id": 1396358,
        "sender_full_name": "Ivan Ou",
        "timestamp": 1656109641
    },
    {
        "content": "<p>Zulip doesn't currently have anything like that, no.  In fact, we've done work to optimize it to be able to send emails as fast as possible, to prevent them from lingering in the local RabbitMQ queue.</p>\n<p>Zulip should retry any emails which Exchange sends it a failure on, so there should be no email loss there.  But I understand that's not being friendly to your Exchange server.</p>",
        "id": 1396371,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1656110401
    },
    {
        "content": "<p>I see, thanks for your reply Alex</p>",
        "id": 1396416,
        "sender_full_name": "Ivan Ou",
        "timestamp": 1656114688
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"19092\">@Ivan Ou</span> I'd be curious to hear more about why you have stream email notifications enabled for all users in all streams; that's not a typical configuration.</p>",
        "id": 1398159,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1656450299
    },
    {
        "content": "<p>Hi Tim, our user desktop environments are locked down so Windows Action Center is disabled.  Which means browser notifications that disappear after a few seconds are not accessible to the users. If you aren't actively using your computer, you'll never know you got a message.</p>",
        "id": 1398164,
        "sender_full_name": "Ivan Ou",
        "timestamp": 1656451128
    },
    {
        "content": "<p>I see, thanks for the context. I expect for some users, having a habit of checking their Zulip when returning to their computer would work, but I can see why that would push you towards a default of having every message do email notifications.</p>",
        "id": 1398173,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1656452156
    },
    {
        "content": "<p>I think this is more of a response from users not accustomed to this type of system. Once activity picks up, they'll quickly get overwhelmed by the number of emails and turn stream email notifications off. So I think this is really just a temporary solution to get the ball rolling.</p>",
        "id": 1399290,
        "sender_full_name": "Ivan Ou",
        "timestamp": 1656635997
    }
]