[
    {
        "content": "<p>Hello all,</p>\n<p>I hope you are doing well.</p>\n<p>We have deployed a Zulip server on AWS EC2, which is behind an Application Load Balancer and configured with an Auto Scaling Group (ASG) with a minimum of 1 instance and a maximum of 1 instance. The purpose of the ASG is to allow us to restart or redeploy the EC2 instance while retaining the previous state of the Zulip application. To achieve this, we need to persist the data in Amazon EFS (Elastic File System), which is a network file system in AWS.</p>\n<p>My question is, which folders or paths should we persist in EFS? This way, whenever a new instance is launched, we can restore it to the previous state using the persistent data stored in EFS, rather than relying solely on backups. Although we have backup scripts to restore the instance from a previous state, relying on persistent data in EFS would be faster and more efficient.</p>\n<p>Thank you</p>",
        "id": 1572970,
        "sender_full_name": "Ahsan Bano",
        "timestamp": 1684523211
    },
    {
        "content": "<p>Is all data/configurations saved just on postgresql? in /var/lib/postgresql/14/main/?</p>",
        "id": 1573955,
        "sender_full_name": "Ahsan Bano",
        "timestamp": 1684746635
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"27028\">@Ahsan Bano</span> I think <a href=\"https://zulip.readthedocs.io/en/latest/production/export-and-import.html#what-is-included\">https://zulip.readthedocs.io/en/latest/production/export-and-import.html#what-is-included</a> and the following section are the best thing to read on this topic.</p>",
        "id": 1574618,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1684804557
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>   Thank you for your reply, much appreciated.</p>\n<p>I have read through that article, and it explains the backups and restore steps. My concern is whether there is any other way to persist the data in an EFS to facilitate faster restoration of the Zulip app, rather than solely relying on backups</p>",
        "id": 1574832,
        "sender_full_name": "Ahsan Bano",
        "timestamp": 1684851247
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"27028\">@Ahsan Bano</span> read that more carefully -- the point is that page documents the places that Zulip stores persistent state in addition to the database, so it's precisely the set of places you would need to think about if you're trying to do something fancy with an EFS as well.</p>",
        "id": 1575401,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1684884433
    }
]