[
    {
        "content": "<p>Hi!<br>\nIs this the correct place to ask some questions about installation problems on Debian Stretch? Like nginx always failing to listen to a certain address on a multi-IP host, because it tries to always bind to 0.0.0.0:80 instead of a specific IP?</p>",
        "id": 782242,
        "sender_full_name": "Ingo Juergensmann",
        "timestamp": 1566652611
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"13244\">@Ingo Juergensmann</span> yes!</p>",
        "id": 782426,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1566775153
    },
    {
        "content": "<p>You'll need to post more details on what you're trying to do, your current config files, etc. to get help.</p>",
        "id": 782427,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1566775196
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"13244\">Ingo Juergensmann</span> yes!</p>\n</blockquote>",
        "id": 782438,
        "sender_full_name": "Radovan Kavicky",
        "timestamp": 1566779421
    },
    {
        "content": "<p>In short: <br>\nThe installation script always fails when starting nginx. It moves a fresh nginx configuration with (I think) puppet into place, although I think I have changed the template somewhere under config/lib/... <br>\nRestarting nginx during the script then complains because 0.0.0.0:80 is already bound by my Apache on that virtual machine and I need nginx running on a dedicated, separate IP on that host. <br>\nBasically the same will be with Postgresql installation. I don't want to have Postgresql installed on that VM, because the Postgresql Server is already installed on a different machine. Of course it would be a way to first proceed with the installation locally, configure everything and then dump the database and import it on the other VM, but I'm unsure how e.g. updates to Zulip would react to this. </p>\n<p>In long: <br>\nI think Zulips installations script is overly complex. It tries to be smart enough to install everything that is needed on a fresh server installation with no other services. Fair enough. But instead of assuming certain things like bind to all IP addresses by default or install a database server, because it cannot find one locally, does not mean that this is good way to do things. Maybe when you would have a command line switch to the install script to differentiate between normal and expert mode, where expert mode would result in questions like \"On which IP address nginx should listen?\" or \"I cannot find Postgresql installed on this host, shall I install it or do you want to use Postgresql on a remote host?\"<br>\nSo this would avoid such corner cases like mine where the installation scripts just assumes things that just won't work, because there are already other services around that are listening to IP ports or being installed on a remote host.<br>\nI think Zulip is nice and shiny and I would like to use it. It seems to be nicer than Mattermost, but under the current circumstances I don't think it is manageable for me to maintain it in my spare time, when I ever will be able to successfully install it. Maybe I give it a try on a different virtual machine just for the purpose of trying out and gather experience with it, especially with updates, but I would like to avoid setup new VMs just for a single purpose, because in the long run it generates a lot of overhead. <br>\nAnd then again, when you are stuck with this installation problems, you might want to uninstall zulip again, but I did not find any sane way to remove everything that got installed by zulip, because there doesn't seem to be a uninstall script as well.</p>\n<p>In the end I would be happy to see a native Debian package being available (I saw some discussions about Debian packages here) that will be able to take care of certain aspects as described above. </p>\n<p>Maybe I missed some easy things during installation, because I'm not used to use puppet and certainly made some mistakes when trying to fix my issues, but that's why I give some feedback here, in the hope that a) maybe the installation script gets enhanced or b) someone comes up with an easy solution. :-) <br>\nLooking forward to your answers! :-)</p>",
        "id": 782581,
        "sender_full_name": "Ingo Juergensmann",
        "timestamp": 1566807031
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"13244\">@Ingo Juergensmann</span> we're clear in our documentation that we don't support installing Zulip on a system hosting other sites, and we recommend installing your Zulip server in a dedicated VM or container, both for convenient uninstallation and to avoid all the complexity of avoiding conflicts with all the other services one might want to run.</p>\n<p>We do document how to use postgres hosted on a separate machine.</p>",
        "id": 782774,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1566846058
    },
    {
        "content": "<p>Ok, this is then very clear: Zulip is nothing for me then. Bad luck.</p>",
        "id": 782778,
        "sender_full_name": "Ingo Juergensmann",
        "timestamp": 1566847144
    },
    {
        "content": "<p>Has anybody noticed the install script get stuck the following:</p>\n<div class=\"codehilite\"><pre><span></span><code>The following NEW packages will be installed:\n     apt-transport-https\n</code></pre></div>\n\n\n<p>Its been stuck at this part for past 10-15 minutes now. I am trying to install version 2.1.4 on debian buster</p>",
        "id": 978288,
        "sender_full_name": "Tej Gill",
        "timestamp": 1596859443
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"13286\">@Tej Gill</span> I've never seen that before, but it's almost certainly some sort of networking problem -- that's just <code>apt install</code> that's hanging.</p>",
        "id": 979556,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1597017517
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/31-production-help/topic/Problems.20with.20installation.20on.20Debian.20Buster/near/979556\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"13286\">Tej Gill</span> I've never seen that before, but it's almost certainly some sort of networking problem -- that's just <code>apt install</code> that's hanging.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> Thank you for responding. It is strange. I was able to run the same script without any issues on Ubuntu 18.04 right after that.</p>",
        "id": 979571,
        "sender_full_name": "Tej Gill",
        "timestamp": 1597017789
    },
    {
        "content": "<p>It could easily be a transient issue with your Internet connection.</p>",
        "id": 979590,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1597018193
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> I have another issue that I needed to discuss with you. I'll create a new topic under this stream and mention you. When you get a chance please look into it. - Thanks</p>",
        "id": 979595,
        "sender_full_name": "Tej Gill",
        "timestamp": 1597018313
    },
    {
        "content": "<p>No need to mention me; I read everything in this stream regardless.</p>",
        "id": 979596,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1597018342
    }
]