[
    {
        "content": "<p>Hi Zulip people,<br>\nfirstly, thank you all  for creating this amazing piece of open source software, I really love it.</p>\n<h1>My problem</h1>\n<p>I have managed to set up a Zulip server for my department at University without major problems. Zulip's detailed documentation really made the installation process a cake walk. Right now I am trying to get Zulip to work with Zoom. I followed the instructions on the corresponding documentation page, but something is not working. Having completed the installation on the server, I can neither install or authorize the Zoom app with my Zoom account.</p>\n<h1>What I have done</h1>\n<p>Let me be more specific about what I did:</p>\n<ul>\n<li>I have created an <code>OAuth</code> Zoom app, being user-managed and not published on the marketplace,</li>\n<li>I have set the <code>Redirect URL for OAuth</code> and <code>Whitelist URL</code> according to the documentation page,</li>\n<li>I have added the <code>meeting:write</code> tag in the <code>Scopes</code> tab,</li>\n<li>I have added the <code>Client's ID</code> and <code>Client Secret</code> provided by Zoom in the corresponding files in the server,</li>\n<li>I have restarted the server and without any errors.</li>\n</ul>\n<h1>What I have observed</h1>\n<p>I have repeated the above twice and could not get it to work. Here is what I have observed:</p>\n<ul>\n<li>Using my university Zoom account with Zulip, I cannot install the Zoom App that I have build above, e.g. clicking the Installation button on the Activation tab in the Zoom App screen directs me to a page where I receive an error message <code>You cannot authorize the app</code> and it should be pre-approved by the account admin of my University. I did contact my admin and he is saying that the pre-approval should not be needed, because it is a user-managed app, and he will not pre-approve the app.</li>\n<li>No other user can install the Zoom app, because it says it has not been published yet.</li>\n<li>I have repeated the above steps with a new Zoom account that is not connect to my University (so I am the admin). If I now click the Installation button I can approve the app, but then I am redirected to a page on my Zulip server  that shows the following JSON table: <code>{\"result\":\"error\",\"msg\":\"Missing 'state' argument\",\"var_name\":\"state\",\"code\":\"REQUEST_VARIABLE_MISSING\"}</code></li>\n</ul>\n<p>I searched the Issue board of Zulip's Github page and found issue <a href=\"https://github.com/zulip/zulip/pull/15878\">#15878</a> which mentions that the Zoom API changed and configuration steps have been updated. However, the corresponding link in there is not valid anymore.</p>\n<p>Does anybody have an idea about what I am doing wrong or where the problem could be?<br>\nIs my Zoom admin right about the Zoom app permissions and that it suffices that is user-managed?</p>\n<p>Any help is very appreciated!</p>\n<p>It is late here and I have to go offline for now,<br>\nhave a good day/night everybody!</p>\n<p>Florian</p>",
        "id": 1094102,
        "sender_full_name": "Florian Atteneder",
        "timestamp": 1609974526
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"18440\">@Florian Atteneder</span> so, I believe your admin is incorrect -- the current Zoom integration requires admins to pre-approve the app.</p>",
        "id": 1098284,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1610583641
    },
    {
        "content": "<p>(It was written before Zoom added the newer user-managed app feature that does not require pre-approval)</p>",
        "id": 1098285,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1610583662
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"699\">@Anders Kaseorg</span> do you think we could adjust the documentation for how to setup self-service Zoom integrations to use the user-managed system even if we haven't migrated <a href=\"http://zulip.com\">zulip.com</a> yet?  Or should we just push to migrate <a href=\"http://zulip.com\">zulip.com</a>?</p>",
        "id": 1098286,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1610583717
    },
    {
        "content": "<p>We already adjusted the documentation that way in <a href=\"https://github.com/zulip/zulip/pull/16092\">#16092</a>.</p>",
        "id": 1098397,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1610600757
    },
    {
        "content": "<p>Thank you for your replies. I am still confused about the pre-approval.</p>\n<p>From the link to the zoom page mentioned in <a href=\"https://github.com/zulip/zulip/pull/16092\">#16092</a> I read up on the difference between user-managed and account-level app. If I understand the Zoom documentation correctly, then the whole purpose of making the app user-managed is just that the user, and not the admin, has to approve the app in order to be able to use it.<br>\nHowever, if you take a look on the section 'Public and Private Apps' on the same page it says </p>\n<blockquote>\n<p>A Private app is an application created by and exclusively for an individual developer account. These apps can be installed by account administrators to help manage their account or interact with Zoom products and services.</p>\n</blockquote>\n<p>Could this be the reason for the necessity of a pre-approval by the admin?</p>\n<p>The documentation then continues with </p>\n<blockquote>\n<p>Private apps are exclusively intended for use on the development account on which they were created. To request a publishable URL for users outside your account, reference our guide to [Sharing Private Apps].</p>\n</blockquote>\n<p>So it looks like I will have to generate a publishable URL too, so that external users (external from the University Zoom account) can also use the Zoom integration. I guess at least this step will require a pre-approval by the admin.<br>\nAccording to the section Publishable URL Expiry in the Zoom documentation, the publishable URL seems to be not a permanent solution, because its validity is limited to 30 days.</p>\n<p>Can I ask you what is the recommended way to make the Zoom App also available to external users?<br>\nWould it not be better to make the app public right from the start?</p>\n<p>Let me know if this discussion goes out of scope, I could also ask on the Zoom forum.</p>",
        "id": 1098458,
        "sender_full_name": "Florian Atteneder",
        "timestamp": 1610615553
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"18440\">@Florian Atteneder</span> I think asking on the Zoom forum as well would be helpful.  But I think a private app should be fine if only Zulip users who are on the University Zoom account need to be able to create Zoom calls using Zulip.  (Other users should be able to join calls created that way).</p>",
        "id": 1100093,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1610837650
    },
    {
        "content": "<p>Hello all,<br>\nI think I found the answer.</p>\n<p>While I was preparing a post for the Zoom developer forum I stumbled upon this <a href=\"https://support.zoom.us/hc/en-us/articles/360032447812-Managing-Zoom-Marketplace\">Zoom admin documentation page</a>. Apparently, there are settings that can enable a pre-approval process also for user-managed apps, although the main Zoom documentation page says that user-managed app can be managed and authorized by users themselves, cf. <a href=\"https://marketplace.zoom.us/docs/guides/build#account-level-user-managed-apps\">https://marketplace.zoom.us/docs/guides/build#account-level-user-managed-apps</a></p>\n<blockquote>\n<p>A User-managed app is an application which is installed by individual users, and thus requires authentication on behalf of each user. These apps have specific access set for Zoom APIs which manage an individual user’s content. User-managed apps allow an end-user to control the authorization and deauthorization of the app, allowing the user to protect and manage control of their Zoom account. An example of a User-managed app could include any application which links to specific users to use Zoom, such as an individual’s calendar extension or an app that allows users to create meetings for themselves. The Zoom Marketplace requires OAuth authentication for creating User-managed apps.</p>\n</blockquote>\n<p>So I think the only options left now are to either convince my admin to approve the app or to live without the Zoom integration.</p>",
        "id": 1106448,
        "sender_full_name": "Florian Atteneder",
        "timestamp": 1611609377
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> <span class=\"user-mention\" data-user-id=\"699\">@Anders Kaseorg</span> <br>\nThank you for your replies and your help!</p>",
        "id": 1106449,
        "sender_full_name": "Florian Atteneder",
        "timestamp": 1611609409
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"18440\">@Florian Atteneder</span> I see, so your thinking is that your IT enabled a setting to require pre-approval even for user-managed apps?  It'd be great if you can confirm once you've talked with them whether that's indeed the cause.</p>",
        "id": 1106473,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1611613742
    },
    {
        "content": "<p>Yes I do, especially because this option is enabled by default, see admin documentation.<br>\nI will let you know.</p>",
        "id": 1106481,
        "sender_full_name": "Florian Atteneder",
        "timestamp": 1611613942
    }
]