[
    {
        "content": "<p>I have a server with Zulip set up, and it's working very good. But the android client has problems connecting to it.<br>\nI have installed my certificate on the device, but at the first page that it gets the address to the server, it won't pass.<br>\nI tested it using Fiddler. I also installed my Fidder's certificate on the device, and let Fiddler decrypt the  traffic. When Fiddler is in the middle, it works okay and everything works fine. But if I connect directly, it won't work.<br>\nDoes anyone have any idea where the problem could be?<br>\n(BTW, I don't have an android device at hand. Mine is a Nokia N9 with the original Meego! It is completely unsupported!)</p>",
        "id": 189916,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1492632243
    },
    {
        "content": "<p>Anyone has any idea about my previous message? And I now have an android device at hand.</p>",
        "id": 190414,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1492716513
    },
    {
        "content": "<p>Anyone???</p>",
        "id": 190883,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1492749378
    },
    {
        "content": "<p>Maybe ask this over at the react native stream</p>",
        "id": 190925,
        "sender_full_name": "Tommy Ip",
        "timestamp": 1492767452
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"Shayan.To@hotmail.com\" data-user-id=\"1073\">@Shayan Toqraee</span> I'm not sure what the precise problem is, but we only have tested using a normal SSL certificate in the device's SSL chain.  I would expect things like self-signed certificates to be rejected by the app, since accepting them presents a security risk.  </p>\n<p>Can you explain a bit more what Fiddler is?  It's a bit hard to get that from their website.</p>",
        "id": 191007,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1492795753
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"tabbott@zulipchat.com\" data-user-id=\"7\">@Tim Abbott</span> <br>\nSorry for my delay.<br>\nFiddler is a proxy server. It by default works locally, and sets the default proxy configuration of Windows to go through it. And it shows all the traffic that is going through. They call it a network debugger. (It also works on Linux by using Mono.)<br>\nOne very interesting thing that Fiddler does is that it can decrypt the HTTPS traffic by being a \"man in the middle\". It gives you its root certificate to add it to the trusted root certificates of the browser or OS, so the connections do not complain that the connection is not secure.<br>\nWhat I did was that I changed Fiddler's settings so that it allows remote connections, and added a proxy setting to the WiFi connection settings of the android device. I also added Fiddler's root certificate to the device the same way I added my own root certificate. Fiddler was able to get all the traffic and decrypt it. And everything worked fine this way.<br>\nIs there any differences in the security of the connection when I connected directly or through Fiddler? Both need a root certificate to be installed on the device.<br>\n(The certificate that my Zulip server uses is not itself loaded on the device, the root certificate that was used to sign it was loaded. Fiddler also works the same way.)</p>",
        "id": 191663,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1492884486
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"tabbott@zulipchat.com\" data-user-id=\"7\">@Tim Abbott</span></p>",
        "id": 192151,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1493018388
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"tabbott@zulipchat.com\" data-user-id=\"7\">@Tim Abbott</span> Could you provide me with some way to debug this?</p>",
        "id": 192685,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1493145573
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"tabbott@zulipchat.com\" data-user-id=\"7\">@Tim Abbott</span> About the issue I had about my server, is there a way to have a log of what is exactly happening without having an android development environment?</p>",
        "id": 217938,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1496515537
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"Shayan.To@hotmail.com\" data-user-id=\"1073\">@Shayan Toqraee</span> woah, sorry I missed replying to all your mentions here!</p>",
        "id": 217940,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1496515578
    },
    {
        "content": "<p><span class=\"emoji emoji-1f642\" title=\":simple_smile:\">:simple_smile:</span></p>",
        "id": 217941,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1496515646
    },
    {
        "content": "<p>I guess one thing that may be worth trying is seeing whether our React Native Android app works</p>",
        "id": 217942,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1496515652
    },
    {
        "content": "<p>Since we're planning to replace the older Android app with that, it's probably worth more time debugging this with the future app than the old one</p>",
        "id": 217943,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1496515670
    },
    {
        "content": "<p>Hmm... You're right.</p>",
        "id": 217944,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1496515701
    },
    {
        "content": "<p><a href=\"https://play.google.com/store/apps/details?id=com.zulipmobile&amp;hl=en\" target=\"_blank\" title=\"https://play.google.com/store/apps/details?id=com.zulipmobile&amp;hl=en\">https://play.google.com/store/apps/details?id=com.zulipmobile&amp;hl=en</a></p>",
        "id": 217946,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1496515732
    },
    {
        "content": "<p>I have no reason to believe that one will work either, but it's a much more active development effort, so it's more likely that someone will be able to help you debug this.</p>",
        "id": 217947,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1496515762
    },
    {
        "content": "<p>Could you please provide me with an apk file? I don't have an android device right now (so cannot test), and I might be unable to download it from Play store.</p>",
        "id": 217948,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1496515876
    },
    {
        "content": "<p>Don't have it handy; ask in <a class=\"stream\" data-stream-id=\"48\" href=\"/#narrow/stream/mobile\">#mobile</a>?  We should probably post those on GitHub when we do releases</p>",
        "id": 217950,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1496516097
    },
    {
        "content": "<p>Okay. Thanks.</p>",
        "id": 217959,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1496516299
    },
    {
        "content": "<p>I could sign in using the RN app. =D</p>",
        "id": 219479,
        "sender_full_name": "Shayan Toqraee",
        "timestamp": 1496691205
    }
]