[
    {
        "content": "<p>Dear Team,</p>",
        "id": 28008,
        "sender_full_name": "Kai",
        "timestamp": 1474542032
    },
    {
        "content": "<p>is there any chance to install a production ready zulip with an existing apache2 installation?<br>\nI have got a server up and running which is hosting several web apps and I would like to have zulib beeing one of it.</p>\n<p>thanks<br>\nKai</p>",
        "id": 28009,
        "sender_full_name": "Kai",
        "timestamp": 1474542092
    },
    {
        "content": "<p>We don't support Apache; it probably would not be too hard to port the Zulip nginx configuration to work with Apache for someone who knows apache well, though, so if you were excited about this use case, I don't think it would be too hard</p>",
        "id": 28013,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1474553901
    },
    {
        "content": "<p>It's probably possible to run Zulip on the same box as the Apache apps, just not under Apache.  The only possible sources of conflict are that another app uses the same port as Zulip, but that can probably be worked around, and sometimes, I believe, people will put nginx in front of Apache, so you need to make sure that Zulip's nginx config doesn't override the other one.</p>",
        "id": 28015,
        "sender_full_name": "Steve Howell",
        "timestamp": 1474554982
    },
    {
        "content": "<p>Hi Tim, thanks.<br>\nI don't think that the apache setup is the problem for me.<br>\nI just don't want to mess up my config when using the production installation script... Is there a way of not using the script but getting the productive environment and not the dev? <br>\nso have everything in place without nginx, I'll take care of the apache proxy part on my own.</p>\n<p>cheers<br>\nKai</p>",
        "id": 28016,
        "sender_full_name": "Kai",
        "timestamp": 1474555116
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"showell30@yahoo.com\">@Steve Howell</span> I don't have other apps using the same ports except apache which would conflict with nginx</p>",
        "id": 28017,
        "sender_full_name": "Kai",
        "timestamp": 1474555505
    },
    {
        "content": "<p>I think your best bet is probably to read the install scripts, and see if there are any conflicts.</p>",
        "id": 28018,
        "sender_full_name": "Steve Howell",
        "timestamp": 1474555564
    },
    {
        "content": "<p>A decent portion of our install happens via <code>puppet</code>.  Have you used that before?</p>",
        "id": 28019,
        "sender_full_name": "Steve Howell",
        "timestamp": 1474555606
    },
    {
        "content": "<p>I did, but including puppet this is quite a challenge</p>",
        "id": 28020,
        "sender_full_name": "Kai",
        "timestamp": 1474555621
    },
    {
        "content": "<p>no i didn't use puppet before, so I am afraid this will kill my system :-(</p>",
        "id": 28021,
        "sender_full_name": "Kai",
        "timestamp": 1474555715
    },
    {
        "content": "<p>I would be cautious about using puppet, but don't be \"afraid\". :)  Here is the nginx manifest:</p>\n<p><a href=\"https://github.com/zulip/zulip/blob/master/puppet/zulip/manifests/nginx.pp\" target=\"_blank\" title=\"https://github.com/zulip/zulip/blob/master/puppet/zulip/manifests/nginx.pp\">https://github.com/zulip/zulip/blob/master/puppet/zulip/manifests/nginx.pp</a></p>",
        "id": 28022,
        "sender_full_name": "Steve Howell",
        "timestamp": 1474555992
    },
    {
        "content": "<p>Most of Zulip's install is pretty self-contained, but nginx is an exception--we do write to files like <code>/etc/nginx/nginx.conf</code>.</p>",
        "id": 28023,
        "sender_full_name": "Steve Howell",
        "timestamp": 1474556058
    },
    {
        "content": "<p>So you'll want to be sure that you don't already have a file there.</p>",
        "id": 28024,
        "sender_full_name": "Steve Howell",
        "timestamp": 1474556095
    },
    {
        "content": "<p>thanks, perhaps I will just remove this part from the install script, at the end no one knows what is going to happen when doing an upgrade :-) as I don't use nginx this it should do no harm if it will write to this file.</p>",
        "id": 28025,
        "sender_full_name": "Kai",
        "timestamp": 1474556140
    },
    {
        "content": "<p>I guess another thing to be concerned about is that Zulip will take up some system resources, particularly memory, so maybe your best bet is just to get another box to run it on.</p>",
        "id": 28026,
        "sender_full_name": "Steve Howell",
        "timestamp": 1474556159
    },
    {
        "content": "<p>in general memory / cpu is not the problem on my box, but thanks for the hint</p>",
        "id": 28027,
        "sender_full_name": "Kai",
        "timestamp": 1474556263
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"tabbott@gmail.com\">@Tim Abbott</span> Is there a way to tell Zulip's install to tell puppet not to overwrite existing files?</p>",
        "id": 28028,
        "sender_full_name": "Steve Howell",
        "timestamp": 1474556346
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"showell30@yahoo.com\">@Steve Howell</span> Perhaps I'll better try to get this up and running in docker... so this is not going to mess my system if something goes wrong. Going through the docs it seems that docker is also experimental and not for production usage...</p>",
        "id": 28031,
        "sender_full_name": "Kai",
        "timestamp": 1474558839
    },
    {
        "content": "<p>yeah, I don't know much about the state of docker...other folks might have more insight there</p>",
        "id": 28032,
        "sender_full_name": "Steve Howell",
        "timestamp": 1474558921
    },
    {
        "content": "<p>so if anyone could give me a hint if it is worth i try this would be great!, thanks</p>",
        "id": 28033,
        "sender_full_name": "Kai",
        "timestamp": 1474558952
    },
    {
        "content": "<p>Well, there's the docker development environment, which is experimental but also irrelevant since it's for the development environment.  I think there are people using <span class=\"user-mention\" data-user-email=\"galexrt@googlemail.com\">@Alexander Trost</span>'s Dockerfile (<a href=\"https://github.com/galexrt/docker-zulip\" target=\"_blank\" title=\"https://github.com/galexrt/docker-zulip\">https://github.com/galexrt/docker-zulip</a>) in production, but it's not merged into mainline Zulip.</p>",
        "id": 28035,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1474560352
    },
    {
        "content": "<p>Is the issue with apache just that you're already using port 443 for other services?  You could just run your Zulip server on another port.</p>",
        "id": 28036,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1474560393
    },
    {
        "content": "<p>The Zulip puppet upgrade process is designed to show you the changes it would make in a \"dry run\" mode before you apply them, so it's actually reasonably safe against overwriting configuration without your permission.</p>",
        "id": 28037,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1474560459
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-email=\"tabbott@gmail.com\">@Tim Abbott</span> ,</p>\n<p>I'll try to find a way without messing up my whole system and will give the docker a try.</p>",
        "id": 28214,
        "sender_full_name": "Kai",
        "timestamp": 1474610541
    }
]