[
    {
        "content": "<p>Reading about realms in the docs and I'd like to clarify my understanding.</p>\n<p>My ideal scenario would be to host one realm at <a href=\"http://chat.example.com\">chat.example.com</a> and another one at <a href=\"http://comms.example.com\">comms.example.com</a>. Currently I have set up the one realm at <a href=\"http://chat.example.com\">chat.example.com</a>.</p>\n<p>Adding a second realm would require that I define the REALM_HOSTS variable like so:</p>\n<div class=\"codehilite\"><pre><span></span><code>REALM_HOSTS = {\n    &quot;chat&quot;: &quot;chat.example.com&quot;,\n    &quot;comms&quot;: &quot;comms.example.com&quot;\n}\n</code></pre></div>\n<p>Then I need to change the dubdomain of the first realm from <code>''</code> to <code>'chat'</code>.</p>\n<p>Is this correct?</p>",
        "id": 1489121,
        "sender_full_name": "Lachie Chapman",
        "timestamp": 1673404360
    },
    {
        "content": "<p>Furthermore, how does the authentication process work? Users presumably use the same authentication methods to log in to each realm, but the actual accounts are separate?</p>\n<p>I'm using OIDC to authenticate on the first realm and I want the same OIDC authority to authenticate on the second realm. The second realm will be accessible to a subset of users who can access the first realm, and the OIDC provider will handle the process of whether or not to authorise a user based on upstream permissions.</p>\n<p>Will this scenario be how it works when I create the second realm?</p>",
        "id": 1489122,
        "sender_full_name": "Lachie Chapman",
        "timestamp": 1673404880
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24643\">@Lachie Chapman</span> yeah, I think that's correct.</p>",
        "id": 1489128,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1673405426
    },
    {
        "content": "<p>What I would do is configure the OIDC provider to allow everyone in both orgs to authenticate, and then configure the smaller organization to be invite-only, and only invite the users who are allowed to have accounts there.</p>",
        "id": 1489129,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1673405496
    },
    {
        "content": "<p>But you understand the model -- Zulip accounts in different realms are completely independent.</p>",
        "id": 1489131,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1673405550
    }
]