[
    {
        "content": "<p>Can I create realm without subdomain? I have 3.2 server and want to have different realms but user should be able to log-in  using common domain  i.e.  <a href=\"http://zulip.mydomain.com\">zulip.mydomain.com</a> .  I am not exactly able to understand this doc <a href=\"https://zulip.readthedocs.io/en/stable/production/multiple-organizations.html\">https://zulip.readthedocs.io/en/stable/production/multiple-organizations.html</a> <br>\nMy requirement is that the user should log-in  once to access all the streams from different realms where they are stream members from the one screen and not to jump to realms.  Also, creating only one realm is showing all users from different companies  to all other users which  we do not want to avoid spam DMs.</p>",
        "id": 1067381,
        "sender_full_name": "Mahesh Saraswati",
        "timestamp": 1605887182
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"15782\">@Mahesh Saraswati</span> Zulip doesn't support multiple realms using the same subdomain.  The challenge with the model you propose is that the structure of how cookies work in browsers makes it impossible for a single user to be logged into two different realms if they share a domain.</p>",
        "id": 1067465,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1605900177
    },
    {
        "content": "<p>Can you talk more about what you're trying to do?</p>",
        "id": 1067466,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1605900206
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>  </p>\n<ul>\n<li>Our zulip server is hosted as <a href=\"http://zulip.mydomain.com\">zulip.mydomain.com</a> </li>\n<li>We intend to use ldap integration for all users registered at <a href=\"http://mydomain.com\">mydomain.com</a>  from different companies. </li>\n<li>We want user to log-in to <a href=\"http://zulip.mydomain.com\">zulip.mydomain.com</a>  and access all companies' public and private streams with single log-in. </li>\n<li>If we create only one realm then the issue is user can see all the members of <a href=\"http://mydomain.com\">mydomain.com</a> and send them PM without their permission. Do we have mechanism of accepting conversation request on first PM?  </li>\n<li>If we create different realms then the issue is user has to log-in separately in each realm. </li>\n<li>\n<p>Q: if we create single realm,<br>\n-- how can I hide all the users who are not members of a company? </p>\n</li>\n<li>\n<p>Q: Can I have common ldap and CAS login across multiple realms ? <br>\n-Q: Can I have all users from across all realms when they registers to a realm subdomain(<a href=\"http://org1.zulip.mydomain.com\">org1.zulip.mydomain.com</a>),  automatically get registered at root domain realm  <a href=\"http://zulip.mydomain.com\">zulip.mydomain.com</a>?  <br>\nCan you suggest a best option for us?</p>\n</li>\n</ul>",
        "id": 1067993,
        "sender_full_name": "Mahesh Saraswati",
        "timestamp": 1605963334
    }
]