[
    {
        "content": "<p>I'm upgrading a docker-zulip instance and now redis migrations are failing due to password auth. I suspect this commit <a href=\"https://github.com/zulip/docker-zulip/commit/f2ae767f9a8f3722f20a951c2a387abb4e6f78af\" target=\"_blank\" title=\"https://github.com/zulip/docker-zulip/commit/f2ae767f9a8f3722f20a951c2a387abb4e6f78af\">https://github.com/zulip/docker-zulip/commit/f2ae767f9a8f3722f20a951c2a387abb4e6f78af</a> to be the culprit. I'm guessing redis already had a different pass and now docker-compose is specifying a new one. Do any of you know what the default redis pass was prior to this change?</p>",
        "id": 835576,
        "sender_full_name": "Jeaye",
        "timestamp": 1584817146
    },
    {
        "content": "<p>This had to do with me setting the redis secret, but not the redis password for the redis container. Not a zulip issue or migration issue.</p>",
        "id": 835587,
        "sender_full_name": "Jeaye",
        "timestamp": 1584820319
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"8742\">@Jeaye</span> I think it's more likely the issue is that previously your redis instance wasn't expecting authentication at all, and now it's being sent.</p>",
        "id": 836055,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1584900819
    },
    {
        "content": "<p>So you probably need to manually set the appropriate redis password in the container?</p>",
        "id": 836056,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1584900855
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> I mentioned in my second message that I just wasn't setting the redis pass for the container and was only setting the secret.</p>",
        "id": 836059,
        "sender_full_name": "Jeaye",
        "timestamp": 1584901031
    },
    {
        "content": "<p>However, the actual issue I'm still seeing with docker-zulip, and have been seeing with it for a while, is that the certbot generation doesn't seem to kick in properly, even if I delete the <code>cert</code> directory. Have you tested it or used it at all?</p>",
        "id": 836060,
        "sender_full_name": "Jeaye",
        "timestamp": 1584901085
    },
    {
        "content": "<p>For the past few upgrades, I have modified <code>entrypoint.sh</code> to remove the check for whether or not the certbot generation is scheduled. That allows things to be generated, but I've found that docker-zulip doesn't handle the refreshing of the certs automatically either. So it's basically a timer for me. When our chat stops working, since the cert is expired, I update zulip, hoping it's fixed. It hasn't been, so I manually change the entrypoint so the cert is generated and the timer starts again.</p>",
        "id": 836071,
        "sender_full_name": "Jeaye",
        "timestamp": 1584901213
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"8742\">@Jeaye</span> I don't personally run any production systems on <code>docker-zulip</code>, but I don't think we've had reports of the certbot renewal logic not working.  Can you open an issue with details on that including the tracebacks?  It's definitely something we'd want to fix.</p>",
        "id": 836120,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1584903193
    },
    {
        "content": "<p>I was the one who added certbot support; I don't think it's seen any love since it was added and renewal was never working, even when I added it.</p>",
        "id": 836122,
        "sender_full_name": "Jeaye",
        "timestamp": 1584903253
    },
    {
        "content": "<p>My guess is nobody is using it.</p>",
        "id": 836123,
        "sender_full_name": "Jeaye",
        "timestamp": 1584903267
    },
    {
        "content": "<p>(aside from me)</p>",
        "id": 836131,
        "sender_full_name": "Jeaye",
        "timestamp": 1584903376
    },
    {
        "content": "<p>Ahh, OK, that's certainly possible.</p>",
        "id": 836142,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1584903779
    }
]