[
    {
        "content": "<p>We have a single org zulip server with auth done via SAML. Is it possible to add another org but restrict the users which can use the second org using saml? It looks like currently the org URL is not used in the SAML request only the EXTERNAL_HOST</p>",
        "id": 879548,
        "sender_full_name": "Simon",
        "timestamp": 1589624029
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"15388\">@Simon</span> <a href=\"https://zulip.readthedocs.io/en/latest/production/authentication-methods.html#saml\">https://zulip.readthedocs.io/en/latest/production/authentication-methods.html#saml</a> has a note on what to do with multiple subdomains. To restrict users, the only way I could see doing this is by having 2 IdPs - one for the first org, second one for the other org, and manage the set of authorized users on the IdP side. With 2 IdPs configured, you can restrict them to apply to specific organizations with the <code>limit_to_subdomains</code> settings.</p>",
        "id": 879566,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1589636874
    },
    {
        "content": "<p>Thanks for the info but I decided this would be a inconvenient, especially if we ended up with more and more organisations. Instead I added a new feature to the SAML auth backend and submitted a PR. Comments welcome. <a href=\"https://github.com/zulip/zulip/pull/15001\">https://github.com/zulip/zulip/pull/15001</a></p>",
        "id": 879918,
        "sender_full_name": "Simon",
        "timestamp": 1589657423
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"15388\">@Simon</span> that looks like a great approach! I'll try to get a detailed look tomorrow</p>",
        "id": 879926,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1589665038
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> do you need a Github issue for PRs to make it into the upcoming release?<br>\nI see you asked for a code review on this a week ago and it would be really useful to have this in the next release but I'm wondering if the lack of a corresponding issue might mean it falls off the radar...</p>",
        "id": 906067,
        "sender_full_name": "Richard",
        "timestamp": 1592326535
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"15520\">@Richard</span> no, pull requests are just as good as issues for tracking something.  Thanks for flagging this.</p>",
        "id": 906079,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1592326849
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> sorry to be a pain and flag this again... I see it wasn't in your list that you just posted in general.<br>\nI know you mentioned an RC today, so is this likely to make the cut off?<br>\nI see it's been reviewed in Github and it would be really good to see this in the next release if you're happy with the current state so that we can make use of it.</p>",
        "id": 912312,
        "sender_full_name": "Richard",
        "timestamp": 1592953642
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"15520\">@Richard</span> I'll be looking at that when I have a moment; it's just a feature I'd consider delaying the release for.  (The <a class=\"stream\" data-stream-id=\"2\" href=\"/#narrow/stream/2-general\">#general</a> list is just the things considered important, not everything that will get looked at)</p>",
        "id": 912316,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1592954798
    },
    {
        "content": "<p>Ah brilliant, thanks!<br>\nI've pitched using this to a few users in our organisation and was just a little worried we might have to wait for a future release if it didn't make it in ;)</p>",
        "id": 912320,
        "sender_full_name": "Richard",
        "timestamp": 1592954953
    },
    {
        "content": "<p>Well, even if this didn't make it, it's really easy to run a small patch on top of a release.</p>",
        "id": 912324,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1592955358
    },
    {
        "content": "<p>But I expect this one will.</p>",
        "id": 912325,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1592955366
    }
]