[
    {
        "content": "<p>Hi, I am new to Zulip and am setting up a test environment for my organization. I just got S3 file uploads working. I can also get avatars working if I make them publicly available as the documentation states. However, I am utilizing LDAP authentication and pulling avatars from LDAP as well. Making these publicly available on the open internet is a big no no for my organization. I'm trying to figure out if there is any way to either have avatars working in S3 without making them publicly available (like file uploads) or if there is a way to keep file uploads on S3 but keep avatars on the Zulip server's local storage?</p>",
        "id": 718616,
        "sender_full_name": "ostermang",
        "timestamp": 1552508360
    },
    {
        "content": "<p>good question. None of the folks on-line now work on the LDAP or file uploads system, but someone should be around later today.</p>",
        "id": 718620,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1552508838
    },
    {
        "content": "<p>ok, I'll check back later. Thanks!</p>",
        "id": 718633,
        "sender_full_name": "ostermang",
        "timestamp": 1552510263
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"11818\">@ostermang</span> so, just to make sure you understand, they'll be publicly available on secure, random S3 URLs.</p>",
        "id": 718660,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1552512972
    },
    {
        "content": "<p>So, it should not be possible for someone to get access to the avatars without receiving a prior link to them.</p>",
        "id": 718662,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1552512993
    },
    {
        "content": "<p>We don't currently support using different file upload backends for uploads vs. avatars.</p>",
        "id": 718664,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1552513039
    },
    {
        "content": "<p>Working out a solution that fits your security needs is something we could help with as part of a support contract if you're interested.</p>",
        "id": 718666,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1552513074
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> , when I set up the S3 bucket policy according to the Upload Backends documentation, I had avatars working with S3. However, I was able to right click an avatar in the Zulip desktop app and copy the image URL, then open that URL on my cell phone which doesn't have Zulip installed, so they definitely are publicly available if someone knows the URL. The policy does prevent listing objects in the S3 bucket so its kind of security by obscurity. Am I possibly doing something wrong since it doesn't appear to be using random S3 URLs?</p>",
        "id": 718678,
        "sender_full_name": "ostermang",
        "timestamp": 1552515589
    },
    {
        "content": "<p>I think the avatars URLs should look something like <br>\n<a href=\"https://zulip-avatars.s3.amazonaws.com/1234/e80f3c2e13c2875866f4b76aaaaaaa1234512345?x=x&amp;version=3&amp;s=50\" target=\"_blank\" title=\"https://zulip-avatars.s3.amazonaws.com/1234/e80f3c2e13c2875866f4b76aaaaaaa1234512345?x=x&amp;version=3&amp;s=50\">https://zulip-avatars.s3.amazonaws.com/1234/e80f3c2e13c2875866f4b76aaaaaaa1234512345?x=x&amp;version=3&amp;s=50</a></p>",
        "id": 718680,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1552516215
    },
    {
        "content": "<p>(and yeah, it is security only by obscurity)</p>",
        "id": 718682,
        "sender_full_name": "Rishi Gupta",
        "timestamp": 1552516293
    },
    {
        "content": "<p>ok, yea that is the same type of URL I am seeing so I think it is working as expected. Thanks for the info!</p>",
        "id": 718683,
        "sender_full_name": "ostermang",
        "timestamp": 1552516366
    }
]