[
    {
        "content": "<p>Hi there.<br>\nMy users see a \"Zulip account not found\" with a \"Continue to registration\" when they login the first time, with SAML.<br>\nIs it possible to create the account automatically in this scenario?<br>\nThanks</p>",
        "id": 854133,
        "sender_full_name": "Ricardo Duarte",
        "timestamp": 1586957157
    },
    {
        "content": "<p>It will happen if they go through the \"Sign up with SAML\" button instead of \"Log in with SAML\" - otherwise, not without changing the server code a little bit</p>",
        "id": 854145,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1586959110
    },
    {
        "content": "<p>but they are using the Log in with SAML.</p>",
        "id": 854499,
        "sender_full_name": "Ricardo Duarte",
        "timestamp": 1586988560
    },
    {
        "content": "<p>Agree this would be nice to have.</p>",
        "id": 965121,
        "sender_full_name": "pemontto",
        "timestamp": 1596136247
    },
    {
        "content": "<p>This seems like a reasonable setting for us to support; what do you think <span class=\"user-mention\" data-user-id=\"10349\">@Mateusz Mandera</span>?  We have something similar to autocreate users with LDAP.</p>",
        "id": 965248,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1596139015
    },
    {
        "content": "<p>Yeah it would make sense, though ldap auth and saml auth are completely different codepaths and i dont think there's any way to use what we have for ldap in SAML too. A hacky approach would be to just make the <code>is_signup</code> param always <code>1</code> if the backend is SAML, that would skip the \"continue to registration\" page for users without an existing zulip account, and not have any impact  on the others.</p>",
        "id": 967143,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1596207415
    },
    {
        "content": "<p>I think doing conceptually that under an appropriate setting in the SAML configuration is probably reasonable.  (Can probably make it non-hacky by just looking at where we check <code>is_signup</code>)</p>",
        "id": 967374,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1596220094
    },
    {
        "content": "<p>we don't have access to information about the backend used in the place where we decide to show the \"continue to registration\" page, but there was another reasonable place to set <code>is_signup=True</code> where it's not hacky -  <a href=\"https://github.com/zulip/zulip/pull/16009\">#16009</a></p>",
        "id": 968212,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1596286594
    }
]