[
    {
        "content": "<p>Hello! Our zulip testers are reporting an issue where when you first load the webapp or refresh it, Zulip scrolls whatever the current stream is back to a certain past date. The date appears to remain constant for a given user  no matter what stream page is being refreshed, but the date is not the same between all users experiencing this. We've tested clearing cache/cookies etc, as well as making sure there's no unread messages left (thinking perhaps it was related to the last read message), but neither helped. For some users the issue has gone away after a couple days, for others the date is now different but the issue remains.</p>\n<p>Has anybody noticed this or seen it mentioned or reported anywhere already? Thanks!</p>",
        "id": 462879,
        "sender_full_name": "Noe Martinez",
        "timestamp": 1516757978
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"marzib@gmail.com\" data-user-id=\"3748\">@Noe Martinez</span> so, this a historical artifact that we probably should prioritize removing.  I'm pretty sure that point in time is the last message that they've read in the interleaved (\"All messages\") view.</p>",
        "id": 462899,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1516758591
    },
    {
        "content": "<p>I suspect clicking \"All messages\" and hitting \"end\" will make that behavior go away for those users.</p>",
        "id": 462901,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1516758626
    },
    {
        "content": "<p>Interesting! We'll get someone to try that out. And so you suspect it has to do with the last read in that view even if since then they've read all messages (in other views) and their unread count is zero?</p>",
        "id": 462915,
        "sender_full_name": "Noe Martinez",
        "timestamp": 1516759491
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"tabbott@zulipchat.com\" data-user-id=\"7\">@Tim Abbott</span> an affected user tested your theory and it sounds like it does indeed fix the scrolling issue. Thanks! Is it ok if I create a github issue about this so we have a handle to keep track of a permanent fix at some point?</p>",
        "id": 464118,
        "sender_full_name": "Noe Martinez",
        "timestamp": 1516813397
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"marzib@gmail.com\" data-user-id=\"3748\">@Noe Martinez</span> I believe this is <a href=\"https://github.com/zulip/zulip/pull/1529\" target=\"_blank\" title=\"https://github.com/zulip/zulip/pull/1529\">#1529</a>.</p>",
        "id": 464251,
        "sender_full_name": "Greg Price",
        "timestamp": 1516818273
    },
    {
        "content": "<p>excellent, thanks</p>",
        "id": 464255,
        "sender_full_name": "Sean Wallitsch",
        "timestamp": 1516818380
    },
    {
        "content": "<p>Aaah \"scroll\" was not a good enough term to search for this issue by <span class=\"emoji emoji-1f600\" title=\"grinning\">:grinning:</span>. Thanks, Greg!</p>",
        "id": 464258,
        "sender_full_name": "Noe Martinez",
        "timestamp": 1516818481
    },
    {
        "content": "<p>Yeah, I used the secret knowledge that \"pointer\" is the keyword we've used in discussing this issue <span class=\"emoji emoji-1f600\" title=\"grinning\">:grinning:</span> -- it's the term in the code for that last message that the user has read in the \"All messages\" view.</p>",
        "id": 464260,
        "sender_full_name": "Greg Price",
        "timestamp": 1516818647
    },
    {
        "content": "<p>Good to know. Thanks again!</p>",
        "id": 465217,
        "sender_full_name": "Noe Martinez",
        "timestamp": 1516842361
    }
]