[
    {
        "content": "<p>From the application standpoint, are there specific settings recommended when Zulip is accessible to the internet? We're talking about moving our company Zulip so it is available without VPN access for our employees. We currently do LDAP/AD authentication and limit the logins to a specific email domain. The config is anyone can login (assuming the AD/LDAP passes).</p>\n<p>So looking for any recommendations to ensure our internet facing hosted instance stays safe.</p>",
        "id": 620936,
        "sender_full_name": "Scott Russell",
        "timestamp": 1532969541
    },
    {
        "content": "<p>I'm interested in this as well; any answers should likely be documented in the repo as well.</p>",
        "id": 620943,
        "sender_full_name": "Jeaye",
        "timestamp": 1532970053
    },
    {
        "content": "<p>I don't think there's anything specific you need to do on this front; Zulip is of course designed to run exposed to the public Internet.  The main category I'd recommend thinking about is whether you want to setup your firewall to deny the Zulip server access to the rest of your Internal network, since that's a common security practice for managing a firewall boundary (each service should be on one side or the other).</p>",
        "id": 620979,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1532971237
    },
    {
        "content": "<p>Interesting option. Aside from a secure LDAP/AD connection I think that would be perfectly feasible. Thank you.  As a follow up, is there any kind of rate-limiting for login attempts?</p>",
        "id": 620990,
        "sender_full_name": "Scott Russell",
        "timestamp": 1532971723
    },
    {
        "content": "<p>Ahh, right, we have rate-limiting for just about everything other than login attempts right now; so if you're doing LDAP (and not some SSO system) for auth, you'll need to be careful about that.  <a href=\"https://github.com/zulip/zulip/issues/5677\" target=\"_blank\" title=\"https://github.com/zulip/zulip/issues/5677\">https://github.com/zulip/zulip/issues/5677</a> has been stuck for a while; I should probably find someone to pick it up.</p>",
        "id": 620995,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1532971873
    },
    {
        "content": "<p>Doing some quick follow up I see this in the Django 2.0 docs:</p>\n<blockquote>\n<p>Django does not throttle requests to authenticate users. To protect against brute-force attacks against the authentication system, you may consider deploying a Django plugin or Web server module to throttle these requests.</p>\n</blockquote>\n<p>I'm not up to speed on recommended modules for rate limiting authentication in Django. Anyone have experience doing so with a plugin already they want to recommend? I'll keep searching too.</p>",
        "id": 621065,
        "sender_full_name": "Scott Russell",
        "timestamp": 1532973608
    },
    {
        "content": "<p>My thought was to just add this as a built-in feature of Zulip, so users don't need to do something special.</p>",
        "id": 621069,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1532973737
    },
    {
        "content": "<p>Does the Zulip project not use Django plugins for some features? I haven't taken a look at the python modules installed. </p>\n<p>django-axes is a very simple way for you to keep track of failed login attempts, both for the Django admin and for the rest of your site.<br>\n<a href=\"https://github.com/jazzband/django-axes\" target=\"_blank\" title=\"https://github.com/jazzband/django-axes\">https://github.com/jazzband/django-axes</a></p>\n<p>Django Ratelimit provides a decorator to rate-limit views. Limiting can be based on IP address or a field in the request--either a GET or POST variable<br>\n<a href=\"https://github.com/jsocol/django-ratelimit\" target=\"_blank\" title=\"https://github.com/jsocol/django-ratelimit\">https://github.com/jsocol/django-ratelimit</a></p>\n<p>I wouldn't trust myself to write my own, but implementing an existing backend adapter in the django-zulip app I might be able to do. having the time to do it is another issue :(</p>",
        "id": 621106,
        "sender_full_name": "Scott Russell",
        "timestamp": 1532974383
    },
    {
        "content": "<p>I'm still smarting over the fact that I failed to help the mercurial integration as much as I could have. :(</p>",
        "id": 621108,
        "sender_full_name": "Scott Russell",
        "timestamp": 1532974440
    },
    {
        "content": "<p>We do, though in some cases the third-party tool doesn't integrate the way we want to.  E.g. for login attempts, we probably want to rate-limit both by IP and target user, so one can't just use a lot of IP addresses to brute-force a long way on a single target user.</p>",
        "id": 621139,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1532974844
    },
    {
        "content": "<p>(I remember being unsatisfied with <code>django-ratelimit</code> when I looked into it a year or so ago)</p>",
        "id": 621143,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1532974889
    },
    {
        "content": "<p>From my reading the idea of rate limiting by IP gets more complex when reverse proxy is involved. Some of the existing plugins have configs for it, others say the problem exists and to deal with it outside of django.</p>",
        "id": 621271,
        "sender_full_name": "Scott Russell",
        "timestamp": 1532976466
    },
    {
        "content": "<p>We have recommended reverse proxy configuration that passes the right data to Django.</p>",
        "id": 621320,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1532977010
    }
]