[
    {
        "content": "<p>Where might I find the postgres authentication settings on my self-hosted Zulip (6.1) either as separate user/pwd/port/databasename settings, or the postgres connection URL?</p>\n<p>We're setting up nightly third party backups of all our postgres databases to S3 using a third party service (simplebackups).</p>\n<p>I'm trying to find Zulip's postgres connection URL (or postgres user name and password and port and database name)  to add our self-hosted Zulip to our backup list. (We've successfully added the necessary SSH keys to our server (Digital Ocean) so our SimpleBackups account can communicate to initiate backups and schlepp the data to our S3 bucket... so the postgres connection settings user/pwd/port/dbname is all we are missing.)</p>\n<p>I did find the docs to setup those parameters if using a remote database, but did not find the docs for a default on-server postgres configuration. I checked /etc/zulip/zulip-secrets.conf and /etc/zulip/zulip.conf and /etc/zulip/settings.py and the 5 .conf files in /etc/postgresql/14/main without luck.</p>",
        "id": 1592059,
        "sender_full_name": "JP",
        "timestamp": 1686653194
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24468\">@JP</span>: The default deployment for self-hosted Zulip is that PostgreSQL runs on localhost and only listens on localhost and the UNIX socket in <code>/var/run/postgresql/</code>.  It defaults to using \"peer\" authentication for the socket connection, which means that the <code>zulip</code> UNIX user can connect as the PostgreSQL <code>zulip</code> user.  The PostgreSQL <code>zulip</code> user does not have a password set, because it does not use password authentication.</p>\n<p>In short, as the <code>zulip</code> UNIX user on the host, you can connect using <code>postgresql://</code> as your connection string.  Access from any other user or host will require altering <code>/etc/postgresql/*/main/pg_hba.conf</code> and/or using <a href=\"https://www.postgresql.org/docs/current/sql-alteruser.html\"><code>ALTER USER ... PASSWORD '...'</code></a>.</p>",
        "id": 1592239,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1686670570
    }
]