[
    {
        "content": "<p>Is it possible to separate zulip server into two boxes one of them contains the Web server and the other will contains the application server <br>\nWhen someone searches the URL it will hit the web server then the application server</p>",
        "id": 1516786,
        "sender_full_name": "jon",
        "timestamp": 1677758186
    },
    {
        "content": "<p>hello, do you want this for security reason? you could add a reverse proxy then</p>\n<p>at the moment, that should not be doable because nginx is tied to django with unix domain socket</p>\n<p>and it will severely complicate deployment if you need to handle 2 installations</p>\n<div class=\"codehilite\"><pre><span></span><code>root@chat:/etc/nginx/zulip-include# cat upstreams\ninclude /etc/nginx/zulip-include/tornado-upstreams;\n\nupstream django {\n    server unix:/home/zulip/deployments/uwsgi-socket;\n}\n\nupstream localhost_sso {\n    server 127.0.0.1:8888;\n}\n\nupstream camo {\n    server 127.0.0.1:9292;\n}\n</code></pre></div>",
        "id": 1516790,
        "sender_full_name": "RolandK",
        "timestamp": 1677759389
    },
    {
        "content": "<p>Yes, I want to do it for security reasons.</p>",
        "id": 1516792,
        "sender_full_name": "jon",
        "timestamp": 1677759638
    },
    {
        "content": "<p>Can you guide me on how to  add a reverse proxy</p>",
        "id": 1516794,
        "sender_full_name": "jon",
        "timestamp": 1677759935
    },
    {
        "content": "<p>here we go: <a href=\"https://zulip.readthedocs.io/en/latest/production/deployment.html#putting-the-zulip-application-behind-a-reverse-proxy\">https://zulip.readthedocs.io/en/latest/production/deployment.html#putting-the-zulip-application-behind-a-reverse-proxy</a></p>",
        "id": 1516805,
        "sender_full_name": "RolandK",
        "timestamp": 1677760424
    },
    {
        "content": "<p>I want to seperate the web server and the application server each in separate machine</p>",
        "id": 1541698,
        "sender_full_name": "jon",
        "timestamp": 1680696073
    },
    {
        "content": "<p>What are the major causes  for not able to do this ?<br>\nIs it is possible to overcome the problem and successfully perform the separation?</p>",
        "id": 1541746,
        "sender_full_name": "jon",
        "timestamp": 1680703681
    },
    {
        "content": "<p>This is not a deploy technique which Zulip supports, no.</p>\n<p>Zulip has a bunch of moving parts -- the Django server, the Tornado event server, and the nginx server all work together, and are assumed to be on the same host.  Separating them is difficult because we serve static assets from nginx, and want to be able to upgrade those when we upgrade the other pieces.  Django and Tornado also coordinate and rely on nginx to be able to redirect requests between them.  All of these together are really the \"application.\"</p>\n<p>Can you explain a little more about <em>why</em> you're trying to achieve this?  I'm not clear on what you're hoping to achieve from it.</p>",
        "id": 1541749,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1680703896
    },
    {
        "content": "<p>I just want to configure a server one box containing a application server will be in my internal network with firewall and the other box containing web server it will be exposed to all from outside .<br>\nsome one from outside can access the web server but could not access the application <br>\nsomeone from my internal network can access both .<br>\nfrom internal network when we search url it will be redirect to other box ip where the application server is present.</p>",
        "id": 1541755,
        "sender_full_name": "jon",
        "timestamp": 1680704295
    },
    {
        "content": "<p>Is i am able to make understand the concept to you</p>",
        "id": 1541766,
        "sender_full_name": "jon",
        "timestamp": 1680704675
    },
    {
        "content": "<p>The application is protected by communicating to nginx via UNIX websockets.  It is not possible to talk to it from the network, even if firewalls were wide open.</p>",
        "id": 1541768,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1680704812
    },
    {
        "content": "<p>If you want differing behaviour for internal and external networks, you should <a href=\"https://zulip.readthedocs.io/en/latest/production/deployment.html#putting-the-zulip-application-behind-a-reverse-proxy\">configure a reverse proxy</a> which sits in your DMZ.</p>",
        "id": 1541770,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1680704921
    }
]