[
    {
        "content": "<p>I'm running a zulip server on a vps with 1 core, 2GB RAM, and 20GB HDD. The server hosts two organizations, with about 40 users and on average 6 messages per day each. I'm creating regular backups with <code>/home/zulip/deployments/current/manage.py backup</code>, and currently they're 130MB in size.</p>\n<p>After a recent update I noticed that the disk usage was over 90%, and after <code>apt-get autoremove</code> , <code>df -h</code> gives</p>\n<div class=\"codehilite\"><pre><span></span><code>/dev/vda1        20G   17G  2.4G  88% /\n</code></pre></div>\n<p>Looking at disk usage it seems like the biggest directories are <code>/home/zulip/.cache/yarn/v6/</code> with 2.2 GB and <code>  /var/log/journal/0044878d47c84cd19e02687511064fa9/</code> with 1.9 GB.</p>\n<p>With this configuration, will I run into trouble with one of the next upgrades, eg to version 6?</p>\n<p>Can I reasonably tell the server to use less cache or to keep fewer logs, so I can keep using the current setup for a while?</p>\n<p>Or should I better upgrade the server? I can upgrade to a larger vps if necessary, but thought I ask here first.</p>",
        "id": 1454312,
        "sender_full_name": "Jonas F",
        "timestamp": 1666567437
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"17356\">@Jonas F</span> the yarn cache is a cache, and you can freely delete it. Unfortunately, <code>yarn</code> provides no useful API for limiting the size of its cache.</p>",
        "id": 1454790,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1666659492
    },
    {
        "content": "<p>I think the main question I'd have is where the rest of the disk space is? If you have 12GB of uploaded files, you're probably going to need to upgrade the server. Similarly if you've got a lot of 130MB daily backups that you want to store on the system, you probably will need more space.</p>",
        "id": 1454792,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1666659594
    },
    {
        "content": "<p>The /var/log/journal thing is an Ubuntu thing (see <a href=\"https://askubuntu.com/questions/1238214/big-var-log-journal\">https://askubuntu.com/questions/1238214/big-var-log-journal</a>) and I think not something Zulip logs to directly.</p>",
        "id": 1454793,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1666659672
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> ! I'll try deleting the cache and older logs and see what are the biggest directories then. </p>\n<p>The backups aren't stored locally, I only mentioned the size to make clear that there <em>aren't</em> many user-uploaded files. Users have uploaded some pdfs and photos, but I assumed they're all included in the backup so less than 130 MB in total.</p>",
        "id": 1455000,
        "sender_full_name": "Jonas F",
        "timestamp": 1666712433
    }
]