[
    {
        "content": "<p>In the coming weeks we want to move our current zulip VM to a KVM container instance. I browsed through the documentation about exporting and importing the zulip data and that sounds pretty straight forward. </p>\n<p>However a question I still have is: <br>\nThe two Zulip instances should be the same version. Since I always run our updates with the git clone option I'm hoping </p>\n<ul>\n<li>to fork Zulip to freeze the repo, </li>\n<li>upgrade the old instance to it and </li>\n<li>install the new instance from it. </li>\n</ul>\n<p>Is there documentation how to install Zulip from a git clone? <br>\nI only know that installing Zulip has been simplified this year...</p>",
        "id": 626977,
        "sender_full_name": "Matthias",
        "timestamp": 1533676011
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"6250\">@Matthias</span> you definitely want the two servers running the same version.</p>",
        "id": 626984,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1533676606
    },
    {
        "content": "<p>Our backup-related instructions are probably what you most want to follow (<code>postgres</code> dump, etc.)</p>",
        "id": 626985,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1533676626
    },
    {
        "content": "<p>On modern Zulip, you can just <code>git clone</code> and the run <code>scripts/setup/install</code> (that's only worked for a major release or two)</p>",
        "id": 626987,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1533676645
    },
    {
        "content": "<p>thanks for the quick infos. I'll definitely go for that then. Will <a href=\"https://zulip.readthedocs.io/en/latest/production/export-and-import.html\" target=\"_blank\" title=\"https://zulip.readthedocs.io/en/latest/production/export-and-import.html\">this export feature</a> also create the postgres dump?</p>",
        "id": 626998,
        "sender_full_name": "Matthias",
        "timestamp": 1533677046
    },
    {
        "content": "<p>You don't want to use that tool for this purpose.  Let me update those docs to clarify.</p>",
        "id": 627002,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1533677401
    },
    {
        "content": "<p><a href=\"https://github.com/zulip/zulip/commit/c6bbb9a8d4fb9e160a5fbce4d39ddf6acbb2da6d\" target=\"_blank\" title=\"https://github.com/zulip/zulip/commit/c6bbb9a8d4fb9e160a5fbce4d39ddf6acbb2da6d\">c6bbb9a8d4fb9e160a5fbce4d39ddf6acbb2da6d</a></p>",
        "id": 627038,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1533679909
    },
    {
        "content": "<p>On the subject of moving servers, do I need to re-register the push mobile notification service on the new box? The new server will have a new hostname, but I'll be migrating the application using the backup and restore procedures. We will be migrating the 1.9rc1 release.</p>",
        "id": 628437,
        "sender_full_name": "Scott Russell",
        "timestamp": 1533850905
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"5233\">@Scott Russell</span> if you preserved <code>zulip-secrets.conf</code> when migrating, you won't need to re-register.</p>",
        "id": 628438,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1533850996
    },
    {
        "content": "<p>I think there's an option you can pass to <code>manage.py register_server</code> to update the contact info in your registration if you like (or rotate the secret key part of the keypair)</p>",
        "id": 628439,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1533851023
    },
    {
        "content": "<p>But it's not required to do so.</p>",
        "id": 628440,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1533851029
    },
    {
        "content": "<p>Okay. Right now my plan is</p>\n<p>1. install 1.9rc1 to the new host and do all connectivity testing<br>\n2. backup following the docs the old host (also 1.9rc1)<br>\n3. restore to the new host following the docs<br>\n4. celebrate because it was that easy.</p>",
        "id": 628442,
        "sender_full_name": "Scott Russell",
        "timestamp": 1533851142
    },
    {
        "content": "<p><span class=\"emoji emoji-1f389\" title=\"tada\">:tada:</span>  at last our Zulip server has found a new home from the previous Ubuntu 16.04.1 with Postgresql 9.5 now in Debian 9.3 LXC container with Postgres 9.6<br>\nBut as for the <code>/home/zulip/uploads</code>: a symlink is definitely necessary because the nginx config uses the path multiple times so I had to symlink the samba share. As for performance I can't notice a different. The alternative is to hard code the new path manually in the nginx config file and all its includes.</p>",
        "id": 634392,
        "sender_full_name": "Matthias",
        "timestamp": 1534607860
    },
    {
        "content": "<p>Another thing: I tried to do a release upgrade of the old Ubuntu to be able to raise postgresql to 9.6. But after the dist-upgrade zulip was broken. I didn't look at the logs because it was the production server and my only concern was to restore the backup.<br>\nWhat are the experiences with Zulip and running <code>do release-upgrade</code>?</p>",
        "id": 634393,
        "sender_full_name": "Matthias",
        "timestamp": 1534607980
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"6250\">@Matthias</span> without the traceback I can't be sure, the story there is most likely just that <code>do-release-upgrade</code> will probably replace the postgres package, but I don't think it migrates your databases to be in the postgres 9.3 format to 9.6 format automatically.</p>",
        "id": 634589,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1534695396
    }
]