[
    {
        "content": "<p>Is there an option to show all the users in the list on the right, regardless of their activity status? This would be useful for conferences where everybody congregates at the same time. Also, from a UX perspective, browsing is always a good complement to searching.</p>",
        "id": 899166,
        "sender_full_name": "Plankter",
        "timestamp": 1591690271
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"15931\">@Plankter</span> I believe what you're asking for is the current default behavior; with the adjustment that users who have been offline for at least 2 weeks stop appearing in the right sidebar (which is probably appropriate for your use case).</p>",
        "id": 899552,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1591724605
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> <br>\nIt is the default behaviour indeed. I have been using the API to load users and found that they are duly displayed on the right hand side as long as the total number of users does not exceed 250. As soon as user 251 is added, the whole list disappears. The account owner (You) is the only user shown after this. A search with the letter 'a', for instance, brings back the list (of users containing the letter a), but they are not shown otherwise.</p>",
        "id": 900326,
        "sender_full_name": "Plankter",
        "timestamp": 1591801383
    },
    {
        "content": "<p>I can bring back the list by deactivating a couple.</p>",
        "id": 900330,
        "sender_full_name": "Plankter",
        "timestamp": 1591802593
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"15931\">@Plankter</span> yes, that's expected; beyond 250 users, we only show users who have been present within the last few weeks, and users loaded via the API have never been present.</p>",
        "id": 900388,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1591807163
    },
    {
        "content": "<p>So you wouldn't see this as a problem in the actual conference use case.</p>",
        "id": 900389,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1591807175
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>  Thanks. It will be fine as it is. Zulip seems very well suited for events and associations. I do understand that there has to be a limit to the number of users that can be displayed.</p>",
        "id": 900444,
        "sender_full_name": "Plankter",
        "timestamp": 1591808746
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 900446,
        "sender_full_name": "Plankter",
        "timestamp": 1591808795
    }
]