[
    {
        "content": "<p>Im using version 1.9.2. <br>\nMy default for stream is no notification, so all checkbox are unchecked.<br>\nWe have a support-stream, there I enabled all notification except Audible desktop notification. Furthermore the \"Mute stream\"-Checkbox is obviously unchecked. How ever I doesn't become an notification. Neither mobile nor email. <br>\nFor @Mention and PM I get Mobile and E-Mail-Notifications.<br>\nWhat's wrong? Can I prove my settings in the database?</p>",
        "id": 718306,
        "sender_full_name": "niels",
        "timestamp": 1552458143
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"11001\">@niels</span> so, for both email and push notifications, by default we only trigger them if you were offline at the time of the message.</p>",
        "id": 718461,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1552497621
    },
    {
        "content": "<p>(with a pretty strict definitition -- e.g. if you haven't touched the computer in 5 minutes you're offline)</p>",
        "id": 718462,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1552497640
    },
    {
        "content": "<p>There's a setting for mobile notifications to get them even when online that I'd recommend you set for testing (it's incorrectly categorized as a PM feature)</p>",
        "id": 718463,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1552497673
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> Thanks for clarification. That explains the current behavior. After checking all setting in the webclient I got the expected notifications, for some messages. The day before I got no message. However now it works, as described so it's difficult to clear it completely.</p>",
        "id": 718498,
        "sender_full_name": "niels",
        "timestamp": 1552499291
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"11001\">@niels</span> ok, well report back if you reproduce something in the future that seems broken.</p>",
        "id": 718604,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1552507046
    }
]