[
    {
        "content": "<p>Hi,</p>\n<p>every user can change their notification settings in the personal settings menu.</p>\n<p>Is it possible that a stream can overwrite this settings, for example that every user gets an email and a push notification for this stream no matter what the user has set for this stream (so it is a realm or admin setting)?</p>",
        "id": 1246189,
        "sender_full_name": "Ronny",
        "timestamp": 1628672029
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"14849\">@Ronny</span> we are close to adding a set of features that would make setting the defaults of those settings something one can do for the organization as a whole, so we are working on that direction.</p>",
        "id": 1248405,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1629469188
    },
    {
        "content": "<p>Can you talk about what social problem you're looking to solve with such a setting?</p>",
        "id": 1248406,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1629469202
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/31-production-help/topic/Stream-wide.20notification.20settings/near/1248406\">said</a>:</p>\n<blockquote>\n<p>Can you talk about what social problem you're looking to solve with such a setting?</p>\n</blockquote>\n<p>I may add a note from the university point of view: it might become handy to be able to overwrite the personal notification settings per stream in order to ensure that the students at least <strong>receive</strong> the contents of an announcement stream (and than hopefully read them <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span>)</p>",
        "id": 1249741,
        "sender_full_name": "Robert (ro-i)",
        "timestamp": 1629847276
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"17322\">Robert (ro-i)</span> <a href=\"#narrow/stream/31-production-help/topic/Stream-wide.20notification.20settings/near/1249741\">said</a>:</p>\n<blockquote>\n<p>I may add a note from the university point of view: it might become handy to be able to overwrite the personal notification settings per stream in order to ensure that the students at least <strong>receive</strong> the contents of an announcement stream (and than hopefully read them <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span>)</p>\n</blockquote>\n<p>I can fully agree with Robert! </p>\n<p>Some streams by us have only a few messages but they are very important like: <br>\n\"hey ... please provide us ... <strong>until</strong> ...\" or<br>\n\"I have this/that problem, what should I do ....\" </p>\n<p>The goal of this setting is, that no one can say: \"oh i didn't get an email message or i didn't get an notification in the mobile app....\" (and yes, if those messages are read by the person, it is another problem <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span>)</p>\n<p>The settings should \"overwrite\" the user settings for this stream(s) including this setting \"Send mobile notifications even if I'm online (useful for testing) \", so that an user gets always notified.</p>",
        "id": 1249796,
        "sender_full_name": "Ronny",
        "timestamp": 1629875321
    },
    {
        "content": "<p>Which of the following options would be most useful? Or would you want different ones for different situations? CC <span class=\"user-mention\" data-user-id=\"14849\">@Ronny</span>  <span class=\"user-mention\" data-user-id=\"17322\">@Robert (ro-i)</span> </p>\n<ol>\n<li>Stream-specific <em>default</em> notification settings, which can be manually overridden by users.</li>\n<li>Streams for which users cannot set personal notification settings at all, and have to use organization defaults.</li>\n<li>Something in between (1) and (2), e.g. streams for which users can add notifications but cannot remove them.</li>\n</ol>",
        "id": 1251158,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1630447844
    },
    {
        "content": "<p>Hi Alya, thanks for the suggestions! :)<br>\nI think option 3 could be the most useful one because you can</p>\n<ul>\n<li>enforce specific notifications (e.g. email notifications),</li>\n<li>but a user is still able to add additional notifications (e.g. desktop or mobile notifications) if they like.</li>\n</ul>",
        "id": 1251159,
        "sender_full_name": "Robert (ro-i)",
        "timestamp": 1630448151
    },
    {
        "content": "<p>I see how this could be useful.  One concern I have with a \"subscribers always get emails for messages in this stream\" feature is that there's a spam issue it could create.  We don't want to put users in a situation where they don't have a clear path to unsubscribe from any category of notification emails.  </p>\n<p>One possible solution to that is that we'd change the \"How to unsubscribe\" text at the bottom of the email if such a configuration were enabled to be something like \"This stream is configured to send email notifications to all subscribers.  You can unsubscribe from the stream or deactivate your account to stop receiving these notifications.\", with several of those being links.</p>\n<p><span class=\"user-mention\" data-user-id=\"14849\">@Ronny</span> <span class=\"user-mention\" data-user-id=\"17322\">@Robert (ro-i)</span> I'd be curious for your thoughts on that as a solution that balances the needs of users with those of the organization?</p>",
        "id": 1251279,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1630455705
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/31-production-help/topic/Stream-wide.20notification.20settings/near/1251279\">said</a>:</p>\n<blockquote>\n<p>I'd be curious for your thoughts on that as a solution that balances the needs of users with those of the organization?</p>\n</blockquote>\n<p>Well, in my context, the course instructors do not want the students to unsubscribe from the notifications, anyway <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span> <br>\nBut of course, I understand your point and I think that your suggested solution is very reasonable.</p>",
        "id": 1251310,
        "sender_full_name": "Robert (ro-i)",
        "timestamp": 1630457341
    },
    {
        "content": "<p>Yeah, I understand that for the \"all users are students in a course\" context, that totally makes sense, but I can imagine various open communities where it would be poor for an administrator to be able to force email notifications for everyone subscribed to a given stream.</p>",
        "id": 1251327,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1630458227
    },
    {
        "content": "<p>(And so we should at least advertise that an end user can deal with this situation themselves by unsubscribing)</p>",
        "id": 1251328,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1630458251
    },
    {
        "content": "<p>Hi, I agree with Robert. </p>\n<p>But an user shouldn't be able to unsubscribe from a stream by himself, because of:</p>\n<ol>\n<li>it is like a \"disable notification\" setting</li>\n<li>if a stream is used for notification of users, than an admin have to check each time before sending a message that really all users are subscribed.</li>\n</ol>\n<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> <br>\nI can follow you because of your spam message concerns, but students or employees should \"follow\" the given rules of the organization.</p>\n<p>In both cases, no one should be able to enter or leave the stream (only allowed by the admin). At the end all users always have the possibilities to filter those email messages or to disable the push notifications (at os level).</p>",
        "id": 1251462,
        "sender_full_name": "Ronny",
        "timestamp": 1630496258
    },
    {
        "content": "<p>It seems like there may be a second feature here, then -- a stream setting for whether or not it's possible to unsubscribe. This could be independent from the notification setting. If a stream has mandatory subscription and notifications, then the notification email would just tell users that they can stop getting notifications by deactivating their account.</p>",
        "id": 1251519,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1630513636
    },
    {
        "content": "<p>Yeah, I think that's the right design here.</p>",
        "id": 1251658,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1630533950
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"19257\">@Alya Abbott</span> do you want to write the issue for this?  I guess one question is whether we want this to fit within the \"user groups for permissions settings\" framework, as a \"Who can unsubscribe from this stream\" setting (and you'd set that to \"nobody\" to implement this policy)?</p>",
        "id": 1251659,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1630534062
    },
    {
        "content": "<p>Yep, I can write it up. That makes sense to me.</p>",
        "id": 1251668,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1630534950
    },
    {
        "content": "<p>Created \"Add stream setting for who can unsubscribe <a href=\"https://github.com/zulip/zulip/pull/19661\">#19661</a>\", and added a link to it from <a href=\"https://github.com/zulip/zulip/pull/19525\">#19525</a>.</p>",
        "id": 1251675,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1630536171
    },
    {
        "content": "<p>How do we feel about mandatory push notifications from a stream, with the way out for the user being to turn off Zulip notifications altogether?</p>",
        "id": 1251676,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1630536387
    },
    {
        "content": "<p>I'm wondering if the minimum notification setting should be for email only, or for mobile and/or desktop as well. I'm a little wary of the potential intrusiveness of forced mobile/desktop notifications.</p>",
        "id": 1251678,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1630536445
    },
    {
        "content": "<p>I don't think we have a clear use case / user story for something like this for mobile/desktop notifications, so potentially this feature might be just for email notifications.</p>",
        "id": 1251704,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1630537958
    },
    {
        "content": "<p>I filed <a href=\"https://github.com/zulip/zulip/pull/19664\">#19664</a> specifically for email notifications.</p>",
        "id": 1251764,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1630541728
    }
]