[
    {
        "content": "<p>Hi, I'm having trouble getting \"real\" email notifications.</p>\n<p>I am using an Exchange 2019 server to send my mail, I put the username in settings.py and the password in zulip-secrets.conf, and if I use...</p>\n<div class=\"codehilite\"><pre><span></span><code>su zulip -c &#39;/home/zulip/deployments/current/manage.py send_test_email me@domain.tld&#39;\n</code></pre></div>\n<p>...I get the test message every time.</p>\n<p>If I check the box for email alerts on a stream I am subscribed to, or use two accounts to mention each other for testing purposes, email alerts never seem to show up in the mailboxes.</p>\n<p>If I check /var/log/zulip/send_email.log, it says that it did do things like sending a notify_new_login email to <a href=\"mailto:me@domain.tld\">me@domain.tld</a>, but I don't actually have the messages in my mailbox.</p>\n<p>I've also tried setting up a different mail server to relay my mail (because I'm not great at examining Exchange logs) and it looks like when I'm sending mail through the command line to test mail, the Zulip server is connecting to the mail server to send mail, but for sending \"real\" notifications, a connection to the mail server seems to never actually happen.</p>\n<p>What should I be doing to troubleshoot this?</p>\n<p>edit:  If useful, I <em>do</em> get email notifications for new logins, but I <em>do not</em> get email notifications for mentions or from streams that I have checked the box for \"Email notifications\"</p>",
        "id": 1621336,
        "sender_full_name": "Steve",
        "timestamp": 1691509076
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"27440\">@Steve</span> see <a href=\"https://zulip.readthedocs.io/en/latest/production/email.html#troubleshooting\">https://zulip.readthedocs.io/en/latest/production/email.html#troubleshooting</a>.</p>",
        "id": 1621443,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1691516543
    },
    {
        "content": "<p>I believe you should be expecting to get two emails from <code>send_test_email</code> -- the fact you're only getting one likely means that emails that would have a <code>noreply</code> sender are being rejected by your email server.</p>",
        "id": 1621444,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1691516574
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> , I was unclear with my wording, sorry.  By \"get the test message\" I meant \"the test was successful\".  I do get two test emails when running the test, I do get emails when logging in on a new device / browser / etc. I do not get emails for mentions / posts in subscribed streams, and the mail server is not connected to when a mention / message in a stream happens.</p>",
        "id": 1621554,
        "sender_full_name": "Steve",
        "timestamp": 1691521079
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"27440\">@Steve</span> check whether you've got the setting to send email notifications even when online enabled. And even with that, you'll not get an email notification if you read the message before it would have been sent.</p>",
        "id": 1621610,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1691525921
    },
    {
        "content": "<p>Also check that <code>supervisorctl status</code> shows everything as happy, since the logging-in emails are sent in-process from Django and the rest are from workers</p>",
        "id": 1621653,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1691529568
    }
]