[
    {
        "content": "<p>I wanted to get your feedback on the actual meaning of this line in the Terms of Service. \"Don't misuse our Services. For example, don't interfere with our Services or try to access them using a method other than the interface and the instructions that we provide\". What does this mean in real terms? If I modify the zulip interface is that a violation of the Terms of Service?</p>",
        "id": 666664,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1543597339
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> Would love to get your direct help on this</p>",
        "id": 666665,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1543597365
    },
    {
        "content": "<p>Actually anyone with this specific knowledge would be fine <span class=\"emoji emoji-1f642\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 666666,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1543597429
    },
    {
        "content": "<p>It's general \"don't try to hack the service\" text.</p>",
        "id": 666688,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1543598544
    },
    {
        "content": "<p>I guess I just mean that if I'm modifying the zulip clients like the web app, mobile app to replace the logo and some colours with my own. Is that okay with you guys? I'm trying to start a small community thats not really got anything to do with open source so I can't be on the free plan. I've got everything mostly setup but I was about to publish a modified version of the app for the play store and while registering for mobile push notifications I came upon the terms of service. I wanted to run this by you.</p>",
        "id": 666692,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1543598659
    },
    {
        "content": "<p>Are you running your own server?  The ToS for Zulip Cloud has no relationship to running your own server with code changes; for that, you should read Zulip's license, which is the permissive Apache 2 license.</p>",
        "id": 666694,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1543598730
    },
    {
        "content": "<p>Yes I'll be running my own server but I believe the server communicates with zulips cloud for notifications on mobile unless im mistaken? Also regarding the mobile app code. Is it permitted to publish a modified version with my own logo on play and mac store? I will read the license you mentioned as well as asking here.</p>",
        "id": 666696,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1543598818
    },
    {
        "content": "<p>Yes, that's fine -- the mobile app is also on the Apache 2.0 license.</p>",
        "id": 666699,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1543598869
    },
    {
        "content": "<p>Fantastic! Thanks a ton <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> <span class=\"emoji emoji-1f419\" title=\"octopus\">:octopus:</span> . Go zulip <span class=\"emoji emoji-1f642\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 666700,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1543598904
    },
    {
        "content": "<p>We do own the trademark on the name Zulip, so if you were to publish something called \"Zulip official mobile app\" in the play store that might confuse users, that would be a trademark problem.  But that's not an issue with your own project name/logo.</p>",
        "id": 666701,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1543598950
    },
    {
        "content": "<p>Haha no I'm not planning on that. Thanks for covering that case though</p>",
        "id": 666702,
        "sender_full_name": "Armaan Ahluwalia",
        "timestamp": 1543598981
    }
]