[
    {
        "content": "<p>Hey guys, I'm currently on the hunt for a self-hosted chat application for my company. We work with the government and for compliance reasons we need to self-host our data. We've been using rocket.chat and that's worked reasonably well, but there's a growing interest to switch to Zulip. I've been looking into hosting it internally and I have a few questions that I can't seem to get a clear answer on.</p>\n<p>First, as the title suggests, what's the deal with registering my organization on your platform? We have an internal LDAP server that I was going to use for authentication and account management, and I don't understand the purpose of publicly registering the organization.</p>",
        "id": 964605,
        "sender_full_name": "Jesse Roland",
        "timestamp": 1596117758
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16844\">@Jesse Roland</span> what kind of registering are you referring to specifically? The only way that I can think of in which self-hosted servers register with us is for activating push notifications <a href=\"https://zulip.readthedocs.io/en/latest/production/mobile-push-notifications.html\">https://zulip.readthedocs.io/en/latest/production/mobile-push-notifications.html</a> and that is not obligatory, as the doc also outlines what would need to be done to make your server capable of doing push notifications independently.</p>",
        "id": 964634,
        "sender_full_name": "Mateusz Mandera",
        "timestamp": 1596120511
    },
    {
        "content": "<p>yeah I was reading the docs and it had registering the org as one of the steps and I was curious what it was used for. That makes sense. Thank you!</p>",
        "id": 964642,
        "sender_full_name": "Jesse Roland",
        "timestamp": 1596120744
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16844\">@Jesse Roland</span> can you point to the doc that brought up registration the organization that confused you?</p>",
        "id": 965268,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1596139345
    }
]