[
    {
        "content": "<p>Hey guys,<br>\nI'm having a problem now with the new version. I'm on an offline server, so i have to download images using \"docker pull\"  on an online-box, save images, transfer them to the offline server and then import with docker import there.<br>\nMy problem is that both rabbitmq and zulip are listed as \"none\"-images after import. </p>\n<p>I suppose this is a docker-issue, but maybe someone here has had the same problem and know how to handle it?</p>\n<p>cheers</p>",
        "id": 660859,
        "sender_full_name": "andip",
        "timestamp": 1542099184
    },
    {
        "content": "<p>i should mention that when i pull new images on the online-box, i do not have the same problem, so i suppose there's a difference in \"pulling\" from official repos, and importing a saved container</p>",
        "id": 660860,
        "sender_full_name": "andip",
        "timestamp": 1542099275
    },
    {
        "content": "<p>Never mind, fixed it.</p>",
        "id": 660869,
        "sender_full_name": "andip",
        "timestamp": 1542115195
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"9967\">@andip</span> can you share what you needed to do to fix it, so that we can point other folks in a similar situation to the solution?</p>",
        "id": 660993,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1542141590
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention\" data-user-id=\"9967\">@andip</span> can you share what you needed to do to fix it, so that we can point other folks in a similar situation to the solution?</p>\n</blockquote>\n<p>Problem was my limited knowledge with docker (i think). When i first installed the containers, i used \"docker import\", that did not work with upgrading, i had to you \"docker load\". This is of course only an issue with offline-installs, because with online you only use \"docker pull\", and the rest is more or less automatic.<br>\nI also used \"docker pull\" with no version-specification, which caused problems with docker-compose. Seems it looks for actual tags, so even though \"latest\" was version 1.9.0-0, i had to change the tag before it worked as intended.</p>\n<p>FYI, I'm quite new to docker, so I do not give any guarantees to this way of doing it. I also did an update on the rabbitmq-container which caused issues (i tried updating all containters needed by zulip, only to find out that zulip still needed the 3.7.7-version, and not the newest 3.7.8).</p>\n<p>In short, i made such a mess of things, that I could easily be the cause of many of my problems, and i might not remember exactly what caused what. What i do know of sure, is that when i finally used \"docker load\" (and with the right version of rabbitmq), things sorted themselves out.</p>",
        "id": 661059,
        "sender_full_name": "andip",
        "timestamp": 1542173842
    },
    {
        "content": "<p>OK, thanks for the writeup <span class=\"emoji emoji-1f642\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 661386,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1542223003
    }
]