[
    {
        "content": "<p>Hi, we have a need to add a 2nd org to our Zulip install for a 3rd party connection. Reading the docs it seems our best bet is to be at the latest server version first. We are at 1.9.2 currently, should we do this upgrade in stages?   Cheers in advance.</p>",
        "id": 803580,
        "sender_full_name": "hb-it",
        "timestamp": 1576779053
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"3275\">@hb-it</span> I would upgrade to 2.1.x first; we have improved things for that a lot since 1.9.x, and in any case, 1.9.x has some security issues you'll be happier to have fixed.</p>",
        "id": 803589,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1576782239
    },
    {
        "content": "<p>10-4, thanks.</p>",
        "id": 803591,
        "sender_full_name": "hb-it",
        "timestamp": 1576782539
    },
    {
        "content": "<p>On a test VM we've upgraded to 2.1.0, however after running the upgrade to 2.1.1, version is still showing as \"2.1.0-5-g49ff894d6a\"?</p>",
        "id": 806184,
        "sender_full_name": "hb-it",
        "timestamp": 1578059406
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"3275\">@hb-it</span> thanks for the report!  I think I know what the problem is.</p>",
        "id": 806213,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1578081357
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"699\">@Anders Kaseorg</span> I believe the issue here is that if one runs <code>tools/build-release-tarball</code> before creating the Git tag for a release, it'll end up generating a version value like that.</p>",
        "id": 806214,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1578081386
    },
    {
        "content": "<p>(I think it's very possible I ran <code>git tag</code> after <code>tools/build-release-tarball</code>).</p>",
        "id": 806215,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1578081445
    },
    {
        "content": "<p>One theory is that we should just be careful about the ordering of those commands; but it might make sense to e.g. error out in the case that one passed a full version that matches what's in <code>version.py</code> but doesn't have a corresponding tag.</p>",
        "id": 806216,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1578081526
    },
    {
        "content": "<p>Just FYI, the path from 1.9.2 via 2.1.0 to 2.1.1, other than the version issue, was flawless - easiest upgrade yet :-)</p>",
        "id": 806222,
        "sender_full_name": "hb-it",
        "timestamp": 1578081697
    },
    {
        "content": "<p>Glad to hear it!  We put a lot of effort into making the upgrade process smooth, since it saves a lot of pain for everyone (For us, we can feel OK not backporting security fixes to old major releases if there's no good reason to not have upgraded).</p>",
        "id": 806224,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1578081821
    }
]