[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"21240\">David</span> <a href=\"#narrow/stream/31-production-help/topic/.E2.9C.94.20upgrade.20from.202.2E0.2E8.20to.202.2E1.2E0.20.28and.20beyond.29/near/1259326\">said</a>:</p>\n<blockquote>\n<p>I scrolled down that page a couple times.  With some of the releases there are so many changes that I could've missed something.</p>\n</blockquote>\n<p>I think this points at one thing we could improve about that page. There's a really overwhelming amount of material there. Only a much shorter subset of it is important for an admin to read while upgrading -- that's the \"upgrade notes\" sections -- but it's mixed in among the overwhelming volume of specific changes, so it's not easy to see that you can just focus on that.</p>",
        "id": 1259985,
        "sender_full_name": "Greg Price",
        "timestamp": 1632899819
    },
    {
        "content": "<p>The index section <a href=\"https://zulip.readthedocs.io/en/latest/overview/changelog.html#upgrade-notes\">https://zulip.readthedocs.io/en/latest/overview/changelog.html#upgrade-notes</a> at the end helps, but I think doesn't make it clear enough.</p>\n<p>Perhaps the upgrade notes could be their own page? With links from the detailed-changelog page to corresponding sections there, and vice versa.</p>",
        "id": 1259986,
        "sender_full_name": "Greg Price",
        "timestamp": 1632899897
    },
    {
        "content": "<p>Another way of organizing it that could work well is for each major version to be its own page -- and the upgrade notes at the top.</p>\n<p>Below that the highlights, then the detailed list of changes.</p>\n<p>And for minor versions in that series, list them toward the bottom: either at the very bottom, or just before the detailed list of changes. In the rare case that a minor version has upgrade notes (as only 2.1.5 has so far), flag those right at the end of the main upgrade notes.</p>",
        "id": 1259987,
        "sender_full_name": "Greg Price",
        "timestamp": 1632900222
    },
    {
        "content": "<p>I think the version I'd be happiest with is just moving all the upgrade notes to be one after another inline within that section at the end (and just having an inline link within each individual page).</p>",
        "id": 1260169,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1632937867
    },
    {
        "content": "<p>I don't think each version on its own page would really solve the problem of making it convenient to scan all relevant upgrade notes when preparing to do an upgrade, which is the problem statement at hand.</p>",
        "id": 1260170,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1632937899
    },
    {
        "content": "<p>And I believe that we've been careful to write things so that the changelogs would read fine with the upgrade notes moved (i.e. we don't only mention an exciting new feature in the upgrade notes); it'd likely not be hard to audit for that while moving them just in case.</p>",
        "id": 1260171,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1632937952
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"7\">Tim Abbott</span> <a href=\"#narrow/stream/31-production-help/topic/.E2.9C.94.20upgrade.20from.202.2E0.2E8.20to.202.2E1.2E0.20.28and.20beyond.29/near/1260169\">said</a>:</p>\n<blockquote>\n<p>I think the version I'd be happiest with is just moving all the upgrade notes to be one after another inline within that section at the end (and just having an inline link within each individual page).</p>\n</blockquote>\n<p>Cool, I think that would help a lot.</p>\n<p>The main remaining thing I'd be concerned about is that it's still a giant page, which could look rather formidable until you scroll to the end and focus on that one section. What would you think about going one step further, by moving the upgrade notes from being one after another in a section at the end to being in a (single) separate page?</p>",
        "id": 1261181,
        "sender_full_name": "Greg Price",
        "timestamp": 1632990041
    },
    {
        "content": "<p>Probably a good idea; worth trying.</p>",
        "id": 1261206,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1633020603
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"12178\">@Alex Vandiver</span> what are your thoughts on this proposal?  </p>\n<p>I think since we've been backporting all other changes to production docs, it'd be easy to do and backport to 4.x if we want to do it.</p>",
        "id": 1261246,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1633026504
    },
    {
        "content": "<p>I think my ideal form would be a separate page which duplicates all of the upgrade notes sections, with a JS widget at the top that says \"I'm upgrading from... to...\" which filters down to just show you the relevant ones.</p>\n<p>I think there's value in having all of the information about a version (upgrade notes, bug fixes, feature) in one place, so I'd like to keep that if possible.  But if not (i.e. there's no way to automatically pull out sections of the changelog into their own page), than I think it's reasonable to put them on their own page, and interlink as necessary.  In my mind, most folks make the decision to upgrade based on the feature/bug list, and then separately (possibly even a different person) go through the actual mechanics.</p>",
        "id": 1261360,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1633035347
    },
    {
        "content": "<p>I'm sure it's possible to put the upgrade notes into separate files with some sort of include feature.  And I agree with that simulation about the typical workflow here.</p>",
        "id": 1261368,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1633035545
    },
    {
        "content": "<p><a href=\"https://myst-parser.readthedocs.io/en/v0.13.4/using/howto.html#include-a-file-from-outside-the-docs-folder-like-readme-md\">There is</a> an include feature.</p>",
        "id": 1261455,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1633044538
    },
    {
        "content": "<p>Looks like that'd mean splitting the things we want to include each into their own markdown files.</p>",
        "id": 1261456,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1633044676
    },
    {
        "content": "<p>I think <a href=\"https://docutils.sourceforge.io/docs/ref/rst/directives.html#including-an-external-document-fragment\">https://docutils.sourceforge.io/docs/ref/rst/directives.html#including-an-external-document-fragment</a> may help?</p>",
        "id": 1261459,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1633044870
    },
    {
        "content": "<p>That’s the same feature (<a href=\"https://myst-parser.readthedocs.io/en/latest/syntax/syntax.html#directives-a-block-level-extension-point\">syntax translation</a>).</p>",
        "id": 1261468,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1633045951
    },
    {
        "content": "<p>Yup.  Sorry, I meant but didn't say the <code>start-after</code> / <code>end-before</code> bits of it.</p>",
        "id": 1261469,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1633046050
    },
    {
        "content": "<p>Hmm, yeah, the start-after/end-before feature could mean we don't need to make tiny files -- we just have the changelog itself include the relevant section from the upgrade notes doc.  (Or the other way around, I suppose)</p>",
        "id": 1261712,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1633111324
    }
]