[
    {
        "content": "<p>I have a couple self-hosted instances of Zulip 6.0 on Ubuntu 22.04 LTS.   There have been some errors I see Spit out over the time it has been up. A few months now. Usually, Timeout types of mistakes.  I was thinking of updating to the newer 6.02 version.  I noticed that Version 7 is due out not that long away.  </p>\n<p>My questions are:</p>\n<ol>\n<li>Should  I upgrade to the point releases of Zulip before going to Version 7 when available?</li>\n<li>What is best practices for Zulip in trying to keep it up to date.   Should I always do the point releases, or can I do the major releases unless there is some MAJOR issue?</li>\n</ol>\n<p>Thank you for all you do. I am new to the product, but so far, it has been an excellent experience compared to other open-source projects I have worked with.</p>",
        "id": 1576697,
        "sender_full_name": "Jerry Broughton",
        "timestamp": 1685036731
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"26639\">@Jerry Broughton</span> We generally recommend always upgrading to the point releases; they're designed to be very low risk upgrades and often fix important security or reliability issues.</p>",
        "id": 1576777,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1685041803
    },
    {
        "content": "<p>You generally don't need to do intermediate upgrades; though see <a href=\"https://zulip.readthedocs.io/en/latest/production/upgrade.html#upgrading-the-operating-system\">https://zulip.readthedocs.io/en/latest/production/upgrade.html#upgrading-the-operating-system</a> for some cases where that's necessary if you're quite far behind.</p>",
        "id": 1576778,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1685041845
    },
    {
        "content": "<p>You should post the specific errors you're seeing; it is our goal that there not be random exceptions in production instances.</p>\n<p><a href=\"https://zulip.readthedocs.io/en/latest/production/troubleshooting.html\">https://zulip.readthedocs.io/en/latest/production/troubleshooting.html</a> has some advice on how to post logs (E.g. use a code block).</p>",
        "id": 1576780,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1685041920
    }
]