[
    {
        "content": "<p>I was wondering how zulip handled it when the upload folder is symlinked to a SMB mount.<br>\nWhat would happen if that share is suddenly gone?<br>\nWhat would be the performance hit since uploaded files need to be pulled through the network?<br>\nI assume the links are in the database so only when you click a link the download might have more latency. Are the image previews loaded from db or the file?</p>",
        "id": 632254,
        "sender_full_name": "Matthias",
        "timestamp": 1534399516
    },
    {
        "content": "<p>I think this would behave like any other situation where the network drive disappeared or was not responsive. Likely you would see a hang until some kernel level IO timeout followed by retries. From the app perspective I would expect that would result in massive slow down as the uploads directory contains all the user avatars and files.</p>\n<p>Beyond that, I would try to colocate the hosting of Zulip with the SMB server to reduce latency.</p>",
        "id": 632575,
        "sender_full_name": "Scott Russell",
        "timestamp": 1534428794
    },
    {
        "content": "<p>I don't think you need to use a symlink though. While <code>/home/zulip/uploads</code> is the default location you can change this in the <code>settings.py</code> to be the mount point of your samba share and avoid the symlink.</p>",
        "id": 632577,
        "sender_full_name": "Scott Russell",
        "timestamp": 1534428847
    },
    {
        "content": "<p>thanks, <br>\nmy reason for symlinking is because we are migrating an existing installation to a new server. I'm not sure if the paths are stored in the db as well. For Nextcloud I read that changing the data folder is only possible/recommended at install, not after.</p>",
        "id": 632579,
        "sender_full_name": "Matthias",
        "timestamp": 1534429231
    },
    {
        "content": "<p>I recently did a db dump and did not notice the path stored in the DB. I believe it's only read from the settings.py. Of course a symlink works regardless.</p>",
        "id": 632582,
        "sender_full_name": "Scott Russell",
        "timestamp": 1534429362
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span>zulip@zulip:~$ ls dump.sql\ndump.sql\nzulip@zulip:~$ grep &#39;home/zulip&#39; dump.sql\n</pre></div>",
        "id": 632583,
        "sender_full_name": "Scott Russell",
        "timestamp": 1534429435
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"6250\">@Matthias</span> yeah, by design the <code>LOCAL_UPLOADS_DIR</code> path isn't stored in the database.  It should be possible to move that path and edit the configuration and have everything keep working.</p>",
        "id": 633085,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1534455899
    },
    {
        "content": "<p>(The paths we store in the DB are all relative to the root of <code>LOCAL_UPLOADS_DIR</code>)</p>",
        "id": 633086,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1534455909
    }
]