[
    {
        "content": "<p>Went through the setup guide, using 16.04, received the notice that Upstart needed to be removed, uninstalled it and completed the installation. Everything worked fine until I rebooted. It would not boot up since I uninstalled Upstart. I thought systemd was installed as default, but it does not give me the option on advanced boot. I searched Google for removing upstart and keeping systemd but they all assumed systemd was default. I am running this under ESX6i. Hopefully something simple!</p>",
        "id": 258811,
        "sender_full_name": "DaZuru",
        "timestamp": 1501201110
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"thedazuru@gmail.com\" data-user-id=\"2940\">@DaZuru</span> that's puzzling; the <code>systemd</code> package in 16.04 is tagged as required, aka it shouldn't be possible to install a Debian/Ubuntu system without it.</p>",
        "id": 258814,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1501201540
    },
    {
        "content": "<p>Are you sure removing Upstart is related to why your machine isn't booting?</p>",
        "id": 258815,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1501201550
    },
    {
        "content": "<p>Yes sir. I went back to a snapshot to test. It shows that systemd is installed, when I tried to install it. I am a novice to grub and linux booting. Not sure why it would not be an option unless something in VMWare is causing it? Is it a UEFI issue?</p>",
        "id": 258816,
        "sender_full_name": "DaZuru",
        "timestamp": 1501201636
    },
    {
        "content": "<p>I don't know much about VMWare, but you could try just deleting that line from the Zulip installer and installing with Upstart installed.  If I recall correctly, the main problem with Upstart being installed is it causes some other service like<code>nginx</code> to not start, which may be solvable another way.</p>",
        "id": 258819,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1501201925
    },
    {
        "content": "<p>But I wouldn't expect upstart to be particularly relevant at the <code>UEFI/grub</code> layer.</p>",
        "id": 258820,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1501201948
    },
    {
        "content": "<p>FWIW we've never heard of an issue with removing upstart before; I'd try googling for things like \"remove upstart ESX6i boot\" to see if you can find anyone else with the same issue.</p>",
        "id": 258821,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1501201988
    },
    {
        "content": "<p>Will do! Thanks for pointing me in another direction. My Google searches were bringing up the same pages. :)</p>",
        "id": 258822,
        "sender_full_name": "DaZuru",
        "timestamp": 1501202081
    },
    {
        "content": "<p>Thanks for your help on this. I got it working by disabling the line that checks for Upstart. You were correct in that it caused nginx to not start. I think I found the reason why, I needed to copy and name my certs to match the zulip.enterprise file in sites-available. I used sudo nginx -t and figured it was a config error. Hopefully this will help with the upstart check issue?</p>",
        "id": 258875,
        "sender_full_name": "DaZuru",
        "timestamp": 1501215119
    }
]