[
    {
        "content": "<p>At the moment I only see the option to change user preferences before they are joining, but not afterwards. I would like to configure for all users that they have full-width design, notifications for channels etc. </p>\n<p>Is there any option to handle it? I see no option in manage.py. I guess only database is an option but I cannot find the credentials and I am also not able to see the tables when I am using psql with the postgres user.</p>",
        "id": 1277708,
        "sender_full_name": "Mathias Rumbold",
        "timestamp": 1636237966
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"21518\">@Mathias Rumbold</span> you can adjust the database using <code>manage.py shell</code> or <code>manage.py dbshell</code>. See <a href=\"https://zulip.readthedocs.io/en/stable/production/management-commands.html\">https://zulip.readthedocs.io/en/stable/production/management-commands.html</a>.</p>",
        "id": 1277836,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1636333368
    },
    {
        "content": "<p>We will likely extend the \"new user defaults\" UI feature at some point to allow forcing settings for all users; we haven't done so yet because (1) the feature is new in the first place and (2) it's not clear what the right semantics are -- I can imagine situations where it would be very annoying to users to have their settings changed by another user.</p>",
        "id": 1277837,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1636333435
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span> thanks for the info. There are just one or two things I would like to force to all like full-width, not just for new customers but for all. Since we imported all from <a href=\"http://rocket.chat\">rocket.chat</a> it is a bit hard to configure it since the organization was imported.</p>",
        "id": 1277915,
        "sender_full_name": "Mathias Rumbold",
        "timestamp": 1636364477
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"21518\">@Mathias Rumbold</span> yeah, that makes sense to me.  Certainly for data-imported users, who haven't specified their preferences yet, there's no reason we wouldn't want to allow overriding it.  Let us know if you have any trouble changing this with the <code>manage.py shell</code>.  (One could also do it by changing a couple lines in the import tool, if you're planning to re-import).</p>",
        "id": 1278174,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1636405910
    }
]