[
    {
        "content": "<p>Friends! Nobody can help me to test something on the windows app? Please?</p>\n<p>Pls see #spell checker topic (BTW how can I type it here to create a link to it? Tried # with no success.</p>",
        "id": 1561081,
        "sender_full_name": "Fl치vio Zarur Lucarelli",
        "timestamp": 1683142802
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"26348\">@Fl치vio Zarur Lucarelli</span> please just post in the original topic, rather than making new ones. And see <a href=\"https://zulip.com/help/link-to-a-message-or-conversation\">https://zulip.com/help/link-to-a-message-or-conversation</a> for how to link.</p>\n<p>You seem to have an issue with the spellchecker on Windows that nobody else has reported has can reproduce; I'm not sure we have a good way to debug that as the issue likely depends on some detail about your computer that is hard to guess. I don't think we have the resources to debug it with you individually, so I think the issue will remain a known bug until someone else can reproduce it (either another user reporting it or a developer figuring out how to).</p>",
        "id": 1561188,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1683147210
    },
    {
        "content": "<p>If we have two users with the problem, we can at least try to cross-compare what is the same about their systems and use that to figure out things to test.</p>",
        "id": 1561189,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1683147231
    },
    {
        "content": "<p>We don't have the resources to for free debug every weird issue that we can't reproduce and have only seen a single user report. If this issue is important to you, you can consider buying a support contract.</p>",
        "id": 1561191,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1683147336
    },
    {
        "content": "<p>Hi, Tim, how are you? I have and I'm not getting responses.</p>\n<p>But nobody tested in the windows app. ;)</p>\n<p>I guess I'll open a bug report, is that Ok? All I'm asking is for someone to help me test in the windows app. Isn't that possible? </p>\n<p>Thanks.</p>",
        "id": 1561445,
        "sender_full_name": "Fl치vio Zarur Lucarelli",
        "timestamp": 1683201932
    },
    {
        "content": "<p>or at least nobody replies to me saying they can test it in the windows app. I believe I end up helping the product too, of course, that's also my goal, I have sent some good suggestions in your github, etc</p>",
        "id": 1561447,
        "sender_full_name": "Fl치vio Zarur Lucarelli",
        "timestamp": 1683201963
    }
]