[
    {
        "content": "<p>I am new to VMs.  Honestly, I hate Ubuntu but that is what is needed for Zulip.  So I installed Ubuntu 20.4 in a virtualbox vm with the required configuration.  Host system is CentOS 7, Guest Ubuntu 20.4.  Installation of Zulip went well, everything up and running.  I can't figure out the networking required for me to access Zulip from the internet with a browser.  Both host and guest are headless servers.  I am using remotebox to manage the VM but can use the virtualbox manager from command line if that is a better way.  The host has an IP address and is accessible from the internet.  If anyone has experience here please help this VM noob.</p>",
        "id": 945783,
        "sender_full_name": "Jerianobe Bebe",
        "timestamp": 1595305703
    },
    {
        "content": "<p>You would basically set up a proxy on the hosts web server that tunnels requests to the VM. There are dozens of How-to's around, including <a href=\"https://zulip.readthedocs.io/en/latest/production/deployment.html#putting-the-zulip-application-behind-a-reverse-proxy\">in the Zulip docs</a>.</p>",
        "id": 946603,
        "sender_full_name": "Roman Bannack",
        "timestamp": 1595353862
    },
    {
        "content": "<p>OK, I was looking at doing it at the network adapter level; using port forwarding to forward requests from the host to the VM's port 80.  Spent most of the day looking for and reading docs at setting up the virtual nic to handle port requests.  I changed network settings so many times I lost count, trying different things.  Thanks for the tip; much appreciated.</p>",
        "id": 946651,
        "sender_full_name": "Jerianobe Bebe",
        "timestamp": 1595358109
    },
    {
        "content": "<p>Haven't been able to shell into the vm; roadblock for setting up zulip.</p>",
        "id": 948189,
        "sender_full_name": "Jerianobe Bebe",
        "timestamp": 1595435253
    },
    {
        "content": "<p>I tried that sort of scenario some time ago with an Ubuntu 18 VM that ran in bridge mode, thus, getting an own IP in the hosts network. It went quite well. Have you considered a <a href=\"https://github.com/zulip/docker-zulip\">docker implementation of Zulip</a>? Although they say the project is in \"alpha\" state, it runs quite good.</p>",
        "id": 949332,
        "sender_full_name": "Roman Bannack",
        "timestamp": 1595480133
    },
    {
        "content": "<p>dockers are very difficult to make any custom code changes; hard to get into the box.  I need to tie zulip to an existing member database.  I can get into the vm through rdp but I don't have any clipboard access.  I would need to type everything at the terminal; using vi,  Using the normal terminal when I ssh into a server, I can cut and paste from local machine to remote server but don't know how to do this with the VM; as I said, I am new to the VM world on remote servers.  I use virtualbox on the local machine but this remote VM on a remote server is new territory for me.  I really don't want to type for 15 minutes only to not catch an error but I may have to just do that since I am wasting too much time trying to get clipboard to work.</p>",
        "id": 949340,
        "sender_full_name": "Jerianobe Bebe",
        "timestamp": 1595481374
    },
    {
        "content": "<p>Sometimes I think I am an idiot LOL.  I am looking at all these remote desktop clients of which none is allowing me to paste from clipboard when I thought, dang, why not just install webmin on the VM?  So I did and it is nice having a GUI to the VM to work on files.  Are there any problems with webmin on the VM that zulip is running on; can they work together OK?</p>",
        "id": 950307,
        "sender_full_name": "Jerianobe Bebe",
        "timestamp": 1595525213
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16302\">@Jerianobe Bebe</span> I believe that should work fine.</p>",
        "id": 950366,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595525897
    },
    {
        "content": "<p>Just put zulip in a vm.  Easy.  Accessing zulip in a vm, not so easy.</p>",
        "id": 952596,
        "sender_full_name": "Jerianobe Bebe",
        "timestamp": 1595602945
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"16302\">@Jerianobe Bebe</span> can you expand on that comment?</p>",
        "id": 952924,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595611163
    },
    {
        "content": "<p>Let me give details on the configuration.</p>\n<ol>\n<li>Host system is CentOS 7 with an external IP address assigned to the server.  Server is reachable by the world.</li>\n<li>Client system is Ubuntu 20.4; a VM running under virtualbox.<br>\nI have no idea how Zulip works; how one is to connect to Zulip.  I see some things in the documentation but unsure.  I see a mention about port 5080.  Do I need the VM using NAT, Bridge, ???? for the virtual NIC?<br>\nNow, I set up webmin on the VM and had no trouble reaching Virutalmin using port forwarding with the VM set to NAT.  I have a domain; a sub domain actually, chat.domain.tld, that will connect to the host server from the world, that I included when I ran the Zulip install script.  Now I assumed that whatever is serving up Zulip on the VM is listening on port 80 but forwarding from the host port xxxx to port 80 didn't return anything.  Webmin set up the same; port xxxx forwarded to webmin's listening port works; I can do all sorts of work on the VM using webmin without any issues.  So, I am guessing that isn't the way Zulip is working.  I have read the documentation but developers that know the nuts and bolts often may think some things are obvious when to a noob they are not.  I have been thinking about renting a VPS as that would simplify things; removing the whole VM part of the equation but I really don't want to spend more money when the dedicated should be able to handle this using virtualbox.</li>\n</ol>",
        "id": 954373,
        "sender_full_name": "Jerianobe Bebe",
        "timestamp": 1595645472
    },
    {
        "content": "<p>Certainly it's easiest to setup Zulip in a dedicated VM.  I'm not sure where you see port 5080 -- that port number only appears in the Zulip documentation as an example.</p>",
        "id": 955879,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595805815
    },
    {
        "content": "<p>OK, ignore the 5080 mentioned in the documentation.  Recommendation for the VM; NAT or BRIDGED?  I am getting ready to wipe the server and start over completely.  If anyone can give me some pointers on running Zulip in a VM I would appreciate it.</p>",
        "id": 957713,
        "sender_full_name": "Jerianobe Bebe",
        "timestamp": 1595868177
    },
    {
        "content": "<p>Either option should work fine but bridged may be simpler if you have a real IP available.  Ultimately, if you can get your VM reachable from the Internet with a real domain name mapping to its public IP, that will be simplest.</p>",
        "id": 957935,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1595874406
    },
    {
        "content": "<p>everything reinstalled in the VM.  Port forwarding not working.  Is everything for zulip to work started at boot time?  Do I need to start a webserver etc?</p>",
        "id": 966046,
        "sender_full_name": "Jerianobe Bebe",
        "timestamp": 1596168783
    },
    {
        "content": "<p>Yes, everything starts on boot.</p>",
        "id": 966058,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1596174612
    },
    {
        "content": "<p>I have made progress; using nat network and port forwarding I have managed to access zulip on the vm.  I am forwarding port 4443 on the host to port 443 on the vm.  The issue is that zulip is not configured properly to handle this port.  Looking at the page view that is returned:</p>\n<p>&lt;link type=\"text/css\" href=\"<a href=\"https://chat.domain-name.tld/static/webpack-bundles/3b0a8c89f5d304272037.css\">https://chat.domain-name.tld/static/webpack-bundles/3b0a8c89f5d304272037.css</a>\" rel=\"stylesheet\" /&gt;<br>\n&lt;link type=\"text/css\" href=\"<a href=\"https://chat.domain-name.tld/static/webpack-bundles/e1d310786ab6d1285f80.css\">https://chat.domain-name.tld/static/webpack-bundles/e1d310786ab6d1285f80.css</a>\" rel=\"stylesheet\" /&gt;<br>\n&lt;link type=\"text/css\" href=\"<a href=\"https://chat.domain-name.tld/static/webpack-bundles/17a07d89c2c9dad61d39.css\">https://chat.domain-name.tld/static/webpack-bundles/17a07d89c2c9dad61d39.css</a>\" rel=\"stylesheet\" /&gt;<br>\n&lt;link type=\"text/css\" href=\"<a href=\"https://chat.domain-name.tld/static/webpack-bundles/3fe2bb42b30ffad74a02.css\">https://chat.domain-name.tld/static/webpack-bundles/3fe2bb42b30ffad74a02.css</a>\" rel=\"stylesheet\" /&gt;<br>\n        &lt;script type=\"text/javascript\" src=\"<a href=\"https://chat.domain-name.tld/static/webpack-bundles/c868d175161bf448fcb4.js\">https://chat.domain-name.tld/static/webpack-bundles/c868d175161bf448fcb4.js</a>\" defer&gt;&lt;/script&gt;<br>\n&lt;script type=\"text/javascript\" src=\"<a href=\"https://chat.domain-name.tld/static/webpack-bundles/162b7e577595eac038bf.js\">https://chat.domain-name.tld/static/webpack-bundles/162b7e577595eac038bf.js</a>\" defer&gt;&lt;/script&gt;<br>\n&lt;script type=\"text/javascript\" src=\"<a href=\"https://chat.domain-name.tld/static/webpack-bundles/e403d7d3560b85568c2e.js\">https://chat.domain-name.tld/static/webpack-bundles/e403d7d3560b85568c2e.js</a>\" defer&gt;&lt;/script&gt;<br>\n&lt;script type=\"text/javascript\" src=\"<a href=\"https://chat.domain-name.tld/static/webpack-bundles/1a3dfa6a26459fb7e76d.js\">https://chat.domain-name.tld/static/webpack-bundles/1a3dfa6a26459fb7e76d.js</a>\" defer&gt;&lt;/script&gt;<br>\n&lt;script type=\"text/javascript\" src=\"<a href=\"https://chat.domain-name.tld/static/webpack-bundles/c6a3e540ec997caf7d48.js\">https://chat.domain-name.tld/static/webpack-bundles/c6a3e540ec997caf7d48.js</a>\" defer&gt;&lt;/script&gt;<br>\n&lt;script type=\"text/javascript\" src=\"<a href=\"https://chat.domain-name.tld/static/webpack-bundles/signup.404e6eb5a3bfcfab774e.js\">https://chat.domain-name.tld/static/webpack-bundles/signup.404e6eb5a3bfcfab774e.js</a>\" defer&gt;&lt;/script&gt;</p>\n<p>The required port is missing from the url so none of the css or javascript is loaded from the vm.  When I installed it, I put --hostname=chat.domain-name.tld only.  I am guessing that I should have included the port as well?</p>",
        "id": 967385,
        "sender_full_name": "Jerianobe Bebe",
        "timestamp": 1596220393
    },
    {
        "content": "<p>You can edit the <code>EXTERNAL_HOST</code> setting in <a href=\"https://zulip.readthedocs.io/en/latest/production/settings.html\"><code>/etc/zulip/settings.py</code></a>.</p>",
        "id": 967395,
        "sender_full_name": "Anders Kaseorg",
        "timestamp": 1596220839
    },
    {
        "content": "<p>It is working.  Thank you for your help; it was much appreciated.  Now I need to see if I can get an existing member database to work; or will members have to just register again to use chat?</p>",
        "id": 967980,
        "sender_full_name": "Jerianobe Bebe",
        "timestamp": 1596252887
    }
]