[
    {
        "content": "<p>Hi,</p>\n<p>I'm currently introducing Zulip in my organization.</p>\n<p>This is my situation:</p>\n<ol>\n<li>I want to run Zulip on Kubernetes</li>\n<li>I'm trying to connect Zulip to an existing external Postgres cluster on Kubernetes. However, I'm facing difficulties as the Zulip Docker Stack (<a href=\"https://github.com/zulip/docker-zulip\">https://github.com/zulip/docker-zulip</a>) requires a custom Postgres configuration with the pgroonga full-text extension enabled. I need help disabling the pgroonga extension requirement and any further advice on running Zulip on Kubernetes efficiently.</li>\n</ol>\n<p>My questions:</p>\n<ol>\n<li>How can I disable the pgroonga extension requirement in the Zulip Docker Stack? Are there any alternative methods to connect Zulip to our existing external Postgres cluster without using the pgroonga extension?</li>\n<li>Are there any known issues or limitations I should be aware of when running Zulip on Kubernetes, especially when using an external Postgres cluster?</li>\n<li>Are there any best practices or recommendations you can provide for running Zulip on Kubernetes efficiently and securely?</li>\n</ol>",
        "id": 1529288,
        "sender_full_name": "Frederik Sturm",
        "timestamp": 1679410644
    },
    {
        "content": "<p>The docs for <em>enabling</em> pgroonga are available at <a href=\"https://zulip.readthedocs.io/en/latest/subsystems/full-text-search.html\">https://zulip.readthedocs.io/en/latest/subsystems/full-text-search.html</a>. Following them in reverse may help get you to a world without a need for pgroonga, though I've never personally tried it, and it seems possible that you'd need some custom entrypoint scripts or even a forked Docker image to get it all working.</p>",
        "id": 1529476,
        "sender_full_name": "Josh Klar",
        "timestamp": 1679425325
    },
    {
        "content": "<p>The PostgreSQL image has two things in it that differ from upstream: the pgroonga extension, in case folks want to enable that (it is not enabled in the app by default); and the updated stopwords and stemming hunspell.</p>",
        "id": 1529510,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1679427111
    },
    {
        "content": "<p><a href=\"https://zulip.readthedocs.io/en/latest/production/postgresql.html#remote-postgresql-database\">https://zulip.readthedocs.io/en/latest/production/postgresql.html#remote-postgresql-database</a> talks a little about this from the non-Docker angle, though most of that probably applies as well to Docker.</p>",
        "id": 1529511,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1679427157
    },
    {
        "content": "<p><a href=\"https://zulip.readthedocs.io/en/latest/production/deployment.html#using-zulip-with-amazon-rds-as-the-database\">https://zulip.readthedocs.io/en/latest/production/deployment.html#using-zulip-with-amazon-rds-as-the-database</a> is also potentially more of interest.</p>",
        "id": 1529512,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1679427233
    },
    {
        "content": "<p>Though I don't think we've thought through how that interacts with Docker, again.</p>",
        "id": 1529514,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1679427262
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"26549\">@Frederik Sturm</span>: To answer your specific questions:</p>\n<ol>\n<li>pgroonga is optional in the application; unless you enable it, you're fine to backend to a PostgreSQL that doesn't have the extension installed</li>\n<li>I don't think we have any datapoints about that configuration.  I would expect it to run reasonably -- note that there have been reports that something in k8s kills connections, so you may need to adjust keepalives.  See <a class=\"stream-topic\" data-stream-id=\"31\" href=\"/#narrow/stream/31-production-help/topic/idle.20TCP.20connections.20killed.20between.20Zulip.20and.20RabbitMQ\">#production help &gt; idle TCP connections killed between Zulip and RabbitMQ</a> (which is misnamed in the topic, it's about PostgreSQL connections).  Aut his always the slightly fiddly bit with setting up PostgreSQL off-host, since you can't just rely on ident auth -- other than that, and perhaps somewhat worse search due to lack of improved stemming/stopwords, it should work fine.</li>\n<li>We have a <a href=\"https://zulip.readthedocs.io/en/latest/production/deployment.html#using-zulip-with-amazon-rds-as-the-database\">Helm chart</a>, but it has not been battle-tested.  I don't think we have specific guidance on K8S deployments that differs from our general guidance on <a href=\"https://zulip.readthedocs.io/en/latest/production/requirements.html#scalability\">scalability</a> and <a href=\"https://zulip.readthedocs.io/en/latest/production/security-model.html\">security</a> recommendations.  However, we do not ourselves run any Docker deployments, so take the lack of specific notes here with a grain of salt; there may be unknown unknowns.  Of course, if you run across any, we'd love to hear them so we can address them.</li>\n</ol>",
        "id": 1529524,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1679427821
    }
]