[
    {
        "content": "<p>Hello, I have Zulip running and I can access by PC, but from Mobile I do not allow it. I already validate the network access (ping), I resolve the name correctly. Is there any additional configuration to perform so that you can see zulip from a mobile?</p>\n<p>Thank you</p>",
        "id": 242038,
        "sender_full_name": "Manuel",
        "timestamp": 1499092335
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"bootfine@gmail.com\" data-user-id=\"2759\">@Manuel</span> no, it should just work if you have network access.  One possible issue is that the mobile apps require a real SSL certificate (not self-signed)</p>",
        "id": 242084,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1499099607
    },
    {
        "content": "<p>I was able to login to my test machine with both an iPhone (iCab) and iPad (Dolphin.) <span class=\"user-mention\" data-user-email=\"bootfine@gmail.com\" data-user-id=\"2759\">@Manuel</span>, If you see anything in the Zulip log files when you try, the messages would be helpful to know. I can't think of what it might be.</p>",
        "id": 242201,
        "sender_full_name": "Andrea  Longo",
        "timestamp": 1499110946
    },
    {
        "content": "<p>I am using zulip clients published for iphone and android. The communication by browser I have it, I can access to zulip by https but from the mobile clients no. Is there any way to get the error log of the clients ?, Can I download the clients to be able to make a debug?</p>",
        "id": 242298,
        "sender_full_name": "Manuel",
        "timestamp": 1499126486
    },
    {
        "content": "<p>Hmm unfortunately I don't know much about the mobile clients. I only compiled the iOS client once, but don't use it. Perhaps someone in <a href=\"https://chat.zulip.org/#narrow/stream/mobile\" target=\"_blank\" title=\"https://chat.zulip.org/#narrow/stream/mobile\">#mobile</a> would know more.</p>",
        "id": 242404,
        "sender_full_name": "Andrea  Longo",
        "timestamp": 1499138946
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"tabbott@zulipchat.com\" data-user-id=\"7\">@Tim Abbott</span> <span class=\"user-mention\" data-user-email=\"zulip@feorlen.org\" data-user-id=\"397\">@Andrea  Longo</span> Hi, I have performed the installation procedure several times and it happens to me the following:</p>\n<p>When I test in my home wifi, it works without problems but when I perform the same procedure at work I get an error that I can not identify at the moment of clicking the start link (when the organization is created) and you Mail arrives to activate the account. He stays for a while and then falls down. any ideas? What do you need to help me evaluate the problem?</p>",
        "id": 244727,
        "sender_full_name": "Manuel",
        "timestamp": 1499380868
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"bootfine@gmail.com\" data-user-id=\"2759\">@Manuel</span> Let me see if I understand the sequence of events correctly. You are able to connect to your Zulip system from your phone if you are using your home network. And then you receive the email that is sent after creating your organization and account (the account welcome message.) But then after that the system crashes.</p>",
        "id": 244760,
        "sender_full_name": "Andrea  Longo",
        "timestamp": 1499386174
    },
    {
        "content": "<p>But if you try to connect from the same phone, using your office network, you are not able to reach Zulip at all.</p>",
        "id": 244761,
        "sender_full_name": "Andrea  Longo",
        "timestamp": 1499386201
    },
    {
        "content": "<p>If I understand the situation correctly, your office network problem would seem to be a firewall issue. Does that sound possible?</p>",
        "id": 244763,
        "sender_full_name": "Andrea  Longo",
        "timestamp": 1499386253
    },
    {
        "content": "<p>And crashing after creating your account, that should leave evidence in the /var/log/zulip log files. (And possibly rabbitmq or others.)</p>",
        "id": 244765,
        "sender_full_name": "Andrea  Longo",
        "timestamp": 1499386292
    },
    {
        "content": "<p>I would start with the /var/log/zulip/server.log and errors.log. Others may also have useful information.</p>",
        "id": 244771,
        "sender_full_name": "Andrea  Longo",
        "timestamp": 1499386460
    },
    {
        "content": "<p>Also the install.log will show exactly what the install did. While it seems you got through the actual install without errors, it is sometimes a useful reference.</p>",
        "id": 244773,
        "sender_full_name": "Andrea  Longo",
        "timestamp": 1499386525
    },
    {
        "content": "<p>Oh, one other idea. You say you have installed Zulip multiple times. Do you delete any files before trying again?</p>",
        "id": 244777,
        "sender_full_name": "Andrea  Longo",
        "timestamp": 1499386587
    },
    {
        "content": "<p>This may not be appropriate for you, but when I re-install my test system I first do this:<br>\n<code>rm -rf /root/zulip /etc/zulip /var/log/zulip /home/zulip/* /srv/*</code></p>",
        "id": 244778,
        "sender_full_name": "Andrea  Longo",
        "timestamp": 1499386632
    },
    {
        "content": "<p>The install scripts should run correctly even multiple times, however.</p>",
        "id": 244780,
        "sender_full_name": "Andrea  Longo",
        "timestamp": 1499386709
    }
]