[
    {
        "content": "<p>Hello everyone,</p>\n<p>im relay new in this part and i hope some had the same Problem and can help me. In Our Company i must install the Zulip server complety offline.  I can add over other ways offline Repositorys and it had worked for the Focal parts. But by the Universe it wont work. Has anyone an Idea?</p>\n<p>The Zulipserver themself has no internetconnection. </p>\n<p>Or whould you all say that whould work, but for Updates in the future we get the Problems again.</p>\n<p>Thanks you all for your help.</p>\n<p>Thomas</p>",
        "id": 1400878,
        "sender_full_name": "Thomas Bersch",
        "timestamp": 1657168233
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"19\" href=\"/#narrow/stream/19-documentation/topic/Zulip.20Offline.20installation\">#documentation &gt; Zulip Offline installation</a> by <span class=\"user-mention silent\" data-user-id=\"19257\">Alya Abbott</span>.</p>",
        "id": 1400891,
        "sender_full_name": "Notification Bot",
        "timestamp": 1657169792
    },
    {
        "content": "<blockquote>\n<p>Our Company i must install the Zulip server complety offline. </p>\n</blockquote>\n<p>Can you explain why?</p>",
        "id": 1400931,
        "sender_full_name": "Aman (amanagr)",
        "timestamp": 1657181225
    },
    {
        "content": "<p>cause security restrictions. The Mashine will run only internal and has no connection to the internet.</p>",
        "id": 1400958,
        "sender_full_name": "Thomas Bersch",
        "timestamp": 1657190820
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24397\">@Thomas Bersch</span> I'd recommend using the Docker container for offline installation, since that has self-contained image files where you can transfer essentially a single file to do updates.</p>",
        "id": 1401052,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1657215339
    },
    {
        "content": "<p>Hi, Thanks for your Response. So  with docker have at the moment no experience and i must download all files too or am i wrong. Giv it from zulip specil Packages with all in one?</p>\n<p>I Got some Iso Images with the focal repositorys, but with the universe i wont work. The log file only say you need the universe Repository but not which file or software is needed :/</p>",
        "id": 1401498,
        "sender_full_name": "Thomas Bersch",
        "timestamp": 1657253233
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24397\">@Thomas Bersch</span> I'd encourage you to read a bit about Docker images; the Docker supports download an entire installed Zulip server image and then potentially transfer that to your offline system in order to run it.</p>",
        "id": 1401654,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1657294968
    },
    {
        "content": "<p>So Thanks for that. Can you send me  link for the Docker image? I am blind and dont found it X_X.  I am disappointed that there is no offline installation with all the required packages. Furthermore, you cannot read from the logs which packages are missing or causing problems.</p>",
        "id": 1403149,
        "sender_full_name": "Thomas Bersch",
        "timestamp": 1657610627
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"24397\">@Thomas Bersch</span> <a href=\"https://github.com/zulip/docker-zulip\">https://github.com/zulip/docker-zulip</a>.</p>",
        "id": 1403578,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1657654184
    },
    {
        "content": "<p>I also have an issue with my server installation. Should I open a new stream? In short: I want to install tulip server in a isolated environment without internet access. I have a pip and apt mirror in this environment. But still the installation keeps failing,so I wonder : is a offline installation possible at all?</p>",
        "id": 1518930,
        "sender_full_name": "Fabioloso",
        "timestamp": 1678094196
    },
    {
        "content": "<p>A message was moved here from <a class=\"stream-topic\" data-stream-id=\"31\" href=\"/#narrow/stream/31-production-help/topic/installation.20help\">#production help &gt; installation help</a> by <span class=\"user-mention silent\" data-user-id=\"12178\">Alex Vandiver</span>.</p>",
        "id": 1519078,
        "sender_full_name": "Notification Bot",
        "timestamp": 1678113987
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"26320\">@Fabioloso</span>: Zulip expects to have network access during installation; we install packages from apt and pip, but also other sources.  Once installed, Zulip can be used offline -- but if you need offline installation, the Docker container is your best bet.</p>\n<p>(I moved this to a more specific topic)</p>",
        "id": 1519080,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1678114094
    },
    {
        "content": "<p>Hi and thx for your answer! The docker way would be nice , but again the docker compose file expects to be able to pull images from dockerhub. I will try to bypass that, but still one thing would be nice for people like me: having an installer that contains everything but pip and apt, so that the installation becomes a viable option in an nearly isolated environment</p>",
        "id": 1520619,
        "sender_full_name": "Fabioloso",
        "timestamp": 1678276007
    },
    {
        "content": "<p>What if you export the Docker images from the hub and create a script that imports them before running the docker-compose?</p>",
        "id": 1520624,
        "sender_full_name": "Jussi Talaskivi",
        "timestamp": 1678276776
    }
]