[
    {
        "content": "<p>Hi, I've been reading the comments on HN about the realease of Zulip 2 and there was mention of cloudron by <span class=\"user-mention\" data-user-id=\"7\">@Tim Abbott</span>  (I initially pinged you on twitter, but I deleted it because it was probably not the right place for that :) )</p>\n<p>I am a cloudron user and I would really like to have Zulip on my cloudron. Cloudron developers package some apps for the platform, but they can't do everything. (there's probably a 150 apps long request list)</p>\n<p>I know it's a long shot, but if you could package and maintain it for cloudron also, it would be really nice. (And I would be able to finally replace Rocket Chat and Mattermost) </p>\n<p>FYI, if you maintain a package, you can get a free cloudron licence.</p>\n<p>The Zulip app request on their forum: <a href=\"https://forum.cloudron.io/topic/1220/zulip-powerful-open-source-group-chat/4\" target=\"_blank\" title=\"https://forum.cloudron.io/topic/1220/zulip-powerful-open-source-group-chat/4\">https://forum.cloudron.io/topic/1220/zulip-powerful-open-source-group-chat/4</a></p>",
        "id": 712877,
        "sender_full_name": "ruihildt",
        "timestamp": 1551726274
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"11661\">@ruihildt</span> hello!  Would you be interested in being involved in maintaining a Cloudron image based on our Docker container?  I don't think we have the resources to figure out their contribution process right now but I'd be happy to provide advice for someone working on this.</p>",
        "id": 712879,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1551726558
    },
    {
        "content": "<p>One thing I should note is that forum thread mentions a 2GB RAM requirement: one can do more like 1.25-1.5GB with Docker if one limits the resources allocated to memcached and postgres (which will impact scalability), since those run in separate containers.  Our default is to allocated memcached 12.5% and postgres 25% of the RAM, and the rest of a Zuliup server is about 1.25GB.</p>",
        "id": 712880,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1551726625
    },
    {
        "content": "<p>I would love to, but I have next to no knowledge about docker. <br>\nI can't commit as of now to do the required learning, but I might take some time to try this at a later point. (Cloudron devs are also willing to help)</p>\n<p>Regarding RAM requirements, Cloudron allows to manually adjust the ram allocated to an app (and also you can separately adjust RAM allowed to Postgresql globally -so for all apps on cloudron-, not sure about memcached).</p>",
        "id": 712915,
        "sender_full_name": "ruihildt",
        "timestamp": 1551729620
    },
    {
        "content": "<p>Is there a generic Docker packaging documentation for Cloudron? Looking at <a href=\"https://git.cloudron.io/cloudron/rocketchat-app\" target=\"_blank\" title=\"https://git.cloudron.io/cloudron/rocketchat-app\">https://git.cloudron.io/cloudron/rocketchat-app</a>, it is mostly bare Dockerfile with test and manifests, and a custom <a href=\"http://start.sh\" target=\"_blank\" title=\"http://start.sh\">start.sh</a>. It shouldn't take that long to package.</p>",
        "id": 713272,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1551759276
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"2328\">@Rein Zustand</span> might be a good question to post on <a href=\"https://forum.cloudron.io/topic/1220/zulip-powerful-open-source-group-chat/4\" target=\"_blank\" title=\"https://forum.cloudron.io/topic/1220/zulip-powerful-open-source-group-chat/4\">https://forum.cloudron.io/topic/1220/zulip-powerful-open-source-group-chat/4</a> so the cloudron developers so it.</p>",
        "id": 714593,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1551902263
    }
]